Repository: dreistromland/internet-standards.com
Catalog: translations/*/main.po
Languages: de

source: detail tech data http-csp has-unsafe-inline
de: Empfehlung: "unsafe-inline" sollte nicht verwendet werden (#6).

source: detail tech data http-csp missing-invalid-base-uri
de: Empfehlung: "base-uri" mit ausreichend sicherem Wert sollte definiert werden (#2).

source: detail tech data http-csp missing-invalid-default-src
de: Empfehlung: "default-src" sollte mit einem ausreichend sicheren Wert definiert werden (#1).

source: detail tech data http-csp missing-invalid-form-action
de: Empfehlung: "form-action" mit ausreichend sicherem Wert sollte definiert werden (#5).

source: detail tech data http-csp missing-invalid-frame-ancestors
de: Empfehlung: Es sollten "Frame-Anker" mit ausreichend sicherem Wert definiert werden (#4).

source: detail tech data http-csp missing-invalid-frame-src
de: Empfehlung: 'frame-src' (oder child-src' oder 'default-src' als Fallback) mit ausreichend sicherem Wert sollte definiert werden (#3).

source: detail tech data http-csp no-policy-found
de: Kein CSP gefunden.

source: detail tech data http-csp policy-found
de: Abgerufener CSP-Wert: {policy}

source: detail tech data http-referrer-policy bad-invalid
de: Schlecht: Richtlinienwert ist nicht gültig.

source: detail tech data http-referrer-policy bad-no-referrer-when-downgrade
de: Schlecht: 'no-referrer-when-downgrade' darf nicht verwendet werden.

source: detail tech data http-referrer-policy bad-origin
de: Schlecht: "Herkunft" darf nicht verwendet werden.

source: detail tech data http-referrer-policy bad-origin-when-cross-origin
de: Schlecht: "origin-when-cross-origin" darf nicht verwendet werden.

source: detail tech data http-referrer-policy bad-unsafe-url
de: Schlecht: 'unsafe-url' darf nicht verwendet werden.

source: detail tech data http-referrer-policy no-policy
de: Keine Referrer-Policy gefunden.

source: detail tech data http-referrer-policy recommendation-strict-origin
de: Empfehlung: "strict-origin" sollte nicht verwendet werden.

source: detail tech data http-referrer-policy recommendation-strict-origin-when-cross-origin
de: Empfehlung: "strict-origin-when-cross-origin" sollte nicht verwendet werden.

source: detail tech data http-referrer-policy values
de: Gefundene Richtlinie: {Werte}

source: detail tech data http-securitytxt data_after_sig
de: Fehler: Signierte security.txt darf keine Daten nach der Signatur enthalten (Zeile {line_no}).

source: detail tech data http-securitytxt empty_key
de: Fehler: Feldname darf nicht leer sein (Zeile {line_no}).

source: detail tech data http-securitytxt empty_value
de: Fehler: Feldwert darf nicht leer sein (Zeile {line_no}).

source: detail tech data http-securitytxt expired
de: Fehler: Datum und Uhrzeit im Feld 'Expires' dürfen nicht in der Vergangenheit liegen (Zeile {line_no}).

source: detail tech data http-securitytxt invalid_charset
de: Fehler: Der Charset-Parameter im Content-Type-Header muss 'utf-8' sein, falls vorhanden.

source: detail tech data http-securitytxt invalid_expiry
de: Fehler: Datum und Uhrzeit im Feld "Expires" müssen nach ISO 8601 formatiert werden (Zeile {line_no}).

source: detail tech data http-securitytxt invalid_lang
de: Fehler: Der Wert im Feld 'Preferred-Languages' muss mit einem oder mehreren Sprach-Tags gemäß RFC 5646 übereinstimmen, die durch Kommas getrennt sind (Zeile {line_no}).

source: detail tech data http-securitytxt invalid_line
de: Fehler: Die Zeile muss einen Feldnamen und einen Wert enthalten, es sei denn, die Zeile ist leer oder enthält einen Kommentar (Zeile {line_no}).

source: detail tech data http-securitytxt invalid_media
de: Fehler: Der Medientyp im Content-Type-Header muss 'text/plain' sein.

source: detail tech data http-securitytxt location
de: Fehler: security.txt befand sich auf der obersten Pfadebene (legacy place), muss aber unter dem Pfad '/.well-known/' abgelegt werden.

source: detail tech data http-securitytxt long_expiry
de: Empfehlung: Datum und Uhrzeit im Feld "Expires" sollten weniger als ein Jahr in der Zukunft liegen (Zeile {line_no}).

source: detail tech data http-securitytxt multi_expire
de: Fehler: Das Feld "Expires" darf nicht mehr als einmal vorkommen.

source: detail tech data http-securitytxt multi_lang
de: Fehler: Das Feld "Bevorzugte Sprachen" darf nicht mehr als einmal vorkommen.

source: detail tech data http-securitytxt multiple_csaf_fields
de: Empfehlung: Mehrere "CSAF"-Felder sollten auf ein "CSAF"-Feld zurückgeführt werden.

source: detail tech data http-securitytxt no_canonical
de: Empfehlung: Das Feld "Canonical" sollte in einer signierten Datei vorhanden sein.

source: detail tech data http-securitytxt no_canonical_match
de: Fehler: Die Web-URI von security.txt (d.h. bei einer Weiterleitung mindestens die letzte URI der Weiterleitungskette) muss in einem 'Canonical'-Feld aufgeführt werden, falls vorhanden.

source: detail tech data http-securitytxt no_contact
de: Fehler: Das Feld "Kontakt" muss mindestens einmal vorkommen.

source: detail tech data http-securitytxt no_content_type
de: Fehler: HTTP Content-Type Header muss gesendet werden.

source: detail tech data http-securitytxt no_csaf_file
de: Fehler: Jedes optionale 'CSAF'-Feld muss auf eine Datei namens 'provider-metadata.json' verweisen.

source: detail tech data http-securitytxt no_encryption
de: Empfehlung: Das Feld "Verschlüsselung" sollte vorhanden sein, wenn das Feld "Kontakt" eine E-Mail-Adresse enthält.

source: detail tech data http-securitytxt no_expire
de: Fehler: Das Feld "Expires" muss vorhanden sein.

source: detail tech data http-securitytxt no_https
de: Fehler: Web-URI muss mit 'https://' beginnen (Zeile {line_no}).

source: detail tech data http-securitytxt no_line_separators
de: Fehler: Jede Zeile muss entweder mit einem Wagenrücklauf und einem Zeilenvorschubzeichen oder nur mit einem Zeilenvorschubzeichen enden.

source: detail tech data http-securitytxt no_security_txt_404
de: Fehler: security.txt konnte nicht gefunden werden.

source: detail tech data http-securitytxt no_security_txt_other
de: Fehler: security.txt konnte nicht gefunden werden (unerwarteter HTTP-Antwortcode {status_code}).

source: detail tech data http-securitytxt no_space
de: Fehler: Feldtrennzeichen (Doppelpunkt) muss von einem Leerzeichen gefolgt werden (Zeile {line_no}).

source: detail tech data http-securitytxt no_uri
de: Fehler: Feldwert muss ein URI sein (z.B. beginnend mit 'mailto:') (Zeile {line_no}).

source: detail tech data http-securitytxt not_signed
de: Empfehlung: security.txt sollte digital signiert werden.

source: detail tech data http-securitytxt pgp_data_error
de: Fehler: Signed security.txt muss einen korrekten ASCII-armierten PGP-Block enthalten.

source: detail tech data http-securitytxt pgp_error
de: Fehler: Das Dekodieren oder Parsen der signierten security.txt muss erfolgreich sein.

source: detail tech data http-securitytxt prec_ws
de: Fehler: Vor dem Feldtrennzeichen (Doppelpunkt) darf kein Leerzeichen stehen (Zeile {line_no}).

source: detail tech data http-securitytxt requested-from
de: security.txt angefordert von {hostname}.

source: detail tech data http-securitytxt retrieved-from
de: security.txt, abgerufen von {hostname}.

source: detail tech data http-securitytxt signed_format_issue
de: Fehler: Signierte security.txt muss mit dem Header '-----BEGIN PGP SIGNED MESSAGE-----' beginnen.

source: detail tech data http-securitytxt unknown_field
de: Benachrichtigung: security.txt enthält ein unbekanntes Feld. Entweder handelt es sich um ein benutzerdefiniertes Feld, das möglicherweise nicht allgemein unterstützt wird, oder es liegt ein Tippfehler in einem standardisierten Feldnamen vor (Zeile {line_no}).

source: detail tech data http-securitytxt utf8
de: Fehler: Der Inhalt muss utf-8 kodiert sein.

source: detail tech data insecure
de: unsicher

source: detail tech data insufficient
de: insufficient

source: detail tech data no
de: keine

source: detail tech data not-applicable
de: nicht anwendbar

source: detail tech data not-reachable
de: nicht erreichbar

source: detail tech data not-testable
de: nicht prüfbar

source: detail tech data not-tested
de: nicht getestet

source: detail tech data phase-out
de: auslaufen lassen

source: detail tech data secure
de: sicher

source: detail tech data sufficient
de: sufficient

source: detail tech data yes
de: ja

source: detail verdict could-not-test
de: Testfehler. Bitte versuche es später noch einmal.

source: detail verdict not-tested
de: Dieser Untertest wurde nicht durchgeführt, weil entweder ein übergeordneter Test, von dem dieser Untertest abhängt, ein negatives Ergebnis lieferte oder nicht genügend Informationen für die Durchführung dieses Untertests verfügbar waren.

source: detail web appsecpriv http-csp exp
de: Wir prüfen, ob dein Webserver einen HTTP-Header für `Content-Security-Policy` (CSP) bereitstellt. Außerdem prüfen wir verschiedene sichere CSP-Einstellungen, obwohl wir die Wirksamkeit deiner CSP-Konfiguration *nicht* erschöpfend testen. CSP schützt eine Website vor Content-Injection-Angriffen, einschließlich Cross-Site-Scripting (XSS). Indem du CSP verwendest, um eine "Erlaubnisliste" mit *Quellen zugelassener Inhalte* zu konfigurieren, verhinderst du, dass Browser bösartige Inhalte von Angreifern laden. Wir testen die folgenden Regeln, die auf guten Praktiken für eine sichere CSP-Konfiguration basieren. 1. Die Direktive `default-src` sollte definiert werden und ihr Wert sollte entweder `'none'` oder `'self'` und/oder eine oder mehrere URLs der Domain selbst (einschließlich ihrer Subdomain oder Superdomain) sein. Dies dient dazu, eine restriktive Standard-Fallback-Policy für Quelltypen zu haben, die in deiner Website verwendet werden und für die keine spezifische Policy definiert ist. Neben den genannten Werten kann auch "report-sample" angegeben werden, falls du möchtest, dass Codebeispiele zusammen mit den "violation reports" gesendet werden. 2. Die Direktive `base-uri` sollte definiert werden und ihr Wert sollte entweder `'none'` oder `'self'` und/oder eine oder mehrere URLs der Domain selbst (einschließlich ihrer Subdomain oder Superdomain) sein. Dies schränkt die `baseURI` ein, um die Injektion eines manipulierten `<base>` Elements zu verhindern. Dies schränkt die Möglichkeiten von Angreifern ein, die Orte von Quellen (z. B. Skripte) zu manipulieren, die von relativen URLs geladen werden. 3. Die Direktive "frame-src" sollte verwendet werden (entweder per Definition oder durch den Fallback auf "child-src" und "default-src") und ihr Wert sollte entweder "none" oder "self" und/oder eine oder mehrere bestimmte URLs sein. Dadurch wird verhindert, dass Inhalte von nicht autorisierten Seiten in Frames oder in deine Website eingebettet werden (mit HTML-Elementen wie `<frame>` und `<iframe>`). 4. Die Direktive `frame-ancestors` sollte definiert werden, und ihr Wert sollte entweder `'none'`, oder `'self'` und/oder eine oder mehrere bestimmte URLs sein. Dies verhindert, dass nicht autorisierte Websites deine Website einrahmen oder einbetten (mit den HTML-Elementen `<frame>`, `<iframe>`, `<object>`, `<embed>` oder `<applet>`). 5. Die Direktive `form-action` sollte definiert werden und ihr Wert sollte entweder `'none'` oder `'self'` und/oder eine oder mehrere bestimmte URLs sein. Dies schränkt die URLs ein, die als Ziel von Formularübermittlungen verwendet werden können. 6. Die Quellwerte `unsafe-eval`, `unsafe-inline` und `unsafe-hashes` sollten *nicht* verwendet werden, da sie XSS-Angriffe ermöglichen. 7. Das Schema `data:` sollte *nicht* in den Direktiven `default-src`, `script-src` und `object-src` verwendet werden, da dies XSS-Angriffe ermöglicht. 8. Eine Domain mit dem Schema `http://` oder eine Domain ohne Schema sollte *nicht* verwendet werden, weil dadurch Quellen über eine unsichere Verbindung heruntergeladen werden können. Verwende stattdessen das `https://` Schema. 9. Ein Platzhalter (z.B. `*`) für den vollständigen Host-Teil einer URL sollte *nicht* in einer Direktive verwendet werden, da dies jede externe Quelle zulässt. Außerdem darfst du *nicht* nur `https:` verwenden, denn das ist gleichbedeutend mit `https://*`. Gib immer auch die Hauptdomain an (z.B. `https://scripts.example.nl` oder `https://*.example.nl`). 10. 127.0.0.1" sollte *nicht* in einer Direktive verwendet werden, da es in einem kompromittierten System Content-Injection-Angriffe ermöglicht. Zusätzliche Empfehlungen: 1. Verwende in CSP-Direktiven nur möglichst spezifische Domains, was in diesem Subtest für CSP in gewissem Umfang automatisch getestet wird. * Erlaube *nicht* alle Domains unter einer TLD (`*.nl`) oder SLD (`*.gov.uk`), obwohl wir derzeit *nicht* darauf testen. * Erlaube *keine* andere Hauptdomain unter einer SLD in `default-src` (z.B. `example2.gov.nl` für `example1.gov.nl`), obwohl wir dies derzeit *nicht* testen. 2. Verwende idealerweise *keine* Inline-Skripte oder Stile. In Fällen, in denen du Inline-Skripte oder -Stile nicht vermeiden kannst, verwende *nicht* `unsafe-inline` (wie oben erwähnt), sondern verwende vorzugsweise CSP-Hashes oder andernfalls CSP-Nonces. 3. Verwende den HTTP-Header als Mechanismus für die Bereitstellung deiner CSP-Richtlinie. Verwende *nicht* das HTML-Element `<meta>`, um deine CSP-Richtlinie bereitzustellen. Letzteres ist weniger sicher und unterstützt nicht alle CSP-Direktiven (z. B. die erforderlichen `frame-ancestors`). Deshalb prüfen wir *nicht*, ob die CSP über das HTML-<meta>>-Element angeboten wird. 5. Verwende den HTTP-Header für `Content-Security-Policy-Report-Only`, um mit deiner CSP-Konfiguration zu experimentieren, indem du ihre Wirkung beobachtest, ohne sie zu erzwingen. 6. Beachte, dass eine leere Quellenliste (d.h. eine CSP-Direktive ohne Wert) gleichbedeutend ist mit einer Quellenliste, die `keine` enthält. Beachte außerdem, dass das Attribut "keine" ignoriert wird, wenn andere Quellen in einer Quellenliste neben "keine" aufgeführt sind. Siehe auch ['Web application guidelines from NCSC-NL'](https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties), Richtlinie U/PW.03 (auf Niederländisch). *Requirement level: Empfohlen*

source: detail web appsecpriv http-csp label
de: Content-Security-Policy

source: detail web appsecpriv http-csp tech table
de: Webserver IP-Adresse|Fundstücke

source: detail web appsecpriv http-csp verdict bad
de: Dein Webserver bietet *keine* Content-Security-Policy (CSP) an oder bietet CSP mit bestimmten *unsicheren* Einstellungen an.

source: detail web appsecpriv http-csp verdict good
de: Dein Webserver bietet eine Content-Security-Policy (CSP) und verwendet bestimmte unsichere CSP-Einstellungen nicht.

source: detail web appsecpriv http-referrer-policy exp
de: Wir prüfen, ob dein Webserver einen HTTP-Header für die "Referrer-Policy" mit einem ausreichend sicheren und datenschutzfreundlichen Policy-Wert bereitstellt. Mit dieser Richtlinie teilt dein Webserver den Browsern mit, ob, was und wann Referrer-Daten an die Website gesendet werden sollen, zu der der Nutzer von deiner Website aus navigiert. Diese Referrer-Daten werden im "Referer"-Header des Browsers an die Website gesendet, zu der der Nutzer navigiert. Diese Navigation muss nicht unbedingt domänenübergreifend sein. Die Daten im "Referer"-Header werden normalerweise für Analysen und die Protokollierung verwendet. Es kann jedoch Datenschutz- und Sicherheitsrisiken geben. Die Daten könnten z.B. für das Tracking von Nutzern verwendet werden und Dritten, die die Verbindung abhören, zugespielt werden. Mit dem HTTP-Header für "Referrer-Policy" kannst du diese Risiken mindern, indem du das Senden von Referrer-Daten kontrollierst und sogar minimierst. Wir empfehlen dir, unter Berücksichtigung der Datenschutz- und Sicherheitsrisiken eine bewusste Entscheidung für eine der beiden folgenden Richtlinien zu treffen. **1. Gut** * `no-referrer` * `same-origin` Mit diesen Richtlinienwerten werden keine sensiblen Referrer-Daten an Dritte gesendet. **2. Warnung** * `strict-origin` * `strict-origin-when-cross-origin` (Standardwert des Browsers; siehe auch unter Zusatzhinweis 2) Mit diesen Richtlinienwerten werden grundlegende Referrer-Daten, die sensibel sein können, nur über sichere Verbindungen (HTTPS) an Dritte gesendet. Daher sollten diese Werte nur verwendet werden, wenn dies notwendig und gesetzlich zulässig ist. **3. Schlecht** * `no-referrer-when-downgrade` * `Origin-when-cross-origin` * `origin` * `unsafe-url` Mit diesen Richtlinienwerten werden alle oder grundlegende Referrer-Daten, die sensibel sein können, an Dritte gesendet, möglicherweise über unsichere Verbindungen (HTTP). Daher dürfen diese Werte nicht verwendet werden. **Zusätzliche Hinweise:** 1. Um zu verhindern, dass sensible Daten über URLs weitergegeben werden, stelle bitte sicher, dass die URLs deiner Website keine persönlichen oder anderweitig sensiblen Daten enthalten (wie z. B. persönliche Namen oder Passwörter). 2. strict-origin-when-cross-origin" ist der Standardwert, wenn keine "Referrer-Policy" veröffentlicht wird, wie im aktuellen "Editor's Draft" des "Referrer-Policy"-Standards vorgeschrieben, und dieser Standard wird von allen aktuellen großen Browsern verwendet. Beachte, dass einige Nutzerinnen und Nutzer möglicherweise einen anderen Standardwert in ihrem Browser eingestellt haben. 3. Verwende den HTTP `Referrer-Policy`-Header als Mechanismus, um deine Referrer-Policy zu übermitteln. Wir empfehlen *nicht*, das HTML `<meta>`-Element oder das HTML `referrerpolicy`-Inhaltsattribut zu verwenden, um deine Referrer-Policy zu veröffentlichen, insbesondere weil die Abschnitte, die diese Methoden im Standard beschreiben, als "nicht normativ" gekennzeichnet sind. Deshalb prüfen wir nicht, ob eine Referrer-Policy über die beiden letztgenannten Methoden angeboten wird. 4. Beachte, dass ein Webserver mehrere "Referrer-Policy"-Header senden kann und dass ein "Referrer-Policy"-Header mehrere Werte enthalten kann. Unbekannte Werte werden vom Browser ignoriert und nur der letzte bekannte Wert wird verwendet. Dies ermöglicht es, zukünftige standardisierte Policy-Werte zu verwenden, die noch nicht von allen Browsern unterstützt werden. Derzeit unterstützen jedoch alle aktuellen großen Browser die oben genannten Policy-Werte unter "Gut" und "Warnung". *Requirement level: Empfohlen*

source: detail web appsecpriv http-referrer-policy label
de: Referrer-Richtlinie

source: detail web appsecpriv http-referrer-policy tech table
de: Webserver IP-Adresse|Fundstücke

source: detail web appsecpriv http-referrer-policy verdict bad
de: Dein Webserver bietet eine Referrer-Policy mit einem Policy-Wert an, der *nicht* ausreichend sicher und datenschutzfreundlich ist.

source: detail web appsecpriv http-referrer-policy verdict good
de: Dein Webserver bietet eine Referrer-Policy mit einem Policy-Wert, der ausreichend sicher und datenschutzfreundlich ist.

source: detail web appsecpriv http-referrer-policy verdict recommendations
de: Dein Webserver bietet entweder *keine* Referrer-Policy an und verlässt sich daher auf die Standard-Browser-Policy, oder dein Webserver bietet eine Referrer-Policy mit einem Policy-Wert an, der aufgrund seiner potenziellen Auswirkungen auf Sicherheit und Datenschutz mit Vorsicht zu genießen ist.

source: detail web appsecpriv http-securitytxt exp
de: Wir prüfen, ob dein Webserver eine `security.txt`-Datei am richtigen Ort bereitstellt, ob sie abgerufen werden kann und ob ihr Inhalt syntaktisch gültig ist. Die Datei `security.txt` ist eine Textdatei mit Kontaktinformationen, die du auf deinem Webserver hinterlegst. Sicherheitsforscher können diese Informationen nutzen, um die richtige Abteilung oder Person in deinem Unternehmen direkt über Schwachstellen zu informieren, die sie in deiner Website oder deinen IT-Systemen gefunden haben. Dies kann die Behebung gefundener Schwachstellen beschleunigen und die Möglichkeiten für böswillige Parteien verringern, diese auszunutzen. Die Syntax der Datei sollte sowohl maschinen- als auch menschenlesbar sein. Bei den Kontaktinformationen kann es sich um eine E-Mail-Adresse, eine Telefonnummer und/oder eine Webseite (z. B. ein Webformular) handeln. Beachte, dass veröffentlichte Kontaktinformationen öffentlich sind und auch missbraucht werden können, z. B. um Spam an eine veröffentlichte E-Mail-Adresse zu senden. Neben den Kontaktinformationen muss die Datei `security.txt` auch ein Ablaufdatum enthalten. Um zu vermeiden, dass es veraltet, wird empfohlen, dass das Datum weniger als ein Jahr in der Zukunft liegt. Es ist optional, auch andere relevante Informationen für Sicherheitsforscher hinzuzufügen, wie z. B. einen Link zu deiner Richtlinie für den Umgang mit Meldungen von Sicherheitslücken (normalerweise Coordinated Vulnerability Disclosure Policy genannt). Es wird empfohlen, die Datei `security.txt` mit PGP zu signieren und die Web-URI, auf der sich die Datei befindet, in einem Feld `Canonical` anzugeben. Wir überprüfen, ob die Datei `security.txt` signiert ist. Wir validieren die Signatur jedoch *nicht*, da es leider keinen standardisierten Ort gibt, an dem man einen öffentlichen PGP-Schlüssel abrufen kann (der für die Signaturvalidierung benötigt wird). Wenn ein oder mehrere `Canonical`-Felder vorhanden sind, muss die Web-URI der `security.txt`-Datei in einem `Canonical`-Feld aufgeführt sein. Bei der Weiterleitung zu einer "security.txt"-Datei muss mindestens der letzte URI der Weiterleitungskette angegeben werden. Die Datei muss unter dem Pfad `/.well-known/` veröffentlicht werden. Beachte, dass es veraltet ist, sie unter dem Top-Level-Pfad zu platzieren. Jede Web(sub)domain sollte ihre eigene Datei `security.txt` haben. Eine Beispieldatei findest du auf [`https://example.nl/.well-known/security.txt`](https://example.nl/.well-known/security.txt). Die Weiterleitung zu einer `security.txt` auf einem anderen Domainnamen ist erlaubt. Vor allem bei einem großen Domainnamen-Portfolio ist es aus Sicht der Wartung ratsam, die Domainnamen auf eine zentrale `security.txt` umzuleiten. Beachte, dass die `security.txt`-Dateien normalerweise nur wenige Kilobyte groß sind. Wir lesen und bewerten daher maximal die ersten 100 kB einer gefundenen `security.txt`-Datei. *Requirement level: Empfohlen*

source: detail web appsecpriv http-securitytxt label
de: sicherheit.txt

source: detail web appsecpriv http-securitytxt tech table
de: Webserver-IP-Adresse|Findings

source: detail web appsecpriv http-securitytxt verdict bad
de: Dein Webserver bietet *keine* security.txt-Datei am richtigen Ort an, sie konnte *nicht* abgerufen werden, oder ihr Inhalt ist *nicht* syntaktisch gültig.

source: detail web appsecpriv http-securitytxt verdict good
de: Dein Webserver bietet eine security.txt-Datei an der richtigen Stelle an und ihr Inhalt ist syntaktisch gültig.

source: detail web appsecpriv http-securitytxt verdict recommendations
de: Dein Webserver bietet eine security.txt-Datei an der richtigen Stelle an und ihr Inhalt ist syntaktisch gültig. Allerdings gibt es eine oder mehrere Empfehlungen zur Verbesserung.
