Repository: dreistromland/internet-standards.com
Catalog: translations/*/main.po
Languages: de

source: faqs report score content
de: ### Welche Norm verwendet Internet.nl? Internet.nl prüft die (korrekte) Umsetzung moderner Internetstandards, die die Zuverlässigkeit von Online-Diensten verbessern. Ein Ergebnis von 100 % bedeutet, dass eine Website, ein E-Mail-Dienst oder eine Internetverbindung unserer Prüfnorm entspricht. Diese Norm basiert auf den Internetstandards auf der "comply-or-explain"-Liste des niederländischen Standardisierungsforums, auf den Sicherheitsempfehlungen des niederländischen NCSC und auf den relevanten RFCs der IETF. ### Wird die Norm angepasst werden? Die Testnorm von Internet.nl wird im Laufe der Zeit angepasst, wenn sich der Stand der Technik ändert. Die Anpassungen werden durch Nachrichten auf unserer Website bekannt gegeben. Neue Untertests haben nach ihrer ersten Veröffentlichung (normalerweise) keinen Einfluss auf die Punktzahl und haben den Status "EMPFOHLEN" oder "OPTIONAL". In Zukunft könnten diese neuen Elemente den Status "ERFORDERLICH" erhalten und in die Gesamtbewertung einfließen. ### Wie verhält sich die Bewertung zur Sicherheit? Obwohl viele der getesteten internen Standards zu einem höheren Sicherheitsniveau deiner Website, deines Maildienstes oder deiner Internetverbindung beitragen, bedeutet eine 100%ige Bewertung nicht, dass ein Online-Dienst vollständig sicher ist. Es gibt noch weitere Aspekte, die für die Sicherheit deines Online-Dienstes wichtig sind. Aber diese sind für Internet.nl nicht von Belang. Bitte bedenke, dass Internet.nl als Test zur Einhaltung von Standards gedacht ist und nicht als Sicherheitstest. ### Wie ist der Testbericht aufgebaut? Internet.nl enthält **drei Haupttests**, d.h. für Websites, Maildienste und Internetverbindungen. Diese Haupttests bestehen aus **Testkategorien**, die **Untertests** enthalten. Einer der Haupttests ist zum Beispiel der Website-Test, der eine Testkategorie zu HTTPS enthält, die einen Untertest zu HSTS hat. Ein Subtest kann eine der folgenden drei Anforderungsstufen haben (in Übereinstimmung mit [RFC 2119](https://www.rfc-editor.org/rfc/rfc2119)): - REQUIRED ("muss") - RECOMMENDED ("sollte") - OPTIONAL ("kann") Wenn ein Untertest entweder "EMPFOHLEN" oder "OPTIONAL" ist, wird dies in der Prüfungserklärung erwähnt. ### Wie wird die prozentuale Punktzahl berechnet? - Jeder Haupttest führt zu einer prozentualen Gesamtpunktzahl. - Jede Prüfungskategorie eines Haupttests fließt mehr oder weniger gleichmäßig in die Gesamtprozentzahl ein. Wenn also ein Haupttest aus vier Testkategorien besteht, beträgt die maximale Punktzahl für jede Testkategorie 25%. - Nur die Untertests mit dem Status "ERFORDERLICH" fließen in die Punktzahl einer Testkategorie und in die prozentuale Gesamtpunktzahl ein. - Websites mit einer perfekten Punktzahl von 100% werden in die [Hall of Fame](/halloffame/) aufgenommen.

source: faqs report score title
de: Norm und Punktzahl

source: faqs report subtest bad
de: Schlecht: Nicht bestanden bei einem ERFORDERLICHEN Untertest ⇒ null Punkte

source: faqs report subtest error
de: Testfehler: Fehler bei der Prüfung aufgetreten ⇒ null Punkte

source: faqs report subtest good
de: Gut: Bestehen des VERPFLICHTETEN, EMPFOHLENEN oder OPTIONALEN Untertests ⇒ erster: volle Punktzahl / die letzten beiden: kein Einfluss auf die Punktzahl

source: faqs report subtest info
de: Informativ: Nichtbestehen des OPTIONALEN Untertests ⇒ keine Auswirkung auf die Punktzahl

source: faqs report subtest not-tested
de: Nicht getestet, weil der zugehörige übergeordnete Subtest bereits nicht bestanden wurde ⇒ Nullpunkt

source: faqs report subtest title
de: Icons pro Untertest

source: faqs report subtest warning
de: Warnung: Fail bei RECOMMENDED Subtest ⇒ keine Auswirkung auf die Punktzahl

source: faqs report test bad
de: Schlecht: mindestens einen VERPFLICHTETEN Untertest nicht bestanden ⇒ keine volle Punktzahl in der Testkategorie

source: faqs report test error
de: Prüfungsfehler: Ausführungsfehler bei mindestens einem Untertest ⇒ kein Ergebnis in der Prüfungskategorie

source: faqs report test good
de: Gut: alle Untertests bestanden ⇒ volle Punktzahl in der Testkategorie

source: faqs report test info
de: Informativ: mindestens einen OPTIONALEN Untertest nicht bestanden ⇒ volle Punktzahl in der Testkategorie

source: faqs report test title
de: Icons pro Testkategorie

source: faqs report test warning
de: Warnung: Mindestens einen EMPFOHLENEN Untertest nicht bestanden ⇒ volle Punktzahl in der Testkategorie

source: faqs report title
de: Erläuterung des Prüfberichts

source: faqs rpki content
de: ## Warum * [Beispiele für BGP-Hijacks](https://rpki.readthedocs.io/en/latest/ops/resources.html#examples-of-bgp-hijacks) in der RPKI-Dokumentation * [Examples of Routing Incidents](https://www.icann.org/en/system/files/files/sac-121-en.pdf) in SAC121 / SSAC Briefing on Routing Security (Kapitel 2) * [RFC 7908: Problemdefinition und Klassifizierung von BGP-Routenlecks](https://www.rfc-editor.org/rfc/rfc7908) ## Benutzungsstatistiken * [Route Origin Authorisation (ROA) statistics](https://roa-stats.manrs.org/) von MANRS * [Route Origin Authorisation (ROA)-Statistiken](https://rpki-maps.nlnetlabs.nl) von NLnet Labs * [.nl statistics for Route Origin Authorisation (ROA)](https://stats.sidnlabs.nl/en/security.html#domain%20names%20protected%20with%20rpki) von SIDN Labs * [Route Origin Validation (ROV)-Statistiken](https://stats.labs.apnic.net/rpki) von APNIC ## Hintergrundinformationen * [RPKI-Dokumentation](https://rpki.readthedocs.io) vom RPKI-Team bei NLnet Labs und der RPKI-Community * [Mutually Agreed Norms for Routing Security (MANRS)](https://www.manrs.org/) ## Spezifikationen * [RFC 3779: X.509 Extensions for IP Addresses and AS Identifiers](https://www.rfc-editor.org/rfc/rfc3779) * [RFC 6482: A Profile for Route Origin Authorizations (ROAs)](https://www.rfc-editor.org/rfc/rfc6482) * [RFC 6811: BGP Prefix Origin Validation](https://www.rfc-editor.org/rfc/rfc6811) * [RPKI RFCs Graph](https://rpki-rfc.routingsecurity.net/)

source: faqs rpki title
de: Autorisierung für Routing (RPKI)

source: faqs starttls content
de: ## Warum * ["Opportunistic Security: Some Protection Most of the Time"](https://www.rfc-editor.org/rfc/rfc7435) von V. Dukhovni * ["New e-mail security protocols mandatory within government"](https://www.sidnlabs.nl/a/weblog/new-e-mail-security-protocols-mandatory-within-government?language_id=2) von Marco Davids (SIDN) * ["Der traurige Zustand der SMTP-Verschlüsselung"](https://blog.filippo.io/the-sad-state-of-smtp-encryption/) von Filippo Valsorda ## Benutzungsstatistiken * [DANE-Trendgrafiken](https://stats.dnssec-tools.org/#/graphs?top=dane) * [DANE-Statistiken](https://github.com/baknu/DANE-for-SMTP/wiki/4.-Adoption-statistics) * [.nl Statistiken über DANE](https://stats.sidnlabs.nl/en/mail.html) von SIDN Labs * [Google-Statistiken zu STARTTLS](https://www.google.com/transparencyreport/saferemail/?hl=en) ## Hintergrundinformationen * [How-to zu 'DANE for SMTP'](https://toolbox.internet.nl) von Dutch Internet Standards Platform * [Wiki zu 'DANE für SMTP'](https://github.com/baknu/DANE-for-SMTP/wiki) * [FAQ zu E-Mail-Sicherheitsstandards](https://www.sidn.nl/en/modern-internet-standards/e-mail-security-standards) von SIDN * [Factsheet "Sichern Sie die Verbindungen von Mailservern"](https://english.ncsc.nl/publications/factsheets/2019/juni/01/factsheet-secure-the-connections-of-mail-servers) von NCSC-NL * ["IT-Sicherheitsrichtlinien für Transport Layer Security (TLS), v2.1"](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL ## Spezifikationen * [RFC 3207: SMTP Service Extension for Secure SMTP over Transport Layer Security](https://www.rfc-editor.org/rfc/rfc3207) * [RFC 7672: SMTP Security via Opportunistic DNS-Based Authentication of Named Entities (DANE) Transport Layer Security (TLS)](https://www.rfc-editor.org/rfc/rfc7672) * [RFC 7671: Das DNS-Based Authentication of Named Entities (DANE) Protokoll: Updates and Operational Guidance](https://www.rfc-editor.org/rfc/rfc7671)

source: faqs starttls title
de: Sicherer E-Mail-Transport (STARTTLS und DANE)

source: faqs title
de: Wissensbasis

source: halloffame champions menu
de: Champions!

source: halloffame champions subtitle
de: 100% im Website- *und* E-Mail-Test

source: halloffame champions text
de: Die folgenden {{count}} Domains haben sowohl im Website-Test als auch im E-Mail-Test 100% erreicht. Wer in diese Ruhmeshalle aufgenommen wird, darf [beide 100%-Plaketten](/faqs/badges/) verwenden.

source: halloffame champions title
de: Hall of Fame - Champions!

source: halloffame mail badge
de: Abzeichen mit Text: 100% Ergebnis im E-Mail-Test

source: halloffame mail menu
de: E-Mail

source: halloffame mail subtitle
de: 100% im E-Mail-Test

source: halloffame mail text
de: Die folgenden {{count}} Domains haben 100% im E-Mail-Test erreicht. Wer in diese Ruhmeshalle aufgenommen wird, darf [das 100%-E-Mail-Abzeichen](/faqs/badges/) verwenden.

source: halloffame mail title
de: Ruhmeshalle - E-Mail

source: halloffame web badge
de: Abzeichen mit Text: 100% Punktzahl im Website-Test

source: halloffame web menu
de: Websites

source: halloffame web subtitle
de: 100% im Website-Test

source: halloffame web text
de: Die folgenden {{count}} Domains haben 100% im Website-Test erreicht. Wer in diese Ruhmeshalle aufgenommen wird, darf [das 100%-Website-Abzeichen](/faqs/badges/) verwenden.

source: halloffame web title
de: Ruhmeshalle - Websites

source: home pagetitle
de: Test für moderne Internetstandards wie IPv6, DNSSEC, HTTPS, DMARC, STARTTLS und DANE.

source: home stats connection
de: einzigartige Verbindungen

source: home stats header
de: Tests in Zahlen

source: home stats mail
de: einzigartige E-Mail-Domains

source: home stats website
de: einzigartige Webdomains

source: home teaser
de: Moderne Internetstandards sorgen für mehr Zuverlässigkeit und weiteres Wachstum des Internets. Nutzt du sie?

source: mail pagetitle
de: E-Mail-Test:

source: mail title
de: E-Mail-Test: {{prettyaddr}}

source: mail tweetmessage
de: The%20mail%20server%20at%20{{report.domain}}%20scores%20{{score}}%25%20in%20the%20email%20test%20of%20%40Internet_nl%3A

source: page gotocontents
de: Zum Inhalt gehen

source: page gotofooter
de: Gehe zur Fußzeile

source: page gotomainmenu
de: Gehe zum Hauptmenü

source: page metadescription
de: Test für moderne Internetstandards IPv6, DNSSEC, HTTPS, HSTS, DMARC, DKIM, SPF, STARTTLS, DANE, RPKI und security.txt

source: page metakeywords
de: IPv6, DNSSEC, HTTPS, HSTS, TLS, DMARC, DKIM, SPF, STARTTLS, DANE, RPKI, security.txt, CSP, Content Security Policy, security headers, test, test tool, check, validation, Internet, Internet Standards, offene Standards, moderne Standards, security, internet security, mail, email security, website, website security, internet connection, secure connection, email authentication, encryption, ciphers, cipher suites, PKI, SSL certificate, TLS certificate, website certificaat, Internet Standards Platform

source: page sitedescription
de: Ist dein Internet auf dem neuesten Stand?

source: page sitetitle
de: Internet.nl

source: page404 content
de: Die Seite, nach der du suchst, befindet sich nicht auf diesem Server. [Gehe zur Startseite](/)

source: page404 title
de: Seite nicht gefunden!

source: privacy content
de: # Datenschutzerklärung *Aktualisiert am 24. Oktober 2023* Die niederländische Plattform für Internetstandards respektiert deine Privatsphäre und ist bestrebt, die Erhebung und Verarbeitung deiner persönlichen Daten so gering wie möglich zu halten. Mit dieser Datenschutzerklärung möchten wir dich darüber informieren, welche personenbezogenen Daten wir erfassen, wenn du unsere Website und andere Dienste auf Internet.nl nutzt, und wie wir diese Daten verarbeiten. Deine Rechte sind in den geltenden Gesetzen geregelt, vor allem in der [Europäischen Datenschutz-Grundverordnung (GDPR)](https://eur-lex.europa.eu/legal-content/EN/TXT/HTML/?uri=CELEX:32016R0679) und dem [Niederländischen Telekommunikationsgesetz](https://wetten.overheid.nl/BWBR0009950/). ## Welche Daten werden gesammelt? ### Website (Internet.nl) #### Anwendung Wenn du Internet.nl nutzt, erheben wir die folgenden Daten, die für das Funktionieren der Website notwendig sind. - IP-Adresse deines Clients (Remote Host), der die Anfrage an unseren Webserver gestellt hat: - Wenn ein Verbindungstest durchgeführt wird, werden nur deine *anonymisierte* IP-Adresse und dein *anonymisierter* Reverse-Name in der Anwendungsdatenbank gespeichert und im Verbindungstestbericht angezeigt, der für den Nutzer über einen Permalink zugänglich ist. - In allen anderen Fällen wird deine (vollständige oder anonymisierte) IP-Adresse *nicht* in der Anwendungsdatenbank gespeichert. - Domänennamen, die du für die Durchführung von E-Mail- oder Website-Tests angegeben hast: - Die Domänennamen werden in der Anwendungsdatenbank gespeichert. Sie werden in den Testberichten angezeigt, die dem Nutzer über einen Permalink zur Verfügung stehen, und können in der Ruhmeshalle angezeigt werden. - Es wird nur der Domänenname gespeichert, aber *nicht* der "lokale Teil" (d. h. der Teil vor @example.nl) einer angegebenen E-Mail-Adresse. #### Server-Protokolle Zur Behebung von Verbindungsproblemen und zur Lösung von (Sicherheits-)Vorfällen speichern wir die folgenden Daten in unseren Webserver-Logs. - IP-Adresse des Clients (Remote Host), der die Anfrage an unseren Webserver gestellt hat; - Die Uhrzeit, zu der die Anfrage empfangen wurde; - User-Agent HTTP Request Header, den dein Client-Browser über sich selbst gemeldet hat; - Statuscode, den der Server an deinen Client zurückschickt; - Größe des Objekts, das an deinen Kunden zurückgegeben wird; - Fehlermeldung in Bezug auf die Bearbeitung der Anfrage. #### Nutzeranalyse Wir setzen analytische Cookies auf deinem Gerät, um die Nutzung unserer Website zu analysieren. Wir verwenden Matomo (ehemals Piwik) auf unserem eigenen Webserver. Matomo ist eines der datenschutzfreundlichsten Analysetools, die es derzeit gibt. Die mit diesen Cookies erstellten Statistiken werden ausschließlich zur Verbesserung unserer Website verwendet. Wir sammeln die folgenden Daten: - IP-Adresse (anonymisiert); - Sehr grober Standort des Nutzers basierend auf der anonymisierten IP-Adresse; - Datum und Uhrzeit; - Titel der aufgerufenen Seite; - URL der aufgerufenen Seite; - URL der Seite, die vor der aktuellen Seite aufgerufen wurde; - Bildschirmauflösung; - Uhrzeit in der lokalen Zeitzone; - Dateien, die angeklickt und heruntergeladen wurden; - Link-Klicks auf eine externe Domain; - Zeit der Seitengenerierung; - Hauptsprache des Browsers; - User Agent des Browsers. Da die Auswirkungen dieser analytischen Cookies auf deine Privatsphäre angesichts der GDPR und des Abschnitts 11.7a des niederländischen Telekommunikationsgesetzes sehr begrenzt sind, musst du dafür nicht deine Zustimmung geben. Wenn du nicht möchtest, dass wir dein Gerät verfolgen, empfehlen wir dir, die Funktion *Do Not Track* in deinem Browser zu aktivieren. Matomo wird Nutzer/innen, die die Do Not Track-Funktion nutzen, nicht verfolgen (siehe [diese Seite](https://matomo.org/docs/privacy/#step-4-respect-donottrack-preference) auf Matomo.org). Weitere Informationen über Do Not Track und wie du sie in deinem Browser aktivierst, findest du auf der Website [All About Do Not Track](https://allaboutdnt.com/). ### E-Mail (@internet.nl) Wenn du E-Mails an [question@internet.nl](mailto:question@internet.nl) schickst, erheben wir die folgenden Daten: - Verwendete E-Mail-Adresse und andere E-Mail-Kopfdaten (wie die Uhrzeit); - Alle anderen persönlichen Daten, die der Absender in der E-Mail angegeben hat. ## Welche Dienste von Drittanbietern werden genutzt? ### WHOIS Bei dem Website- und E-Mail-Test wird der Registrar der getesteten Domain über WHOIS abgefragt. Zu diesem Zweck erfolgt eine Abfrage des [IANA WHOIS Service](https://www.iana.org/whois) und des WHOIS Service der jeweiligen TLD-Registrierungsstelle (z.B. des [WHOIS Service von SIDN](https://www.sidn.nl/whois)) über das WHOIS-Protokoll (Klartext auf TCP-Port 43). ### Team Cymru * In der RPKI-Testkomponente des Website- und E-Mail-Tests wird für jede gefundene IP-Adresse der entsprechende BGP Origin ASN mit dem ["IP to ASN Mapping Service"](https://team-cymru.com/community-services/ip-asn-mapping/) von Team Cymru abgefragt. * Beim Verbindungstest wird für die IP-Adressen deines Kunden und deines DNS-Anbieters die ASN-Beschreibung (zur Benennung des ISP und des DNS-Anbieters) mit dem ["IP to ASN Mapping Service"] von Team Cymru abgefragt (https://team-cymru.com/community-services/ip-asn-mapping/). Die IP-Adressen werden vor der Abfrage so weit wie möglich anonymisiert (für IPv4 auf ein /24, für IPv6 auf ein /48). Die Abfrage erfolgt über DNS auf UDP-Port 53. ### Reverse DNS Beim Verbindungstest wird der umgekehrte Name für die nicht anonymisierte IP-Adresse deines Kunden (über ["in-addr.arpa" und "ip6.arpa"](https://www.iana.org/domains/arpa)) mit unserem lokalen DNS-Resolver abgefragt. ### Sentry Wir verwenden [Sentry](https://sentry.io/), um Abstürze und ähnliche Fehler in Tests und Seiten zu protokollieren. Zu diesem Zweck senden wir Sentry die getestete Domain, alle im Test gesammelten Informationen und die HTTP-Header der Anfrage. Die IP-Adresse deines Clients gehört nicht zu den Informationen, die wir an Sentry senden. Informationen werden nur bei Test- oder Seitenabbrüchen übermittelt. Es werden keine Informationen über durchgeführte Tests oder angeforderte Seiten weitergegeben, die nicht zu Abstürzen führen. ### Öffentliche DNS-Auflöser Das [Internet.nl Dashboard](https://dashboard.internet.nl) prüft, ob ein bestimmter Domain-Name gültige DNS-Antworten zurückgibt und ist mit den folgenden öffentlichen DNS-Resolvern testbar: [CZ.NIC](https://www.nic.cz/page/4219/kopie-otevrene-dnssec-validujici-resolvery/), [Quad9](https://www.quad9.net/) und [dns0.eu](https://www.dns0.eu/). ## Welche Maßnahmen werden zur Sicherung der gesammelten Daten ergriffen? ### Zugang und Drittparteien Unsere Dienste laufen auf Servern, die von Prolocation ([einzelne Test-Website](https://internet.nl) und [Batch-Test-API](https://batch.internet.nl)) und von TransIP ([Dashboard](https://dashboard.internet.nl)) gehostet werden. ECP ist für den Betrieb der Mailbox zuständig. Die gesammelten Daten und erhaltenen Informationen dürfen nur an andere [Mitglieder der Internet Standards Platform](/about/) weitergegeben werden, um Fragen zu beantworten, Probleme zu lösen oder unsere Dienste zu verbessern. Mit Ausnahme der unter "Welche Dienste von Drittanbietern werden genutzt?" aufgeführten Dienste werden keine Dienste von Drittanbietern genutzt (wie z. B. externe Analysetools oder Webfonts). Wir geben die von uns erhobenen personenbezogenen Daten in keiner Weise an Dritte (d. h. außerhalb der Internet-Standardisierungsplattform) weiter, es sei denn, wir sind gesetzlich dazu verpflichtet (z. B. wenn die Behörden mit einer Rechtsgrundlage Daten von uns anfordern). ### Technische Maßnahmen Wir haben u.a. die folgenden technischen Maßnahmen ergriffen, um deine personenbezogenen Daten zu schützen: - Es werden moderne, sichere Standards eingesetzt. Wir halten unsere eigenen Tests ein. Unser Webserver bietet z.B. eine verschlüsselte Verbindung (HTTPS) und die Domain ist signiert (DNSSEC). Beachte, dass der Verbindungstest teilweise HTTP (anstelle von HTTPS) verwendet. Das liegt daran, dass bei diesem Test auch geprüft wird, ob der Webbrowser des Besuchers eine direkte Verbindung zu einer IP-Adresse herstellen kann, und leider sind Zertifikate für IP-Adressen sehr unüblich. Wir planen jedoch, dies zu verbessern; - Die Software auf unseren Servern wird regelmäßig aktualisiert; - Unsere Techniker/innen verwenden eine starke Authentifizierung für den Zugang zu den Servern. Solltest du trotz unserer Bemühungen eine Schwachstelle finden, handele bitte in Übereinstimmung mit unseren [responsible disclosure](/disclosure/) Richtlinien. ### Anonymisierung - Anwendung: Die Anonymisierung der IP-Adresse deines Clients bedeutet, dass mindestens die letzten 16 Bits jeder IPv4-Adresse und die letzten 96 Bits jeder IPv6-Adresse verworfen und durch Nullen ersetzt werden, bevor sie in der Anwendungsdatenbank gespeichert werden (z.B. ist nur 198.51.0.0 oder 2001:db8:: sichtbar). Außerdem anonymisieren wir den gefundenen Reverse-Namen, indem wir die ersten ein oder mehreren Labels maskieren. Durch die Anonymisierung der IP-Adresse und des Reverse-Namens stellen wir sicher, dass es in der Regel fast unmöglich ist, diese direkt mit einer Person in Verbindung zu bringen, auch nicht mit den anderen gesammelten Daten. IP-Adressen, die zu Webservern, Mailservern oder Nameservern gehören, werden nicht anonymisiert, da wir diese Daten als öffentliche Daten betrachten, die im DNS veröffentlicht werden. Das Gleiche gilt für Domain-Namen; auch diese betrachten wir als öffentliche Daten. - Benutzeranalytik: Mindestens 16 Bits für IPv4 und 80 Bits für IPv6 werden verworfen und durch Nullen ersetzt, bevor eine IP-Adresse in unserem Analysetool gespeichert wird (z. B. ist nur 198.51.0.0 oder 2001:db81:85a3:: sichtbar). ### Dauer der Datenspeicherung - Anwendung: Da die anonymisierte Besucher-IP-Adresse und die damit verbundenen gesammelten Daten nicht direkt mit einer Person in Verbindung gebracht werden können, haben wir keine spezielle Aufbewahrungsfrist für die in unserer Anwendungsdatenbank gespeicherten Daten. - Server-Protokolle: Die in unseren Serverprotokollen erfassten Daten werden nach drei Kalendermonaten gelöscht. - Nutzeranalysen: Individuelle Besucherdaten (einschließlich der anonymisierten IP-Adresse) in unseren Analysetools werden nach 90 Tagen gelöscht. - E-Mails: Die Verarbeitung von E-Mails ist eine Kernaktivität von The Dutch Internet Standards Platform. Basierend auf den [Anforderungen](https://www.belastingdienst.nl/wps/wcm/connect/bldcontentnl/belastingdienst/zakelijk/ondernemen/administratie/administratie_opzetten/wat_hoort_er_allemaal_bij_uw_administratie) der niederländischen Steuer- und Zollverwaltung wird die E-Mail-Korrespondenz nach sieben Jahren gelöscht. ## Einsichtnahme, Berichtigung und Löschung von Daten Gemäß der europäischen Datenschutzgrundverordnung (GDPR) hast du das Recht, auf Anfrage Einsicht in deine personenbezogenen Daten zu nehmen und sie gegebenenfalls zu ändern oder löschen zu lassen. Bitte [kontaktiere uns](/about/), falls du dies wünschst. Da wir deine vollständige IP-Adresse nur vorübergehend in unseren Serverprotokollen speichern, kann es sein, dass du uns zusätzliche Informationen, z. B. über dein Gerät und deinen Browser sowie das Datum und die Uhrzeit deines Besuchs, zur Verfügung stellen musst, damit wir deine Anfrage bearbeiten können. ## Aktualisierung der Datenschutzerklärung Wir können unsere Datenschutzerklärung ändern. Wir werden diese Änderung auf unserer Website ankündigen. Ältere Versionen unserer Datenschutzerklärung werden in unserem Archiv gespeichert. Schicke uns eine E-Mail, wenn du sie einsehen möchtest.

source: probes auto-redirect
de: Wenn alle Tests abgeschlossen sind, wirst du automatisch zur Ergebnisseite weitergeleitet. beendet sind.

source: probes no-javascript
de: Prüfe, ob die Testergebnisse verfügbar sind. Wenn nicht, wirst du hierher weitergeleitet stattdessen.

source: probes no-javascript-connection
de: JavaScript ist inaktiv. Bitte aktiviere JavaScript, um den Test durchführen zu können.

source: probes no-redirection
de: Testfehler. Bitte versuche es später noch einmal oder teste einen anderen Domainnamen.

source: probes test-finished
de: Test beendet! Ergebnisse verfügbar...

source: probes test-running
de: Laufen...

source: probes tests-description
de: Die folgenden Punkte werden getestet.
