Repository: dreistromland/internet-standards.com
Catalog: translations/*/main.po
Languages: de

source: detail web tls https-hsts exp
de: Wir prüfen, ob dein Webserver HSTS unterstützt. Browser merken sich HSTS pro (Sub-)Domain. Wenn du nicht für jede (Sub-)Domain (in einer Weiterleitungskette) einen HSTS-Header hinzufügst, sind die Nutzer/innen möglicherweise anfällig für MITM-Angriffe. Deshalb prüfen wir HSTS beim ersten Kontakt, d. h. vor jeder Weiterleitung. HSTS zwingt einen Webbrowser, sich direkt über HTTPS zu verbinden, wenn er deine Website aufruft. Das hilft, Man-in-the-Middle-Angriffe zu verhindern. Wir halten eine HSTS-Cache-Gültigkeitsdauer von *mindestens* 1 Jahr (`max-age=31536000`) für ausreichend sicher. Ein langer Zeitraum ist von Vorteil, weil er auch seltene Besucher schützt. Wenn du jedoch aufhören willst, HTTPS zu unterstützen (was generell eine schlechte Idee ist), musst du länger warten, bis die Gültigkeit der HSTS-Richtlinie in allen Browsern, die deine Website besucht haben, abgelaufen ist. Der Test prüft **nicht**, ob `Preload` verwendet wird und ob die Domain in der [HSTS Preload List](https://hstspreload.org/) enthalten ist. --- **Einführungsempfehlung** HSTS setzt voraus, dass deine Website vollständig über HTTPS funktioniert. Dazu gehört auch ein gültiges Zertifikat von einer vertrauenswürdigen Zertifizierungsstelle. Wenn deine Website also nicht ordnungsgemäß HTTPS unterstützt, beachte, dass sie von Browsern, die deine Website zuvor kontaktiert haben, *nicht erreichbar* sein wird. Eine Änderung der HSTS-Richtlinie hat für diese Browser keine unmittelbare Auswirkung, da sie deine vorherige HSTS-Richtlinie zwischengespeichert haben. Deshalb raten wir dir, die unten stehenden Schritte zur Umsetzung zu befolgen: 1. Stelle sicher, dass die Website auf deiner Domain jetzt und in Zukunft vollständig über HTTPS funktioniert (z. B. durch ein solides Verfahren zur Umstellung des Zertifikats); 2. Erhöhe die Gültigkeitsdauer des HSTS-Caches in den unten aufgeführten Schritten. Prüfe in jeder Phase sorgfältig auf Erreichbarkeitsprobleme und fehlerhafte Seiten. Behebe alle auftretenden Probleme und warte dann die gesamte maximale Gültigkeitsdauer der Stufe ab, bevor du zur nächsten Stufe übergehst. - Beginne mit 5 Minuten (`max-age=300`); - Erhöhe sie auf 1 Woche (`max-age=604800`); - Erhöhe sie auf 1 Monat (`max-age=2592000`); - Erhöhe sie auf 1 Jahr (`max-age=31536000`) oder mehr. 3. Wiederhole Schritt 1 und 2 für jede einzelne Subdomain, die du mit HSTS sichern willst. Verwende `includeSubDomains` nur, wenn du ganz sicher bist, dass **alle** (verschachtelten) Subdomains deiner Domain HTTPS jetzt und in Zukunft unterstützen. 4. Verwende `preload` **nur**, wenn du ganz sicher bist, dass deine Domain in die [HSTS Preload List](https://hstspreload.org/) aufgenommen werden soll. Das HSTS-Preloading ist vor allem für hochsensible Websites interessant. Administratoren, die das HSTS-Preloading für eine bestimmte Domain aktivieren wollen, sollten dies mit äußerster Vorsicht tun. Es kann die Erreichbarkeit der Domain und aller Subdomains beeinträchtigen und lässt sich nicht einfach rückgängig machen. --- Siehe ['Web Application Guidelines, detailed version'](https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties) von NCSC-NL, Richtlinie U/WA.05 (auf Niederländisch).

source: detail web tls https-hsts label
de: HSTS

source: detail web tls https-hsts tech table
de: Webserver IP-Adresse|HSTS-Richtlinie

source: detail web tls https-hsts verdict bad
de: Dein Webserver bietet *keine* HSTS-Richtlinie an.

source: detail web tls https-hsts verdict good
de: Dein Webserver bietet eine HSTS-Richtlinie an.

source: detail web tls https-hsts verdict other
de: Dein Webserver bietet eine HSTS-Richtlinie mit einer Cache-Gültigkeitsdauer (`max-age`), die *nicht* lang genug ist (d.h. weniger als 1 Jahr).

source: detail web tls kex-hash-func exp
de: Wir prüfen, ob dein Webserver sichere Hash-Funktionen unterstützt, um die digitale Signatur beim Schlüsselaustausch zu erstellen. Der Webserver verwendet während des Schlüsselaustauschs eine digitale Signatur, um den Besitz des geheimen Schlüssels zu beweisen, der dem Zertifikat entspricht. Der Webserver erstellt diese digitale Signatur, indem er die Ausgabe einer Hash-Funktion signiert. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Tabelle 5. *Anforderungsstufe: Empfohlen* --- **SHA2-Unterstützung für Signaturen** * Gut: Ja (SHA-256, SHA-384 oder SHA-512 unterstützt) * Auslaufend: Nein (SHA-256, SHA-384 oder SHA-512 werden *nicht* unterstützt)

source: detail web tls kex-hash-func label
de: Hash-Funktion für den Schlüsselaustausch

source: detail web tls kex-hash-func tech table
de: Webserver IP-Adresse|SHA2-Unterstützung für Signaturen

source: detail web tls kex-hash-func verdict good
de: Dein Webserver unterstützt eine sichere Hash-Funktion für den Schlüsselaustausch.

source: detail web tls kex-hash-func verdict other
de: Wir konnten die von deinem Webserver verwendete Hash-Funktion nicht ermitteln. Das könnte daran liegen, dass die verwendete Verschlüsselungskombination keine Signatur für die Zertifikatsüberprüfung hat (z.B. RSA-Schlüsselaustausch oder anonym, d.h. "anon").

source: detail web tls kex-hash-func verdict phase-out
de: Dein Webserver unterstützt *keine* sichere Hash-Funktion für den Schlüsselaustausch. Du solltest diese Einstellung absichtlich *auslaufen* lassen, denn es besteht die Gefahr, dass sie in Zukunft *unzureichend* sicher wird.

source: detail web tls ocsp-stapling exp
de: Wir prüfen, ob dein Webserver die [TLS Certificate Status extension](https://www.rfc-editor.org/rfc/rfc6961) unterstützt. auch bekannt als OCSP Stapling. Der Webbrowser kann die Gültigkeit des vom Webserver vorgelegten Zertifikats überprüfen, indem er die Zertifizierungsstelle über das OCSP-Protokoll kontaktiert. OCSP liefert einer Zertifizierungsstelle Informationen über Browser, die mit dem Webserver kommunizieren: Dies kann ein Datenschutzrisiko darstellen. Ein Webserver kann den Browsern auch selbst OCSP-Antworten über OCSP-Stapling zur Verfügung stellen. Dies löst das Datenschutzrisiko, erfordert keine Verbindung zwischen Webbrowser und Zertifizierungsstelle und ist zudem schneller. Wenn wir uns mit deinem Webserver verbinden, verwenden wir die TLS-Zertifikatsstatuserweiterung, um OCSP-Daten in der Serverantwort anzufordern. Wenn dein Webserver OCSP-Daten in der Antwort enthält, überprüfen wir, ob die OCSP-Daten gültig sind, d. h. von einer bekannten Zertifizierungsstelle korrekt signiert wurden. Hinweis: Wir verwenden die OCSP-Daten nicht, um die Gültigkeit des Zertifikats zu bewerten. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Tabelle 15 (auf Englisch). *Anforderungsstufe: Optional* --- **OCSP-Heftung** * Gut: Auf * Ausreichend: Aus

source: detail web tls ocsp-stapling label
de: OCSP Stacking

source: detail web tls ocsp-stapling tech table
de: Webserver IP-Adresse|OCSP-Heftung

source: detail web tls ocsp-stapling verdict bad
de: Dein Webserver unterstützt OCSP Stapling, aber die Daten in der Antwort sind *nicht* gültig.

source: detail web tls ocsp-stapling verdict good
de: Dein Webserver unterstützt OCSP Stapling und die Daten in der Antwort sind gültig.

source: detail web tls ocsp-stapling verdict ok
de: Dein Webserver unterstützt OCSP-Heftung *nicht*.

source: detail web tls renegotiation-client exp
de: Wir prüfen, ob ein Client (normalerweise ein Webbrowser) eine Neuverhandlung mit deinem Webserver einleiten kann. Es ist in der Regel nicht notwendig, dass Clients eine Neuverhandlung initiieren, da sie einen Webserver für DoS-Angriffe innerhalb einer TLS-Verbindung öffnen. Ein Angreifer kann ähnliche DoS-Angriffe auch ohne clientinitiierte Neuverhandlung durchführen, indem er viele parallele TLS-Verbindungen öffnet. Beachte, dass die vom Kunden initiierte Neuverhandlung die Verfügbarkeit und nicht die Vertraulichkeit beeinträchtigt. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B8-1 und Tabelle 13 (auf Englisch). *Anforderungsstufe: Optional* --- **Kundeninitiierte Neuverhandlung** * Gut: Aus (oder N/A für TLS 1.3) * Ausreichend: Ein

source: detail web tls renegotiation-client label
de: Neuverhandlung auf Initiative des Kunden

source: detail web tls renegotiation-client tech table
de: Webserver IP-Adresse|Client-initiierte Neuverhandlung

source: detail web tls renegotiation-client verdict bad
de: Dein Webserver lässt eine vom Kunden initiierte Neuverhandlung zu, die sich negativ auf die Verfügbarkeit deiner Website auswirken kann.

source: detail web tls renegotiation-client verdict good
de: Dein Webserver lässt keine vom Kunden initiierte Neuverhandlung zu.

source: detail web tls renegotiation-secure exp
de: Wir prüfen, ob dein Webserver eine sichere Neuaushandlung unterstützt. Ältere Versionen von TLS (vor TLS 1.3) erlauben es, einen neuen Handshake zu erzwingen. Diese so genannte Neuverhandlung war in ihrem ursprünglichen Design unsicher. Der Standard wurde repariert und ein sicherer Neuverhandlungsmechanismus wurde hinzugefügt. Die alte Version wird seitdem als unsichere Neuaushandlung bezeichnet und sollte deaktiviert werden. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B8-1 und Tabelle 12 (auf Englisch). --- **unsichere Neuaushandlung** * Gut: Aus (oder N/A für TLS 1.3) * Unzureichend: Ein

source: detail web tls renegotiation-secure label
de: Sichere Neuverhandlung

source: detail web tls renegotiation-secure tech table
de: Webserver IP-Adresse|Sichere Neuverhandlung

source: detail web tls renegotiation-secure verdict bad
de: Dein Webserver unterstützt eine unsichere Neuaushandlung, die offensichtlich *nicht* sicher ist. sicher.

source: detail web tls renegotiation-secure verdict good
de: Dein Webserver unterstützt eine sichere Neuverhandlung.

source: detail web tls version exp
de: Wir prüfen, ob dein Webserver nur sichere TLS-Versionen unterstützt. Ein Webserver kann mehr als eine TLS-Version unterstützen. Beachte, dass die Browserhersteller angekündigt haben, dass sie TLS 1.1 und 1.0 nicht mehr unterstützen werden. Dies wird dazu führen, dass Websites, die TLS 1.2 und/oder 1.3 nicht unterstützen, nicht mehr erreichbar sind. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B1-1 und Tabelle 1 (auf Englisch). --- **Version** * Gut: TLS 1.3 * Ausreichend: TLS 1.2 * Auslaufend: TLS 1.1 und 1.0 * Unzureichend: SSL 3.0, 2.0 und 1.0

source: detail web tls version label
de: TLS-Version

source: detail web tls version tech table
de: Webserver IP-Adresse|TLS-Version|Status

source: detail web tls version verdict bad
de: Dein Webserver unterstützt *unzureichend* sichere TLS-Versionen.

source: detail web tls version verdict good
de: Dein Webserver unterstützt nur sichere TLS-Versionen.

source: detail web tls version verdict phase-out
de: Dein Webserver unterstützt TLS-Versionen, die absichtlich *aus dem Verkehr gezogen* werden sollten, weil sie bekanntermaßen anfällig sind und Gefahr laufen, *unzureichend* sicher zu werden.

source: detail web tls zero-rtt exp
de: Wir prüfen, ob dein Webserver Zero Round Trip Time Resumption (0-RTT) unterstützt. 0-RTT ist eine Option in TLS 1.3, die die Anwendungsdaten während der ersten Handshake-Nachricht transportiert. 0-RTT bietet keinen Schutz gegen Replay-Angriffe auf der der TLS-Schicht und sollte daher deaktiviert werden. Obwohl das Risiko gemindert werden kann, indem 0-RTT nicht für nicht-idempotente Anfragen zulässt, ist eine solche Konfiguration oft nicht trivial, von der Anwendungslogik abhängig und daher fehleranfällig. Wenn dein Webserver TLS 1.3 nicht unterstützt, ist der Test nicht anwendbar. Bei Webservern, die TLS 1.3 unterstützen, wird die Index `/`-Seite der Website mit TLS 1.3 abgerufen und die Menge der [frühe Daten](https://www.openssl.org/docs/manmaster/man3/SSL_get_max_early_data.html) Unterstützung [angegeben](https://www.rfc-editor.org/rfc/rfc8446#section-4.2.10) durch den Server geprüft. Wenn der Wert größer als Null ist, wird eine zweite Verbindung hergestellt, die die TLS-Sitzungsdaten der ersten Verbindung, sendet aber die HTTP-Anfrage _vor_ dem TLS-Handshake (d. h. keine Roundtrips (0-RTT) erforderlich bevor die Daten an den Server gesendet werden). Wenn der TLS-Handshake abgeschlossen ist und antwortet der Webserver mit einer nicht-[HTTP 425 Too Early](https://www.rfc-editor.org/rfc/rfc8470#section-5.2) Antwort antwortet, dann wird davon ausgegangen, dass der Webserver 0-RTT unterstützt. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B9-1 und Tabelle 14 (auf Englisch). --- **0-RTT** * Gut: Aus (oder N/A vor TLS 1.3) * Unzureichend: Ein

source: detail web tls zero-rtt label
de: 0-RTT

source: detail web tls zero-rtt tech table
de: Webserver IP-Adresse|0-RTT

source: detail web tls zero-rtt verdict bad
de: Dein Webserver unterstützt 0-RTT, was *nicht* sicher ist.

source: detail web tls zero-rtt verdict good
de: Dein Webserver unterstützt 0-RTT nicht.

source: detail web tls zero-rtt verdict na
de: Dieser Untertest ist nicht anwendbar, da dein Webserver TLS 1.3 nicht unterstützt.

source: detail web-mail ipv6 ns-AAAA exp
de: Wir prüfen, ob dein Domainname mindestens zwei Nameserver mit einer IPv6-Adresse hat. Dies steht im Einklang mit den ["Technischen Anforderungen für die Registrierung und Nutzung von .nl-Domainnamen"](https://www.sidn.nl/downloads/KwpW_ORWRWetYuoBp5GeYA/7e91faddb53ad85b8c6a2fce15d764cb/Technical_requirements_for_the_registration_and_use_of_nl_domain_names.pdf) d.d. 13. November 2017 von SIDN (.nl TLD-Registrierungsstelle), wonach jede .nl-Domain mindestens zwei Nameserver haben muss. IPv4-mapped IPv6-Adressen" ([RFC 4291](https://www.rfc-editor.org/rfc/rfc4291), beginnend mit ::ffff:) fallen bei diesem Test durch, da sie *keine* IPv6-Konnektivität bieten.

source: detail web-mail ipv6 ns-AAAA label
de: IPv6-Adressen für Nameserver

source: detail web-mail ipv6 ns-AAAA tech table
de: Nameserver|IPv6-Adresse|IPv4-Adresse

source: detail web-mail ipv6 ns-AAAA verdict bad
de: Keiner der Nameserver deiner Domain hat eine IPv6-Adresse.

source: detail web-mail ipv6 ns-AAAA verdict good
de: Zwei oder mehr Nameserver deiner Domain haben eine IPv6-Adresse.

source: detail web-mail ipv6 ns-AAAA verdict other
de: Nur ein Nameserver deiner Domain hat eine IPv6-Adresse.

source: detail web-mail ipv6 ns-reach exp
de: Wir prüfen, ob alle Nameserver, die einen AAAA-Eintrag mit IPv6-Adresse haben, über über IPv6 erreichbar sind.

source: detail web-mail ipv6 ns-reach label
de: IPv6-Erreichbarkeit von Nameservern

source: detail web-mail ipv6 ns-reach tech table
de: Nameserver|Unerreichbare IPv6-Adresse

source: detail web-mail ipv6 ns-reach verdict bad
de: *Nicht* alle Nameserver, die eine IPv6-Adresse haben, sind über IPv6 erreichbar.

source: detail web-mail ipv6 ns-reach verdict good
de: Alle Nameserver, die eine IPv6-Adresse haben, sind über IPv6 erreichbar.

source: detail web-mail rpki ns-exists exp
de: Wir prüfen, ob für alle IP-Adressen der Nameserver deiner Domain eine RPKI Route Origin Authorization (ROA) veröffentlicht wurde. Dein Hoster (oder sein Netzwerkanbieter) gibt über das Border Gateway Protocol (BGP) bekannt, für welche seiner IP-Adressblöcke er eingehenden Internetverkehr annimmt. Andere Netzwerkanbieter nutzen diese Routenankündigungen, um zu bestimmen, über welche Route sie den Verkehr für die IP-Adressen deines Servers senden sollen. Eine Routenankündigung kann jedoch gefälscht werden. Tatsächlich kann ein anderer Netzbetreiber den IP-Adressblock deiner IP-Adresse mit seinem Netz verbinden und so möglicherweise Internetverkehr empfangen, der eigentlich für deinen Netzbetreiber bestimmt ist. Die Ursache kann versehentlich oder böswillig sein. In jedem Fall kann dies dazu führen, dass dein Server unerreichbar wird oder dass der Internetverkehr zu deinem Server abgefangen wird. Die Resource Public Key Infrastructure (RPKI) verbessert den Schutz davor erheblich. Mit RPKI kann der rechtmäßige Inhaber eines Blocks von IP-Adressen eine digital signierte Erklärung mit Routenberechtigung (Route Origin Authorisation, kurz ROA) veröffentlichen. Ein anderer Netzbetreiber, der Internetverkehr an eine bestimmte IP-Adresse senden möchte, kann die entsprechende Erklärung nutzen, um "ungültige" Routen herauszufiltern. Auf diese Weise verhindert der Netzwerkanbieter, dass Internetverkehr aus seinem Netzwerk an nicht autorisierte Providernetzwerke gesendet wird. *Anforderungsstufe: Empfohlen*

source: detail web-mail rpki ns-exists label
de: Route Herkunft Autorisierung Existenz

source: detail web-mail rpki ns-exists tech table
de: Nameserver|IP-Adresse|RPKI Route Origin Autorisierung

source: detail web-mail rpki ns-exists verdict bad
de: Für mindestens eine der IP-Adressen deiner Nameserver wird *keine* RPKI Route Origin Authorisation (ROA) veröffentlicht.

source: detail web-mail rpki ns-exists verdict good
de: Für alle IP-Adressen deiner Nameserver wird eine RPKI Route Origin Authorisation (ROA) veröffentlicht.

source: detail web-mail rpki ns-exists verdict no-addresses
de: Deine Domain enthält *keine* Nameserver. Daher konnte dieser Subtest nicht durchgeführt werden.

source: detail web-mail rpki ns-valid exp
de: Wir prüfen, ob der Validierungsstatus für alle IP-Adressen der Nameserver deiner Domain `Gültig` ist. Wenn es mehrere sich überschneidende Routenankündigungen für die IP-Adresse gibt, prüfen wir, ob sie alle `Gültig` sind. Dein Hoster (oder sein Netzwerkprovider) kündigt über das Border Gateway Protocol (BGP) an, für welche seiner IP-Adressblöcke er eingehenden Internetverkehr annimmt. Er tut dies, indem er (Teile) seiner IP-Adressblöcke (Route Prefix) mit der eindeutigen Nummer seines Providernetzes (Route Origin ASN) verknüpft und dann diese Routing-Informationen weitergibt. Andere Netzbetreiber nutzen diese Routenankündigungen, um zu bestimmen, über welche Route sie den Verkehr für die IP-Adressen senden sollen. Zusätzlich sollte dein Hoster (oder sein Netzwerkanbieter) für jede Routenankündigung eine digital signierte Erklärung mit einer Routenautorisierung (Route Origin Authorisation; abgekürzt: ROA) unter Verwendung der Resource Public Key Infrastructure (RPKI) veröffentlichen. Ein anderer Netzwerkanbieter, der gebeten wird, Internetverkehr an die IP-Adresse deines Servers zu senden, kann die zugehörige Erklärung kryptografisch verifizieren. Der verifizierte Inhalt (Validated ROA Payload; abgekürzt: VRP) enthält, welche Provider-Netzwerke (VRP ASN) für jeden aufgezeichneten IP-Adressblock (VRP-Präfix) zum Empfang von Internetverkehr berechtigt sind. Der Netzbetreiber kann diesen Inhalt dann nutzen, um BGP-Routen zu filtern. So kann er z.B. alle "ungültigen" Routen zurückweisen, um zu verhindern, dass Internetverkehr aus seinem Netz an nicht autorisierte Providernetze gesendet wird. Die Überprüfung von Routenankündigungen gegen Routenautorisierungen (RPKI Origin Validation; abgekürzt: ROV) hat die folgenden drei möglichen Ergebnisse. - `Gültig`: Die Routenankündigung der betreffenden IP-Adresse wird mit mindestens einer veröffentlichten Routengenehmigung abgeglichen. Eine Routenzulassung wird auch für spezifischere Routenankündigungen (d.h. für einen Teil des in der Routenzulassung enthaltenen IP-Adressblocks) abgeglichen, es sei denn, sie sind spezifischer als die in der Routenzulassung (über das Attribut `maxLength`) angegebene Grenze. - Ungültig": Die Routenankündigung der betreffenden IP-Adresse ist durch eine Routengenehmigung abgedeckt, aber sie stimmt *nicht* überein. Es gibt zwei mögliche Ursachen: 1. Der IP-Adressblock (Route Prefix) wird von einem Providernetzwerk (Route Origin ASN) angekündigt, das in der Routengenehmigung *nicht* zugelassen ist (Ergebnis in der Tabelle unten: "ungültig (as)"); 2. der angekündigte IP-Adressblock (Route Prefix) ist *kleiner als in der Routenzulassung erlaubt*, d.h. er überschreitet den Wert `maxLength` (Ergebnis in der Tabelle unten: "ungültig (Länge)"). Hinweis: Der Status `Ungültig` weist auf einen unbeabsichtigten oder böswilligen Fehler in der Routenkonfiguration hin, der von deinem Hoster oder seinem Netzwerkanbieter (interner Fehler) oder von einem Dritten (externer Fehler) verursacht werden kann. In beiden Fällen kann er zur Nichterreichbarkeit deines Servers oder zum Abfangen des Internetverkehrs zu deinem Server führen. Kontaktiere deinen Hoster so schnell wie möglich. Im Falle eines internen Fehlers sollte dein Hoster seinen Netzwerkanbieter, dem die IP-Adressen deines Servers gehören, bitten, den Fehler in der Routenkonfiguration zu beheben. - `NotFound`: Es wurde keine Anweisung mit Route-Autorisierung gefunden, die die Routenankündigung der betreffenden IP-Adresse abdeckt. Dadurch wird das Routing des Internetverkehrs zu deinem Server unsicherer. Bitte kontaktiere deinen Hoster diesbezüglich. Er kann seinen Netzwerkprovider, dem die IP-Adressen deines Servers gehören, bitten, Routenautorisierungen zu veröffentlichen. *Anforderungsstufe: Empfohlen*

source: detail web-mail rpki ns-valid label
de: Gültigkeit der Routenankündigung

source: detail web-mail rpki ns-valid tech table
de: Nameserver|BGP-Routen-Präfix|BGP-Routen-Ursprung ASN|RPKI-Ursprung Validierungsstatus

source: detail web-mail rpki ns-valid verdict bad
de: Mindestens eine IP-Adresse deiner Nameserver hat den Validierungsstatus `NotFound`. Es gibt *keine* RPKI Route Origin Authorisation (ROA) für ihre Routenankündigung.

source: detail web-mail rpki ns-valid verdict good
de: Alle IP-Adressen deiner Nameserver haben den Validierungsstatus `Valid`. Die Routenankündigung dieser IP-Adressen wird mit der veröffentlichten RPKI Route Origin Authorisation (ROA) abgeglichen.

source: detail web-mail rpki ns-valid verdict invalid
de: Mindestens eine IP-Adresse deiner Nameserver hat einen "ungültigen" Validierungsstatus. Die Routenankündigung der betroffenen IP-Adressen stimmt *nicht* mit der veröffentlichten RPKI Route Origin Authorisation (ROA) überein. Dies deutet auf einen unbeabsichtigten oder böswilligen Fehler in der Routenkonfiguration hin, der von deinem Nameserver-Hoster (interner Fehler) oder von einer dritten Partei (externer Fehler) verursacht werden kann. In beiden Fällen kann er zur Nichterreichbarkeit deines Servers oder zum Abfangen des Internetverkehrs zu deinem Server führen. Wende dich so schnell wie möglich an deinen Nameserver-Hoster. Im Falle eines internen Fehlers sollte dein Nameserver-Hoster seinen Netzwerkanbieter, dem die IP-Adressen deines Servers gehören, bitten, den Fehler in der Routenkonfiguration zu beheben.

source: detail web-mail rpki ns-valid verdict not-routed
de: Dieser Subtest ist *nicht* gelaufen, weil *keine* Routenankündigung für eine der IP-Adressen verfügbar war.
