Repository: dreistromland/internet-standards.com
Catalog: translations/*/main.po
Languages: de

source: detail mail tls dane-rollover exp
de: Wir prüfen, ob es ein aktives Schema mit mindestens zwei DANE TLSA-Einträgen gibt, um Zertifikatsumstellungen auf deinen empfangenden Mailservern (MX) zuverlässig abzuwickeln. Ein solches Schema wird sich als nützlich erweisen, wenn deine Mailserver-Zertifikate aktualisiert werden müssen. Es kann verhindern, dass DANE während des Übergangszeitraums ungültig wird, was die Zustellbarkeit von E-Mails in deiner Domain gefährden könnte. Ein Rollover-Schema kann, muss aber nicht die ganze Zeit "aktiv" sein. Wir empfehlen dir, eines der beiden folgenden Schemata mit doppelten DANE TLSA-Einträgen anzuwenden: 1. Aktuell + Weiter ("3 1 1" + "3 1 1"): Veröffentliche zwei "DANE-EE(3) SPKI(1) SHA2-256(1)" Datensätze, einen für das aktuelle und einen für das nächste TLS-Zertifikat deines Mailservers. 2. Aktuelle + Issuer CA ("3 1 1" + "2 1 1"): Veröffentliche einen "DANE-EE(3) SPKI(1) SHA2-256(1)"-Eintrag für das aktuelle TLS-Zertifikat deines Mailservers und außerdem einen "DANE-TA(2) SPKI(1) SHA2-256(1)"-Eintrag für das aktuelle Stamm- oder Zwischenzertifikat der (nicht unbedingt öffentlichen) Zertifizierungsstelle. Der Test akzeptiert auch andere Kombinationen von DANE TLSA-Datensätzen, z. B. "3 x x" + "3 x x" oder "3 x x" + "2 x x". Andere als die oben genannten Typen sind jedoch in der Regel fehleranfälliger und weniger interoperabel. *Anforderungsstufe: Optional*

source: detail mail tls dane-rollover label
de: DANE-Rollover-Regelung

source: detail mail tls dane-rollover tech table
de: Mailserver (MX)|DANE Rollover-Schema

source: detail mail tls dane-rollover verdict bad
de: Mindestens eine deiner Mailserver-Domänen verfügt *nicht* über ein aktives DANE-Schema für ein zuverlässiges Rollover der Zertifikatsschlüssel.

source: detail mail tls dane-rollover verdict good
de: Alle deine Mailserver-Domänen verfügen über ein aktives DANE-Schema für ein zuverlässiges Rollover der Zertifikatsschlüssel.

source: detail mail tls dane-valid exp
de: Wir prüfen, ob die DANE-Fingerprints, die von deinen Mailserver-Domänen vorgelegt werden, für deine Mailserver-Zertifikate gültig sind. DANE ermöglicht es dir, Informationen über deine Mailserver-Zertifikate in einem speziellen DNS-Eintrag, dem sogenannten TLSA-Eintrag, zu veröffentlichen. Versendende Mailserver können die Echtheit deiner Zertifikate nicht nur über die Zertifizierungsstelle, sondern auch über die TLSA-Einträge überprüfen. Ein sendender Mailserver kann den TLSA-Eintrag auch als Signal nutzen, um nur über STARTTLS (und nicht unverschlüsselt) zu verbinden. Wenn der DANE-Fingerabdruck eines empfangenden Mailservers vom sendenden Mailserver überprüft wird, kann ein aktiver Angreifer, der in der Lage ist, den Mailverkehr zu manipulieren, die STARTTLS-Verschlüsselung nicht aushebeln.

source: detail mail tls dane-valid label
de: DANE Gültigkeit

source: detail mail tls dane-valid tech table
de: Mailserver (MX)|DANE TLSA-Eintrag gültig

source: detail mail tls dane-valid verdict bad
de: Mindestens einer deiner Mailserver hat *keine* gültigen DANE-Fingerprints. Entweder hat jemand die Antwort deines Mailservers manipuliert, oder dein Mailserver hat einen schweren DANE-Konfigurationsfehler. In letzterem Fall ist deine Domäne für jeden Mailserver, der DANE-Fingerabdrücke prüft, unerreichbar. Du solltest so schnell wie möglich deinen Mail-Provider kontaktieren.

source: detail mail tls dane-valid verdict good
de: Jeder deiner Mailserver hat mindestens einen gültigen DANE-Fingerabdruck. Dadurch können sendende Mailserver, die die DANE-Verifizierung unterstützen, eine authentifizierte, verschlüsselte Transportverbindung mit deinen empfangenden Mailservern aufbauen.

source: detail mail tls fs-params exp
de: Wir prüfen, ob die öffentlichen Parameter, die beim Diffie-Hellman-Schlüsselaustausch von deinen empfangenden Mailservern (MX) verwendet werden, sicher sind. **ECDHE**: Die Sicherheit des ephemeren Diffie-Hellman-Schlüsselaustauschs mit elliptischen Kurven (ECDHE) hängt von der verwendeten elliptischen Kurve ab. Wir prüfen, ob die Bitlänge der verwendeten elliptischen Kurven mindestens 224 Bit beträgt. Derzeit können wir den Namen der elliptischen Kurve nicht überprüfen. **DHE**: Die Sicherheit des Diffie-Hellman Ephemeral (DHE)-Schlüsselaustauschs hängt von der Länge der öffentlichen und geheimen Schlüssel ab, die innerhalb der gewählten endlichen Feldgruppe verwendet werden. Wir prüfen, ob dein öffentliches DHE-Schlüsselmaterial eine der vordefinierten finiten Feldgruppen verwendet, die in [RFC 7919](https://www.rfc-editor.org/rfc/rfc7919) angegeben sind. Selbst erzeugte Gruppen sind "unzureichend". Die größeren Schlüsselgrößen, die für die Verwendung von DHE erforderlich sind, gehen zu Lasten der Leistung. Prüfe sorgfältig und verwende ECDHE anstelle von DHE, wenn du kannst. **RSA als Alternative**: Neben ECDHE und DHE kann auch RSA für den Schlüsselaustausch verwendet werden. Es besteht jedoch die Gefahr, dass es nicht mehr ausreichend sicher ist (aktueller Status "phase out"). Die öffentlichen RSA-Parameter werden in der Unterprüfung "Öffentlicher Schlüssel des Zertifikats" geprüft. Beachte, dass RSA für die Zertifikatsprüfung als "gut" gilt. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B5-1 und Tabelle 9 für ECDHE, und Richtlinie B6-1 und Tabelle 10 für DHE (in Englisch). --- **Elliptische Kurve für ECDHE** * Gut: `secp384r1`, `secp256r1`, `x448`, und `x25519` * Auslaufen: `secp224r1` * Unzureichend: Andere Kurven **Finite Feldgruppe für DHE** * Ausreichend: * [ffdhe4096](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe4096.pem) (RFC 7919) sha256 checksum: `64852d6890ff9e62eecd1ee89c72af9af244dfef5b853bcedea3dfd7aade22b3` * [ffdhe3072](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe3072.pem) (RFC 7919) sha256 checksum: `c410cc9c4fd85d2c109f7ebe5930ca5304a52927c0ebcb1a11c5cf6b2386bbab` * Beachte, dass wir auch auf ffdhe8192 und ffdhe6144 testen. Der begrenzte Gewinn an Sicherheit überwiegt jedoch selten den Leistungsverlust. * Phase out: * [ffdhe2048](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe2048.pem) (RFC 7919) sha256 checksum: `9ba6429597aeed2d8617a7705b56e96d044f64b07971659382e426675105654b` * Unzureichend: Andere Gruppen --- Hinweis: Die oben genannten Namen basieren auf den [IANA-Namenskonventionen] (https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml). Manchmal werden alternative Namen für dieselben Kurven verwendet, wie z.B. `prime256v1` (ANSI) und `NIST P-256` für `secp256r1`.

source: detail mail tls fs-params label
de: Parameter für den Schlüsselaustausch

source: detail mail tls fs-params tech table
de: Mail-Server (MX)|Betroffene Parameter|Sicherheitsstufe

source: detail mail tls fs-params verdict bad
de: Mindestens einer deiner Mailserver unterstützt *unzureichend* sichere Parameter für den Diffie-Hellman-Schlüsselaustausch.

source: detail mail tls fs-params verdict good
de: Alle deine Mailserver unterstützen sichere Parameter für den Diffie-Hellman-Schlüsselaustausch.

source: detail mail tls fs-params verdict na
de: Dieser Untertest ist nicht anwendbar, da deine Mailserver den Diffie-Hellman-Schlüsselaustausch nicht unterstützen. Beachte, dass RSA eine Alternative für den Schlüsselaustausch ist, aber den Status *phase out* hat.

source: detail mail tls fs-params verdict phase-out
de: Mindestens einer deiner Mailserver unterstützt Parameter für den Diffie-Hellman-Schlüsselaustausch, die einen *Phase-out*-Status haben, weil sie als anfällig gelten und Gefahr laufen, *unzureichend* sicher zu werden.

source: detail mail tls kex-hash-func exp
de: Wir prüfen, ob deine empfangenden Mailserver (MX) sichere Hash-Funktionen unterstützen, um die digitale Signatur beim Schlüsselaustausch zu erstellen. Ein empfangender Mailserver verwendet eine digitale Signatur während des Schlüsselaustauschs, um den Besitz des geheimen Schlüssels zu beweisen, der dem Zertifikat entspricht. Der Mailserver erstellt diese digitale Signatur, indem er die Ausgabe einer Hash-Funktion signiert. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Tabelle 5. *Anforderungsstufe: Empfohlen* --- **SHA2-Unterstützung für Signaturen** * Gut: Ja (SHA-256, SHA-384 oder SHA-512 unterstützt) * Auslaufend: Nein (SHA-256, SHA-384 oder SHA-512 werden *nicht* unterstützt)

source: detail mail tls kex-hash-func label
de: Hash-Funktion für den Schlüsselaustausch

source: detail mail tls kex-hash-func tech table
de: Mail Server (MX)|SHA2 Unterstützung für Signaturen

source: detail mail tls kex-hash-func verdict good
de: Alle deine Mailserver unterstützen sichere Hash-Funktionen für den Schlüsselaustausch.

source: detail mail tls kex-hash-func verdict other
de: Wir waren nicht in der Lage, die von mindestens einem deiner Mailserver verwendete Hash-Funktion zu ermitteln. Das könnte daran liegen, dass die verwendete Verschlüsselungskombination keine Signatur für die Zertifikatsüberprüfung hat (z.B. RSA-Schlüsselaustausch oder anonym, d.h. `anon`).

source: detail mail tls kex-hash-func verdict phase-out
de: Mindestens einer deiner Mailserver unterstützt *keine* sichere Hash-Funktion für den Schlüsselaustausch. Du solltest diese Einstellung absichtlich *auslaufen* lassen, denn es besteht die Gefahr, dass sie in Zukunft *unzureichend* sicher wird.

source: detail mail tls ocsp-stapling exp
de: VERALTETER TEXT; TEST NICHT VERWENDET Wir prüfen, ob der empfangende Mailserver die [TLS Certificate Status extension](https://www.rfc-editor.org/rfc/rfc6961) unterstützt auch bekannt als OCSP Stapling. Mit OCSP Stapling kann dein Mailserver OCSP Antworten liefern, so dass der TLS-Client die Gültigkeit des Mailserver-Zertifikats nicht mehr Gültigkeit des Mailserver-Zertifikats direkt beim Zertifikatsanbieter Zertifikatsanbieter zu überprüfen, und vermeidet so die Preisgabe potenziell datenschutzrelevanter Daten über den Daten über den Kunden an den Zertifikatsanbieter weiterzugeben. Außerdem erfordert es keine Verbindung zwischen Client und Zertifikatsanbieter und ist schneller. Siehe ['IT Security Guidelines for Transport Layer Security (TLS)'](https://www.ncsc.nl/english/current-topics/factsheets/it-security-guidelines-for-transport-layer-security-tls.html), Richtlinie B9-1 (auf Englisch). Wenn wir uns mit deinem Mailserver verbinden, verwenden wir die TLS-Zertifikatsstatus Erweiterung, um die Aufnahme von OCSP-Daten in die Serverantwort anzufordern. Wenn dein Mailserver OCSP-Daten in die Antwort aufnimmt, überprüfen wir, ob die OCSP Daten von einer bekannten Zertifizierungsstelle signiert sind.

source: detail mail tls ocsp-stapling label
de: VERALTETER TEXT; TEST NICHT VERWENDET OCSP-Heftung

source: detail mail tls ocsp-stapling tech table
de: VERALTETER TEXT; TEST NICHT VERWENDET Mail-Server (MX)|OCSP-Heftung

source: detail mail tls ocsp-stapling verdict bad
de: VERALTETER TEXT; TEST NICHT VERWENDET Mindestens einer deiner Mailserver unterstützt OCSP Stapling, antwortet aber mit ungültigen Daten

source: detail mail tls ocsp-stapling verdict good
de: VERALTETER TEXT; TEST NICHT VERWENDET Deine Mailserver unterstützen OCSP Stapling.

source: detail mail tls ocsp-stapling verdict ok
de: VERALTETER TEXT; TEST NICHT VERWENDET Mindestens einer deiner Mailserver unterstützt kein OCSP Stapling.

source: detail mail tls renegotiation-client exp
de: Wir prüfen, ob ein sendender Mailserver eine Neuverhandlung mit deinen empfangenden Mailservern (MX) einleiten kann. Es ist in der Regel nicht notwendig, dass der sendende Mailserver eine Neuverhandlung initiiert, da er einen empfangenden Mailserver für DoS-Angriffe innerhalb einer TLS-Verbindung öffnet. Ein Angreifer kann ähnliche DoS-Angriffe ohne clientinitiierte Neuverhandlung durchführen, indem er viele parallele TLS-Verbindungen öffnet, aber diese sind leichter zu erkennen und mit Standardmaßnahmen abzuwehren. Beachte, dass die vom Kunden initiierte Neuverhandlung die Verfügbarkeit und nicht die Vertraulichkeit beeinträchtigt. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B8-1 und Tabelle 13 (auf Englisch). *Anforderungsstufe: Optional* --- **Kundeninitiierte Neuverhandlung** * Gut: Aus (oder N/A für TLS 1.3) * Ausreichend: Ein

source: detail mail tls renegotiation-client label
de: Neuverhandlung auf Initiative des Kunden

source: detail mail tls renegotiation-client tech table
de: Mail-Server (MX)|Client-initiierte Neuverhandlung

source: detail mail tls renegotiation-client verdict bad
de: Mindestens einer deiner Mailserver lässt eine vom Kunden initiierte Neuverhandlung zu, was sich negativ auf die Verfügbarkeit deines Mailservers auswirken könnte.

source: detail mail tls renegotiation-client verdict good
de: Alle deine Mailserver lassen keine vom Kunden initiierte Neuverhandlung zu.

source: detail mail tls renegotiation-secure exp
de: Wir prüfen, ob deine Mailserver (MX) eine sichere Neuverhandlung unterstützen. Ältere Versionen von TLS (vor TLS 1.3) erlauben es, einen neuen Handshake zu erzwingen. Diese so genannte Neuverhandlung war in ihrem ursprünglichen Design unsicher. Der Standard wurde repariert und ein sicherer Neuverhandlungsmechanismus wurde hinzugefügt. Die alte Version wird seitdem als unsichere Neuaushandlung bezeichnet und sollte deaktiviert werden. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B8-1 und Tabelle 12 (auf Englisch). --- **unsichere Neuaushandlung** * Gut: Aus (oder N/A für TLS 1.3) * Unzureichend: Ein

source: detail mail tls renegotiation-secure label
de: Sichere Neuverhandlung

source: detail mail tls renegotiation-secure tech table
de: Mail-Server (MX)|Sichere Neuverhandlung

source: detail mail tls renegotiation-secure verdict bad
de: Mindestens einer deiner Mailserver unterstützt unsichere Renegotiation, die offensichtlich *nicht* sicher ist. sicher.

source: detail mail tls renegotiation-secure verdict good
de: Alle deine Mailserver unterstützen eine sichere Neuverhandlung.

source: detail mail tls starttls-exists exp
de: Wir prüfen, ob deine empfangenden Mailserver (MX) STARTTLS unterstützen. Wenn ja, prüfen wir in den Untertests dieser Testkategorie auch, ob STARTTLS ausreichend sicher konfiguriert ist. Aus Leistungsgründen werden höchstens zehn Mailserver entweder über IPv6 oder IPv4 auf STARTTLS und DANE getestet. Beachte, dass der E-Mail-Test nicht auf A/AAAA-Einträge für Mailserver zurückgreift, wenn kein MX-Eintrag vorhanden ist. *Nicht-Empfangsdomain*: 1. Null MX: Wenn du auf deiner Domain, die A/AAAA-Einträge hat, keine E-Mails empfangen möchtest, empfehlen wir dir, "Null MX" ([RFC 7505](https://www.rfc-editor.org/rfc/rfc7505)) zu verwenden. Beachte, dass ein "Null MX-Eintrag" nicht mit einem normalen MX-Eintrag kombiniert werden sollte, der auf einen Mail-Host verweist. 2. Kein MX: Falls deine Domain keine A/AAAA-Einträge hat und du keine Mails auf ihr empfangen möchtest, empfehlen wir dir, überhaupt keinen MX-Eintrag zu konfigurieren (d. h. auch *keinen* "Null MX"-Eintrag). * Wenn wir einen der beiden oben genannten Fälle feststellen, sind die Untertests in der Kategorie STARTTLS und DANE nicht anwendbar. Das gilt auch für die mailserverspezifischen Untertests in den Kategorien für IPv6 und DNSSEC. Andere Untertests des E-Mail-Tests (z. B. für DMARC) sind weiterhin anwendbar. * Beachte, dass ein "Null MX"-Eintrag oder ein fehlender MX-Eintrag auch Auswirkungen auf den Versand von E-Mails haben kann, da empfangende Server E-Mails mit einer ungültigen Absenderadresse zurückweisen können. Eine "gute Praxis für Domänen ohne E-Mail" findest du in der [Erklärung zum Untertest "DMARC-Richtlinie"](#control-panel-9).

source: detail mail tls starttls-exists label
de: STARTTLS verfügbar

source: detail mail tls starttls-exists tech table
de: Mailserver (MX)|STARTTLS

source: detail mail tls starttls-exists verdict bad
de: Mindestens einer deiner Mailserver bietet *kein* STARTTLS an.

source: detail mail tls starttls-exists verdict good
de: Alle deine Mailserver bieten STARTTLS an.

source: detail mail tls starttls-exists verdict invalid-null-mx
de: Deine Domain zeigt einen "Null MX"-Eintrag an, der angibt, dass sie keine E-Mails akzeptiert. Aber entweder hat deine Domain keine A/AAAA-Einträge, so dass der "Null MX"-Eintrag unnötig ist. Oder auf deiner Domain ist ein empfangender Mailserver durch einen anderen MX-Eintrag festgelegt, wodurch der "Null MX"-Eintrag in Konflikt gerät.

source: detail mail tls starttls-exists verdict no-null-mx
de: Auf deiner Domain, die A/AAAA-Einträge hat, sind keine empfangenden Mailserver (MX) eingestellt. Wir empfehlen dir, explizit anzugeben, dass deine Domain keine E-Mails annimmt, indem du einen "Null MX"-Eintrag konfigurierst. Verwende keinen "Null MX"-Eintrag und richte einen MX ein, wenn du von diesem Domainnamen aus E-Mails versenden möchtest, da empfangende Server E-Mails mit einer ungültigen Absenderadresse zurückweisen können.

source: detail mail tls starttls-exists verdict null-mx
de: Dein Domainname, der A/AAAA-Einträge hat, zeigt mit einem "Null MX"-Eintrag deutlich an, dass er keine E-Mails akzeptiert. Das ist in Ordnung, wenn du keine E-Mails empfangen willst. Verwende keinen "Null MX"-Eintrag und richte einen MX ein, wenn du von diesem Domänennamen aus E-Mails versenden möchtest, da empfangende Server E-Mails mit einer ungültigen Absenderadresse zurückweisen können.

source: detail mail tls starttls-exists verdict null-mx-with-other-mx
de: Deine Domain gibt einen "Null MX"-Eintrag an, der angibt, dass sie keine E-Mails akzeptiert. Auf deiner Domain ist jedoch ein empfangender Mailserver durch einen anderen MX-Eintrag festgelegt, wodurch der "Null MX"-Eintrag in Konflikt gerät.

source: detail mail tls starttls-exists verdict null-mx-without-a-aaaa
de: Deine Domain wirbt mit einem "Null MX"-Eintrag, der anzeigt, dass sie keine E-Mails akzeptiert. Deine Domain hat jedoch keine A/AAAA-Einträge, so dass der "Null MX"-Eintrag unnötig ist.

source: detail mail tls starttls-exists verdict other
de: Mindestens einer deiner Mailserver ist unerreichbar.

source: detail mail tls starttls-exists verdict other-2
de: Auf deiner Domain sind keine empfangenden Mailserver (MX) eingestellt, die keine A/AAAA-Einträge haben. Das ist in Ordnung, wenn du keine E-Mails empfangen möchtest.

source: detail mail tls version exp
de: Wir prüfen, ob deine Mailserver (MX) nur sichere TLS-Versionen unterstützen. Ein Mailserver kann mehr als eine TLS-Version unterstützen. Beachte, dass manche Mailserver nur ältere TLS-Versionen unterstützen. Wenn sowohl der sendende als auch der empfangende Mailserver nicht dieselbe TLS-Version unterstützen, greifen sie normalerweise auf den unverschlüsselten Mailtransport zurück. Deshalb kann es ratsam sein, TLS-Versionen mit dem Status "Auslaufmodell" noch eine Weile zu unterstützen. Entscheide anhand der Logdaten, wann du diese "auslaufenden" TLS-Versionen deaktivieren solltest. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B1-1 und Tabelle 1 (auf Englisch). --- **Version** * Gut: TLS 1.3 * Ausreichend: TLS 1.2 * Auslaufend: TLS 1.1 und 1.0 * Unzureichend: SSL 3.0, 2.0 und 1.0

source: detail mail tls version label
de: TLS-Version

source: detail mail tls version tech table
de: Mail-Server (MX)|TLS-Versionen|Status

source: detail mail tls version verdict bad
de: Mindestens einer deiner Mailserver unterstützt eine oder mehrere *unzureichend* sichere TLS-Versionen.

source: detail mail tls version verdict good
de: Alle deine Mailserver unterstützen nur sichere TLS-Versionen.

source: detail mail tls version verdict phase-out
de: Mindestens einer deiner Mailserver unterstützt eine oder mehrere TLS-Versionen, die absichtlich *aus dem Verkehr gezogen* werden sollten, weil sie bekanntermaßen anfällig sind und Gefahr laufen, *unzureichend* sicher zu werden.

source: detail mail tls zero-rtt exp
de: Wir prüfen, ob deine Mailserver (MX) Zero Round Trip Time Resumption (0-RTT) unterstützen. 0-RTT ist eine Option in TLS 1.3, die Anwendungsdaten während der ersten Handshake-Nachricht transportiert. 0-RTT bietet keinen Schutz gegen Replay-Angriffe auf der TLS-Schicht und sollte daher deaktiviert werden. Obwohl das Risiko gemindert werden kann, indem 0-RTT nicht für nicht-idempotente Anfragen zulässt, ist eine solche Konfiguration oft nicht trivial, von der Anwendungslogik abhängig und daher fehleranfällig. Wenn deine Mailserver TLS 1.3 nicht unterstützen, ist der Test nicht anwendbar. Bei Mailservern, die TLS 1.3 unterstützen, wird der Befehl STARTTLS erteilt und eine TLS Sitzung wird eingeleitet. Der Betrag von [frühe Daten](https://www.openssl.org/docs/manmaster/man3/SSL_get_max_early_data.html) Unterstützung [angegeben](https://www.rfc-editor.org/rfc/rfc8446#section-4.2.10) durch den Mailserver wird überprüft. Ist sie größer als Null, wird eine zweite Verbindung aufgebaut, die die TLS-Sitzungsdaten der ersten Verbindung, sendet aber den EHLO-Befehl _vor_ dem TLS-Handshake, aber _nach_ dem STARTTLS-Befehl (d.h. es werden keine Roundtrips (0-RTT) benötigt, bevor die Anwendungsdaten zum Server gelangen). Wenn der TLS-Handshake abgeschlossen ist und der Mailserver antwortet, dann wird davon ausgegangen, dass der Mailserver 0-RTT unterstützt. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B9-1 und Tabelle 14 (in Englisch). --- **0-RTT** * Gut: Aus (oder N/A vor TLS 1.3) * Unzureichend: Ein

source: detail mail tls zero-rtt label
de: 0-RTT

source: detail mail tls zero-rtt tech table
de: Mail-Server (MX)|0-RTT

source: detail mail tls zero-rtt verdict bad
de: Mindestens einer deiner Mailserver unterstützt 0-RTT, was *nicht* sicher ist.

source: detail mail tls zero-rtt verdict good
de: Keiner deiner Mailserver unterstützt 0-RTT.

source: detail mail tls zero-rtt verdict na
de: Dieser Untertest ist nicht anwendbar, da deine Mailserver TLS 1.3 nicht unterstützen.

source: detail tech data bogus
de: Gott

source: detail tech data good
de: gut

source: detail tech data http-csp has-bare-https
de: Empfehlung: Das Schema "https:" ohne eine bestimmte Hauptdomain sollte nicht verwendet werden (#9).

source: detail tech data http-csp has-data
de: Empfehlung: Das Schema "data:" sollte nicht verwendet werden, wenn dies nicht erlaubt ist (#7).

source: detail tech data http-csp has-host-without-scheme
de: Empfehlung: Eine Domain ohne Schema sollte nicht verwendet werden (#8).

source: detail tech data http-csp has-http
de: Empfehlung: Das Schema "http:" sollte nicht verwendet werden (#8).

source: detail tech data http-csp has-invalid-host
de: Empfehlung: Ein Platzhalter (d.h. '*') oder '127.0.0.1' sollte nicht verwendet werden (#9 und #10).

source: detail tech data http-csp has-unsafe-eval
de: Empfehlung: "unsafe-eval" sollte nicht verwendet werden (#6).

source: detail tech data http-csp has-unsafe-hashes
de: Empfehlung: "unsafe-hashes" sollten nicht verwendet werden (#6).
