Repository: dreistromland/internet-standards.com
Catalog: translations/*/main.po
Languages: de

source: test mailtls untestable description
de: Testfehler: Mindestens einer deiner empfangenden Mailserver war für uns nicht testbar, so dass wir nicht (vollständig) auf STARTTLS und DANE testen konnten. Dies könnte u.a. durch SMTP-Fehler und Ratenbegrenzungsmaßnahmen verursacht werden, die Verbindungen einschalten und abbrechen.

source: test mailtls untestable summary
de: Nicht testbarer Mailserver (STARTTLS und DANE)

source: test mailtls warning description
de: Schade! Versendende Mailserver, die sicheren E-Mail-Transport ([STARTTLS und DANE](/faqs/starttls/)) unterstützen, können *keine* oder eine *unzureichend* sichere Verbindung mit deinen empfangenden Mailservern herstellen. Passive und/oder aktive Angreifer können daher E-Mails auf dem Weg zu dir lesen. Du solltest deinen Mailanbieter bitten, STARTTLS und DANE zu aktivieren und sicher zu konfigurieren.

source: test mailtls warning summary
de: Mailserver-Verbindung *nicht* oder unzureichend gesichert (STARTTLS und DANE)

source: test siteappsecpriv failed description
de: Schade! *Nicht* alle erforderlichen Sicherheitsoptionen, d.h. Sicherheitsheader und security.txt, sind für deine Website eingestellt ([Sicherheitsoptionen](/faqs/appsecpriv/)). Mit den Sicherheits-Headern kannst du Browser-Mechanismen aktivieren, um Besucher/innen vor Angriffen zu schützen, z. B. vor Cross-Site-Scripting (XSS) oder Framing. Über eine security.txt-Datei kannst du Forschern, die eine Schwachstelle auf deinen Systemen gefunden haben, deine Kontaktinformationen und deine Richtlinie zur koordinierten Offenlegung von Schwachstellen zur Verfügung stellen. Beachte, dass HTTPS eine Voraussetzung für alle getesteten Sicherheitsoptionen ist. Sicherheits-Header (außer Referrer-Policy) sind *nicht* relevant für Domains, die umleiten (durch einen 301/302 HTTP Status Code).

source: test siteappsecpriv failed summary
de: Eine oder mehrere erforderliche Sicherheitsoptionen *nicht* gesetzt (Sicherheitsoptionen)

source: test siteappsecpriv info description
de: Informativ: *Nicht* alle optionalen Sicherheitsoptionen, d.h. Sicherheitsheader und security.txt, sind für deine Website eingestellt ([Sicherheitsoptionen](/faqs/appsecpriv/)). Mit den Sicherheits-Headern kannst du Browser-Mechanismen aktivieren, um Besucher/innen vor Angriffen zu schützen, z. B. vor Cross-Site-Scripting (XSS) oder Framing. Über eine security.txt-Datei kannst du Forschern, die eine Schwachstelle auf deinen Systemen gefunden haben, deine Kontaktinformationen und deine Richtlinie zur koordinierten Offenlegung von Schwachstellen zur Verfügung stellen. Beachte, dass HTTPS eine Voraussetzung für alle getesteten Sicherheitsoptionen ist. Sicherheits-Header (mit Ausnahme der Referrer-Policy) sind für Domains, die umleiten (durch einen 301/302 HTTP Status Code), nicht relevant.

source: test siteappsecpriv info summary
de: Eine oder mehrere optionale Sicherheitsoptionen *nicht* gesetzt (Sicherheitsoptionen)

source: test siteappsecpriv label
de: Sicherheitsoptionen

source: test siteappsecpriv passed description
de: Gut gemacht! Alle Sicherheitsoptionen, d.h. Sicherheitsheader und security.txt, sind für deine Website eingestellt ([Sicherheitsoptionen](/faqs/appsecpriv/)). Mit den Sicherheits-Headern kannst du Browser-Mechanismen aktivieren, um Besucher vor Angriffen zu schützen, die z. B. Cross-Site-Scripting (XSS) oder Framing beinhalten. Über eine security.txt-Datei kannst du Forschern, die eine Schwachstelle auf deinen Systemen gefunden haben, deine Kontaktinformationen und deine Richtlinie zur koordinierten Offenlegung von Schwachstellen zur Verfügung stellen. Beachte, dass HTTPS eine Voraussetzung für alle getesteten Sicherheitsoptionen ist. Sicherheits-Header (außer Referrer-Policy) sind *nicht* relevant für Domains, die umleiten (durch einen 301/302 HTTP Status Code).

source: test siteappsecpriv passed summary
de: Alle Sicherheitsoptionen eingestellt (Sicherheitsoptionen)

source: test siteappsecpriv title
de: Sicherheitsoptionen eingestellt?

source: test siteappsecpriv warning description
de: Warnung: *Nicht* alle empfohlenen Sicherheitsoptionen, d.h. Sicherheitsheader und security.txt, sind für deine Website eingestellt ([Sicherheitsoptionen](/faqs/appsecpriv/)). Mit den Sicherheits-Headern kannst du Browser-Mechanismen aktivieren, um Besucher/innen vor Angriffen zu schützen, z. B. vor Cross-Site-Scripting (XSS) oder Framing. Über eine security.txt-Datei kannst du Forschern, die eine Schwachstelle auf deinen Systemen gefunden haben, deine Kontaktinformationen und deine Richtlinie zur koordinierten Offenlegung von Schwachstellen zur Verfügung stellen. Beachte, dass HTTPS eine Voraussetzung für alle getesteten Sicherheitsoptionen ist. Sicherheits-Header (außer Referrer-Policy) sind *nicht* relevant für Domains, die umleiten (durch einen 301/302 HTTP Status Code).

source: test siteappsecpriv warning summary
de: Eine oder mehrere empfohlene Sicherheitsoptionen *nicht* gesetzt (Sicherheitsoptionen)

source: test sitednssec failed description
de: Schade! Deine Domain ist *nicht* mit einer gültigen Signatur ([DNSSEC](/faqs/dnssec/)) signiert. Deshalb ist sind Besucher mit aktivierter Domain-Signaturprüfung *nicht* geschützt vor der manipulierten Übersetzung von deiner Domain in betrügerische Internet Adressen. Du solltest deinen Nameserver-Betreiber (oft dein Registrar und/oder Hosting-Anbieter), DNSSEC zu aktivieren.

source: test sitednssec failed summary
de: Domainname *nicht* signiert (DNSSEC)

source: test sitednssec info description
de: Schade! Deine Domain ist *nicht* mit einer gültigen Signatur ([DNSSEC](/faqs/dnssec/)) signiert. Deshalb ist sind Besucher mit aktivierter Domain-Signaturprüfung *nicht* geschützt vor der manipulierten Übersetzung von deiner Domain in betrügerische Internet Adressen. Du solltest deinen Nameserver-Betreiber (oft dein Registrar und/oder Hosting-Anbieter), DNSSEC zu aktivieren.

source: test sitednssec info summary
de: Domainname *nicht* signiert (DNSSEC)

source: test sitednssec label
de: Signierter Domänenname (DNSSEC)

source: test sitednssec passed description
de: Gut gemacht! Deine Domain ist mit einer gültigen Signatur ([DNSSEC](/faqs/dnssec/)) versehen. Deshalb sind Besucher mit aktivierter Domain-Signatur-Validierung vor manipulierten Internetadressen geschützt. Übersetzung von deiner Domain in betrügerische Internetadressen geschützt.

source: test sitednssec passed summary
de: Signierte Domänennamen (DNSSEC)

source: test sitednssec title
de: Domain-Name unterzeichnet?

source: test sitednssec warning description
de: Schade! Deine Domain ist *nicht* mit einer gültigen Signatur ([DNSSEC](/faqs/dnssec/)) signiert. Deshalb ist sind Besucher mit aktivierter Domain-Signaturprüfung *nicht* geschützt vor der manipulierten Übersetzung von deiner Domain in betrügerische Internet Adressen. Du solltest deinen Nameserver-Betreiber (oft dein Registrar und/oder Hosting-Anbieter), DNSSEC zu aktivieren.

source: test sitednssec warning summary
de: Domainname *nicht* signiert (DNSSEC)

source: test siteipv6 failed description
de: Schade! Deine Website ist *nicht* für Besucher erreichbar, die eine moderne Internetadresse ([IPv6](/faqs/ipv6/)), oder eine Verbesserung ist möglich. Deshalb ist deine Website nicht noch nicht Teil des modernen Internets. Du solltest deinen Hosting-Anbieter auffordern IPv6 vollständig zu aktivieren.

source: test siteipv6 failed summary
de: *Nicht* über eine moderne Internetadresse erreichbar, oder Verbesserung möglich (IPv6)

source: test siteipv6 info description
de: Schade! Deine Website ist *nicht* für Besucher erreichbar, die eine moderne Internetadresse ([IPv6](/faqs/ipv6/)), oder eine Verbesserung ist möglich. Deshalb ist deine Website nicht noch nicht Teil des modernen Internets. Du solltest deinen Hosting-Anbieter auffordern IPv6 vollständig zu aktivieren.

source: test siteipv6 info summary
de: *Nicht* über eine moderne Internetadresse erreichbar, oder Verbesserung möglich (IPv6)

source: test siteipv6 label
de: Moderne Adresse (IPv6)

source: test siteipv6 passed description
de: Gut gemacht! Deine Website ist für Besucher mit einer modernen Internet Adresse ([IPv6](/faqs/ipv6/)) und ist damit voll und ganz Teil des modernen Internets.

source: test siteipv6 passed summary
de: Erreichbar über eine moderne Internetadresse (IPv6)

source: test siteipv6 title
de: Erreichbar über eine moderne Adresse?

source: test siteipv6 warning description
de: Schade! Deine Website ist *nicht* für Besucher erreichbar, die eine moderne Internetadresse ([IPv6](/faqs/ipv6/)), oder eine Verbesserung ist möglich. Deshalb ist deine Website nicht noch nicht Teil des modernen Internets. Du solltest deinen Hosting-Anbieter auffordern IPv6 vollständig zu aktivieren.

source: test siteipv6 warning summary
de: *Nicht* über eine moderne Internetadresse erreichbar, oder Verbesserung möglich (IPv6)

source: test siterpki failed description
de: Pech gehabt! Mindestens eine der IP-Adressen deines Webservers und der zugehörigen Nameserver hat eine Routenankündigung, die *nicht* mit der veröffentlichten Routengenehmigung ([RPKI](/faqs/rpki/)) übereinstimmt. Dies deutet auf einen unbeabsichtigten oder böswilligen Fehler in der Routenkonfiguration hin, der von deinem Webhoster oder deinem Nameserver-Hoster (interner Fehler) oder von einem Dritten (externer Fehler) verursacht werden kann. In jedem Fall kann er zur Nichterreichbarkeit deines Servers oder zum Abfangen des Internetverkehrs zu deinem Server führen. Wende dich so schnell wie möglich an deinen Webhoster oder Nameserver-Hoster. Im Falle eines internen Fehlers sollten sie ihren Netzwerkanbieter, dem die IP-Adressen deines Servers gehören, bitten, den Fehler in der Routenkonfiguration zu beheben.

source: test siterpki failed summary
de: *Unautorisierte* Routenansage (RPKI)

source: test siterpki info description
de: Informativ: Deine Domain enthält *keine* Nameserver und somit auch keine Webserver-IP-Adressen. Es gibt keine routbaren IP-Adressen, die getestet werden könnten ([RPKI](/faqs/rpki/)).

source: test siterpki info summary
de: *Keine* routingfähigen IP-Adressen gefunden (RPKI)

source: test siterpki label
de: Route Authorization (RPKI)

source: test siterpki passed description
de: Gut gemacht! Alle IP-Adressen deines Webservers und der zugehörigen Nameserver haben eine Routenankündigung, die mit der veröffentlichten Routengenehmigung ([RPKI](/faqs/rpki/)) übereinstimmt. Dadurch sind Besucher mit aktivierter Routenvalidierung besser vor verschiedenen unbeabsichtigten oder böswilligen Fehlern bei der Routenkonfiguration geschützt, die zur Nichterreichbarkeit deiner Server oder zum Abfangen des Internetverkehrs zu deinen Servern führen können.

source: test siterpki passed summary
de: Autorisierte Routenansage (RPKI)

source: test siterpki title
de: Route Autorisierung?

source: test siterpki warning description
de: Warnung! Mindestens eine der IP-Adressen deines Webservers und der zugehörigen Nameserver hat eine Routenankündigung, für die *keine* Routengenehmigung veröffentlicht ist ([RPKI](/faqs/rpki/)). Das hat zur Folge, dass Besucher mit aktivierter Routenvalidierung *nicht* (vollständig) gegen verschiedene unbeabsichtigte oder böswillige Routenkonfigurationsfehler geschützt sind, die zur Nichterreichbarkeit deiner Server oder zum Abfangen des Internetverkehrs zu deinen Servern führen können. Erkundige dich bei deinem Mail-Hoster oder Nameserver-Hoster nach diesem Problem. Sie können ihren Netzwerkanbieter, dem die IP-Adressen deiner Server gehören, bitten, Routing-Autorisierungen zu veröffentlichen.

source: test siterpki warning summary
de: Streckengenehmigung *nicht* veröffentlicht (RPKI)

source: test sitetls failed description
de: Schade! Die Verbindung mit deiner Website ist *nicht* oder *unzureichend* gesichert ([HTTPS](/faqs/https/)). Daher sind die Informationen auf dem Weg zwischen deiner Website und ihren Besuchern *nicht* ausreichend gegen Abhören und Manipulationen geschützt. Du solltest deinen Hosting-Anbieter bitten, HTTPS zu aktivieren und es sicher zu konfigurieren.

source: test sitetls failed summary
de: Verbindung *nicht* oder unzureichend gesichert (HTTPS)

source: test sitetls info description
de: Schade! Die Verbindung mit deiner Website ist *nicht* oder *unzureichend* gesichert ([HTTPS](/faqs/https/)). Daher sind die Informationen auf dem Weg zwischen deiner Website und ihren Besuchern *nicht* ausreichend gegen Abhören und Manipulationen geschützt. Du solltest deinen Hosting-Anbieter bitten, HTTPS zu aktivieren und es sicher zu konfigurieren.

source: test sitetls info summary
de: Verbindung *nicht* oder unzureichend gesichert (HTTPS)

source: test sitetls label
de: Sichere Verbindung (HTTPS)

source: test sitetls passed description
de: Gut gemacht! Die Verbindung mit deiner Website ist ausreichend gesichert ([HTTPS](/faqs/https/)). Daher sind die Informationen auf dem Weg zwischen deiner Website und ihren Besuchern gegen Abhören und Manipulationen geschützt.

source: test sitetls passed summary
de: Verbindung ausreichend gesichert (HTTPS)

source: test sitetls title
de: Sichere Verbindung?

source: test sitetls unreachable description
de: Dein Webserver war für uns nicht erreichbar, so dass wir nicht (vollständig) auf HTTPS testen konnten. Das kann an Problemen mit der Netzwerkverbindung liegen oder daran, dass der Webserver keine Verbindungen annimmt.

source: test sitetls unreachable summary
de: Unerreichbarer Webserver (HTTPS)

source: test sitetls warning description
de: Schade! Die Verbindung mit deiner Website ist *nicht* oder *unzureichend* gesichert ([HTTPS](/faqs/https/)). Daher sind die Informationen auf dem Weg zwischen deiner Website und ihren Besuchern *nicht* ausreichend gegen Abhören und Manipulationen geschützt. Du solltest deinen Hosting-Anbieter bitten, HTTPS zu aktivieren und es sicher zu konfigurieren.

source: test sitetls warning summary
de: Verbindung *nicht* oder unzureichend gesichert (HTTPS)

source: widget content notes
de: ## Anmerkungen * Logo: Wir empfehlen dir, unser [Logo](/static/logo_en.svg) auf deinem eigenen Webserver zu speichern und zu verwenden. Auf diese Weise gibt es keinen Kontakt mit unserem Webserver, wenn deine Website besucht wird. * Content-Security-Policy (CSP): Wenn du eine CSP-Richtlinie für deine Website verwendest, musst du auch `internet.nl` zu den Regeln für `form-action` und möglicherweise auch für `img-src` hinzufügen, falls du auf das Logo auf unserem Webserver verlinkst.

source: widget mail html-block
de: **Teste deine E-Mail**

source: widget mail intro
de: # E-Mail-Test-Widget Möchtest du, dass die Besucher deiner Website direkt einen E-Mail-Test starten können? Kopiere den HTML- und CSS-Code aus den Textfeldern unten in den Quellcode deiner Website.

source: widget site html-block
de: **Teste deine Website**

source: widget site intro
de: # Website-Test-Widget Möchtest du, dass die Besucher deiner Website direkt einen Website-Test starten können? Kopiere den HTML- und CSS-Code aus den Textfeldern unten in den Quellcode deiner Website.
