Repository: dreistromland/internet-standards.com
Catalog: translations/*/main.po
Languages: de

source: about contact
de: ## Kontakt dreistrom.land AG Moritz-von-Rohr-Straße 1a 07745 Jena ### Email [hello@dreistrom.land](mailto:hello@dreistrom.land)

source: accessibility content
de: # Zugänglichkeit internet-standards.de legt großen Wert auf die Barrierefreiheit. Wir wollen alle Informationen so anbieten, dass jeder sie sehen und nutzen kann. ## Bericht zur Überprüfung der Zugänglichkeit Die Website Internet.nl, auf welcher internet-standards.de basiert, wurde Ende 2018 von der niederländischen Stiftung für Barrierefreiheit auf Barrierefreiheit geprüft. Die Ergebnisse sind in dem [Bericht "WCAG 2-Studie www.internet.nl - Stufe AA"](/static/accessibility/check_6967_auto_rapport.pdf) (auf Niederländisch) d.d. 14. November 2018 enthalten. Auf der Grundlage dieser Ergebnisse hat die Plattform für Internetstandards eine Reihe von Verbesserungen für die Barrierefreiheit von Internet.nl umgesetzt.

source: base about
de: Über internet-standards.de

source: base accessibility
de: Zugänglichkeit

source: base blogs
de: Blog

source: base contact
de: Kontakt

source: base copyright
de: Copyright

source: base disclosure
de: Schwachstelle melden

source: base faqs
de: Wissensbasis

source: base halloffame
de: Ruhmeshalle

source: base halloffame champions
de: Hall of Fame - Champions!

source: base halloffame lead
de: {{Anzahl}} Domains mit 2 x 100% Letzter Eintrag: {{latest|date:'d-m-Y'}}

source: base halloffame link
de: Zur Hall of Fame - Champions!

source: base halloffame mail
de: Ruhmeshalle - E-Mail

source: base halloffame web
de: Ruhmeshalle - Websites

source: base home
de: Start

source: base info
de: Internet.nl ist eine Initiative der Internetgemeinschaft und der niederländischen Regierung.

source: base news
de: Nachrichten

source: base newslink
de: Zur Nachrichtenübersicht

source: base privacy
de: Erklärung zum Datenschutz

source: base test connection explain
de: ## Was wird getestet? Nachdem du den Verbindungstest gestartet hast, prüfen wir, ob deine aktuell genutzte Internetverbindung die folgenden modernen Internetstandards unterstützt. * [IPv6](/faqs/ipv6/): Sind Websites mit modernen Internetadressen für dich erreichbar? * [DNSSEC](/faqs/dnssec/): Werden Domain-Signaturen für dich validiert? ## Testbericht? Nachdem der Test beendet ist, wirst du zu einem Testbericht weitergeleitet. Der Bericht enthält eine prozentuale Gesamtpunktzahl sowie die Ergebnisse pro Testabschnitt und pro Untertest. Weitere Informationen findest du unter ["Erläuterung zum Testbericht"](/faqs/report/). ## Wie kann ich mich verbessern? Du kannst diesen Testbericht nutzen, um deine Internetverbindung zu verbessern. In der Regel ist es der beste nächste Schritt, deinen Internetanbieter zu kontaktieren. Bei der Kommunikation mit deinem Internetanbieter kannst du den Permalink (d.h. die URL) des Testberichts verwenden. ## Teste deine Verbindung

source: base test connection label
de: Teste deine Verbindung

source: base test connection text
de: Moderne Adressen erreichbar? Domain-Signaturen validiert?

source: base test connection title
de: Über den Verbindungstest

source: base test explain
de: Über den Test

source: base test mail explain
de: ## Was wird getestet? Nachdem du den Domainnamen eines E-Mail-Dienstes eingegeben hast, testen wir, ob der E-Mail-Dienst die unten aufgeführten modernen Internet-Standards unterstützt. * [IPv6](/faqs/ipv6/): Erreichbar über eine moderne Internetadresse? * [DNSSEC](/faqs/dnssec/): Domainnamen signiert? * [DMARC, DKIM und SPF](/faqs/mailauth/): Echtheitskennzeichen gegen E-Mail-Phishing? * [STARTTLS und DANE](/faqs/starttls): sichere Mailserver-Verbindung? * [RPKI](/faqs/rpki/): Routenautorisierung? Hinweis: Einige Standards sind auch dann relevant, wenn für deine Domain keine Mailserver konfiguriert sind. ## Testbericht? Nachdem der Test beendet ist, wirst du zu einem Testbericht weitergeleitet. Der Bericht enthält eine prozentuale Gesamtpunktzahl sowie die Ergebnisse pro Testabschnitt und pro Untertest. Weitere Informationen findest du unter ["Erläuterung zum Testbericht"](/faqs/report/). ## Wie kann ich mich verbessern? Du kannst diesen Testbericht nutzen, um deinen Mailservice zu verbessern. In der Regel ist es der beste nächste Schritt, deinen Mail Hoster zu kontaktieren. Bei der Kommunikation mit deinem Mail-Hoster kannst du den Permalink (d.h. die URL) des Testberichts verwenden. ## Widget Du kannst den E-Mail-Test mit unserem [Widget-Code](/widget-mail/) in deine eigene Website integrieren. ## Teste deine E-Mail

source: base test mail input
de: Deine E-Mail Adresse:

source: base test mail label
de: Teste deine E-Mail

source: base test mail text
de: Moderne Adresse? Anti-Phishing? Sicherer Transport? Autorisierung der Route?

source: base test mail title
de: Über den E-Mail-Test

source: base test prechecks invalid domain
de: **Die angegebene Domain ist ungültig!** Erläuterung: Für den Website-Test ist ein A- und/oder AAAA-Eintrag erforderlich, für den E-Mail-Test ein SOA-Eintrag.

source: base test start
de: Test starten

source: base test website explain
de: ## Was wird getestet? Nachdem du den Domainnamen einer Website eingegeben hast, testen wir, ob die Website die unten aufgeführten modernen Internet-Standards unterstützt. * [IPv6](/faqs/ipv6/): Erreichbar über moderne Adresse? * [DNSSEC](/faqs/dnssec/): Domainname signiert? * [HTTPS](/faqs/https/): sichere Verbindung? * [Sicherheitsoptionen](/faqs/appsecpriv/): Sicherheitsoptionen eingestellt? * [RPKI](/faqs/rpki/): Routenautorisierung? ## Testbericht? Nachdem der Test beendet ist, wirst du zu einem Testbericht weitergeleitet. Der Bericht enthält eine prozentuale Gesamtpunktzahl sowie die Ergebnisse pro Testabschnitt und pro Untertest. Weitere Informationen findest du unter ["Erläuterung des Testberichts"](/faqs/report/). ## Wie kann ich mich verbessern? Du kannst diesen Testbericht nutzen, um deine Website zu verbessern. In der Regel ist es der beste nächste Schritt, deinen Webhoster zu kontaktieren. Bei der Kommunikation mit deinem Webhoster kannst du den Permalink (d.h. die URL) des Testberichts verwenden. ## Widget Du kannst den Website-Test mit unserem [Widget-Code](/widget-site/) in deine eigene Website integrieren. ## Teste deine Website

source: base test website input
de: Der Domainname deiner Website:

source: base test website label
de: Teste deine Website

source: base test website text
de: Moderne Adresse? Signierte Domain? Sichere Verbindung? Autorisierung der Route?

source: base test website title
de: Über den Website-Test

source: base widget mail
de: E-Mail-Test-Widget

source: base widget site
de: Website Test Widget

source: connection pagetitle
de: Verbindungstest

source: connection title
de: Verbindungstest

source: copyright content
de: # Copyright ## Inhalt Wenn nicht anders angegeben, ist der Inhalt dieser Website unter einer [Creative Commons Attribution 4.0 International license](https://creativecommons.org/licenses/by/4.0/) lizenziert. ## Quellcode Der Software-Quellcode von Internet.nl wird unter der [Apache License, Version 2.0](https://opensource.org/licenses/Apache-2.0) auf [Github](https://github.com/internetstandards/Internet.nl) veröffentlicht. ## Bausteine Internet.nl wurde durch die Nutzung und Kombination anderer Open-Source-Software ermöglicht. Die wichtigsten Open-Source-Bausteine von Internet.nl sind: - [Python 3](https://www.python.org/) (Hauptprogrammiersprache) - [Django](https://www.djangoproject.com/) (Web-Framework) - [PostgreSQL](https://www.postgresql.org/) (Datenbank) - [Celery](https://www.celeryproject.org/) (Backend für asynchrone Aufgaben) - [Redis](https://redis.io/) (Cache-Backend für Django und Celery) - [RabbitMQ](https://www.rabbitmq.com/) (Nachrichten-Broker für Celery) - [unbound/libunbound](https://www.nlnetlabs.nl/projects/unbound/about/) (für DNS-bezogene Tests und Funktionen) - [nassl](https://github.com/nabla-c0d3/nassl) (Python-Bindings für OpenSSL; für TLS-bezogene Tests) - [Routinator](https://www.nlnetlabs.nl/projects/rpki/routinator/) (für RPKI-bezogene Tests) - [SecTXT](https://github.com/DigitalTrustCenter/sectxt) (für security.txt-Tests) - [Postfix](https://www.postfix.org/) (Mailserver für den interaktiven E-Mail-Test, _beta_) ## Namen und Logos * Sowohl der Name Internet.nl als auch das Internet.nl-Logo sind ausdrücklich von der obigen Lizenzierung ausgeschlossen. Wir erteilen also keine Erlaubnis, diese zu verwenden, wenn unsere Inhalte oder unser Softwarecode wiederverwendet werden, es sei denn, wir machen eine ausdrückliche Ausnahme und die entsprechenden Kriterien werden erfüllt (z. B. im Fall der [100% Badges](/faqs/badges/)). * Die Namen und Logos in den Icons, die sich auf unsere Social-Media-Plätze beziehen, sind ausdrücklich von der oben genannten Lizenzierung ausgeschlossen. ## Andere Test-Websites, die auf Internet.nl basieren Soweit uns bekannt ist, haben die folgenden Test-Websites den Internet.nl-Quellcode wiederverwendet. Bitte lass uns wissen, ob deine Website auf unserem Quellcode basiert. - [aucheck.com.au](https://aucheck.com.au/) (Australien) - [top.nic.br](https://top.nic.br/) (Brasilien) - [sikkerpånettet.dk](https://sikkerpånettet.dk/) (Dänemark)

source: detail conn dnssec validation exp
de: Wir prüfen, ob die Resolver, die du verwendest, die DNSSEC-Signaturen unseres Domänennamens. Resolver werden in der Regel von deinem Internet-Provider bereitgestellt. Alternativ kannst du auch Resolver von einem anderen DNS-Anbieter konfigurieren. Du kannst sogar deinen eigenen, lokal installierten Resolver verwenden. Die Validierung erfolgt zwar im Resolver erfolgt, wird die Kommunikation vom Resolver zurück zu deinem Gerät (die so genannte "letzte Meile") könnte von einem Angreifer manipuliert werden. Daher ist es am sichersten, die Validierung in der Nähe des Endgeräts durchzuführen (z. B. (z. B. mit einem lokal installierten Resolver), oder sicherzustellen, dass der Kanal zwischen deinem Resolver und deinem Endgerät gesichert/vertrauenswürdig ist.

source: detail conn dnssec validation label
de: DNSSEC-Validierung

source: detail conn dnssec validation tech table
de: DNS-Anbieter

source: detail conn dnssec validation verdict bad
de: Du bist *nicht* durch die DNSSEC-Signaturvalidierung geschützt.

source: detail conn dnssec validation verdict good
de: Du bist durch die DNSSEC-Signaturvalidierung geschützt.

source: detail conn ipv6 connection exp
de: Wir prüfen, ob dein Gerät über seine aktuelle Internetverbindung in der Lage ist in der Lage ist, sich *direkt* (d.h. ohne DNS-Übersetzung) mit unserem Webserver zu verbinden. unserer entsprechenden IPv6-Adresse. Einige Browser-Add-ons und Router bieten Funktionen zur Domain-Filterung, um die Privatsphäre zu schützen oder die Internetnutzung einzuschränken. Um eine Umgehung zu verhindern, blockieren diese Funktionen oft die direkte Verbindung zu IP-Adressen, so dass deine Internetverbindung bei diesem Subtest nicht funktioniert.

source: detail conn ipv6 connection label
de: IPv6-Konnektivität (direkt)

source: detail conn ipv6 connection tech table
de: Anonymisierte IPv6-Adresse|Rückwärtsname|Internetanbieter

source: detail conn ipv6 connection verdict bad
de: Du bist *nicht* in der Lage, Computer direkt über ihre IPv6-Adresse zu erreichen.

source: detail conn ipv6 connection verdict good
de: Du kannst Computer direkt über ihre IPv6-Adresse erreichen.

source: detail conn ipv6 dns-conn exp
de: Wir prüfen, ob dein Gerät über seine aktuelle Internetverbindung in der Lage ist mit unserem Webserver über IPv6 verbinden kann. Für diesen Test geben wir einen Domainnamen an und erwarten von deinem Resolver, dass er den Domainnamen in die entsprechende IPv6-Adresse auflöst.

source: detail conn ipv6 dns-conn label
de: IPv6-Konnektivität (über DNS)

source: detail conn ipv6 dns-conn verdict bad
de: Du bist *nicht* in der Lage, Computer über DNS mit ihrer IPv6-Adresse zu erreichen.

source: detail conn ipv6 dns-conn verdict good
de: Du kannst Computer über DNS mit ihrer IPv6-Adresse erreichen.

source: detail conn ipv6 ipv4-conn exp
de: Wir prüfen, ob dein Gerät über seine aktuelle Internetverbindung in der Lage ist mit unserem Webserver über IPv4 verbinden kann. Für diesen Test geben wir einen Domainnamen an und erwarten von deinem Resolver, dass er den Domainnamen in die entsprechende IPv4-Adresse auflöst. *Anforderungsstufe: Optional*

source: detail conn ipv6 ipv4-conn label
de: IPv4-Verbindung (über DNS)

source: detail conn ipv6 ipv4-conn tech table
de: Anonymisierte IPv4-Adresse|Rückwärtsname|Internetanbieter

source: detail conn ipv6 ipv4-conn verdict bad
de: Du bist *nicht* in der Lage, Computer über DNS mit ihrer IPv4-Adresse zu erreichen.

source: detail conn ipv6 ipv4-conn verdict good
de: Du kannst Computer über DNS mit ihrer IPv4-Adresse erreichen.

source: detail conn ipv6 privacy exp
de: Wir prüfen, ob dein Gerät IPv6 Privacy Extensions für SLAAC (oder ein anderes IPv6-Konfigurationsprozess als SLAAC) verwendet, um die Weitergabe seiner potenziell datenschutzsensiblen MAC-Adresse an Computer, mit denen es sich über IPV6 VERBINDET.

source: detail conn ipv6 privacy label
de: Datenschutzerweiterungen für IPv6

source: detail conn ipv6 privacy verdict bad
de: Du verwendest SLAAC *ohne* "IPv6 Privacy Extensions".

source: detail conn ipv6 privacy verdict good
de: Du hast "IPv6 Privacy Extensions" aktiviert (oder du verwendest kein SLAAC).

source: detail conn ipv6 resolver-conn exp
de: Wir prüfen, ob mindestens einer der DNS-Resolver, die du verwendest, in der Lage ist unsere autoritativen Nameserver über IPv6 zu erreichen. Normalerweise stellt dein Internet Provider den/die DNS-Resolver zur Verfügung.

source: detail conn ipv6 resolver-conn label
de: IPv6-Konnektivität des DNS-Auflösers

source: detail conn ipv6 resolver-conn verdict bad
de: Dein DNS-Resolver ist *nicht* in der Lage, Nameserver über IPv6 zu erreichen.

source: detail conn ipv6 resolver-conn verdict good
de: Dein DNS-Resolver ist in der Lage, Nameserver über IPv6 zu erreichen.

source: detail mail auth dkim exp
de: Wir prüfen, ob deine Domain DKIM-Einträge unterstützt. Ein empfangender Mailserver kann den öffentlichen Schlüssel in deinem DKIM-Eintrag verwenden, um die Signatur in einer E-Mail mit einem Nutzer von deiner Domain als Absender zu überprüfen und die Authentizität der E-Mail festzustellen. * Zurzeit sind wir nicht in der Lage, den öffentlichen Schlüssel in deinem DKIM-Eintrag abzufragen und auszuwerten, weil wir dazu den DKIM-Selektor benötigen (der in den von dir gesendeten E-Mails enthalten sein sollte). * Um den diesen Test zu bestehen, erwarten wir, dass dein Nameserver auf unsere Abfrage nach `_domainkey.example.nl`. Wenn `_domainkey.example.nl` ein "leeres Nicht Terminal" ist, antworten einige Nameserver, die nicht mit dem Standard RFC 2308 entsprechen, antworten fälschlicherweise mit `NXDOMAIN` statt mit `NOERROR`. Das macht es Dies macht es uns unmöglich, die Unterstützung für DKIM-Einträge zu erkennen. * Für diesen Test gehen wir von einer "strengen Ausrichtung" aus, die mit DMARC konform ist. Die angegebene Domain wird als Absender-Domain in der Mail-Body-Domain (`From:`) betrachtet und muss mit der DKIM-Domain (`d=`) und der SPF-Domain (Absender des Briefumschlags, d.h. der Absenderpfad, der in `MAIL FROM` auftaucht) identisch sein. Für eine "gute Praxis bei Domänen ohne Mail" siehe die [Erläuterung des Untertests "DMARC-Richtlinie"](#control-panel-9).

source: detail mail auth dkim label
de: DKIM Existenz

source: detail mail auth dkim verdict bad
de: Deine Domain unterstützt *keine* DKIM-Einträge.

source: detail mail auth dkim verdict good
de: Deine Domain unterstützt DKIM-Einträge.

source: detail mail auth dkim verdict no-email
de: Deine Domain unterstützt DKIM-Einträge *nicht*. Da deine DMARC- und SPF-Einträge jedoch darauf hindeuten, dass keine E-Mails von deiner Domain gesendet werden, ist DKIM nicht notwendig und dieser Untertest wird übersprungen.

source: detail mail auth dmarc exp
de: Wir prüfen, ob DMARC für deine Domain verfügbar ist. Ein empfangender Mailserver kann Ihre DMARC-Richtlinie verwenden, um zu ermitteln, wie eine E-Mail mit Ihrer Domain als Absender zu behandeln ist. Absender zu behandeln ist, die nicht mit DKIM und SPF authentifiziert werden konnte, und deine Mailadresse aus dem DMARC-Eintrag verwenden, um dir Rückmeldungen über die der Authentifizierung an dich zu senden. Mehr als ein DMARC-Eintrag in derselben Domäne ist nicht gültig und führt zu einem Fehlschlag des Tests. Hinweis: DMARC erfordert die SPF Domain (Absender des Briefumschlags, d.h. der Absenderpfad, der in `MAIL FROM` auftaucht) und die DKIM-Domain (`d=`) mit der Mail Body Domain (`From:`) übereinstimmen.

source: detail mail auth dmarc label
de: DMARC Existenz

source: detail mail auth dmarc tech table
de: DMARC-Eintrag|Gefunden am

source: detail mail auth dmarc verdict bad
de: Deine Domain hat *keinen* DMARC-Eintrag.

source: detail mail auth dmarc verdict good
de: Deine Domain hat einen DMARC-Eintrag.

source: detail mail auth dmarc-policy exp
de: Wir prüfen, ob die Syntax deines DMARC-Datensatzes korrekt ist und ob er eine ausreichend strenge Richtlinie (`p=quarantine` oder `p=reject`) enthält, um den Missbrauch deiner Domain durch Phisher und Spammer zu verhindern. Auch ohne eine strenge Richtlinie kann DMARC nützlich sein, um durch DMARC-Berichte mehr Einblick in legitime und illegale ausgehende Mailströme zu erhalten. Um den Missbrauch deiner Domain wirksam zu bekämpfen, ist eine liberale Richtlinie (`p=none`) jedoch nicht ausreichend. Wir überprüfen auch, ob die Mailadressen unter `rua=` und `ruf=` gültig sind. Falls sie eine externe Mailadresse enthalten, prüfen wir, ob die externe Domain berechtigt ist, DMARC-Meldungen zu empfangen. Vergewissere dich, dass der DMARC-Autorisierungseintrag auf der externen Domain mindestens `"v=DMARC1;"` enthält. Der Test erlaubt die Verwendung des experimentellen `np`-Tags (RFC 9091). *Gute Praxis für Domains ohne Mail*: * Nicht-Senden: Verwende die strengste DMARC-Richtlinie (`p=reject`) und SPF-Richtlinie (`-all`) für deine Domain, die du nicht zum Versenden von Mails verwendest, um Missbrauch ("spoofing") zu verhindern. Beachte, dass DKIM in diesem Fall nicht notwendig ist. * Nicht-Empfang: Weitere Informationen zu "Null MX" und "No MX" findest du in der [Erklärung zum Untertest "STARTTLS verfügbar"](#control-panel-13). Im Folgenden findest du zwei grundlegende Beispiel-DNS-Konfigurationen für Domänennamen, die nicht zum Senden und Empfangen von E-Mails verwendet werden. *A. Einzelne Domain ohne A- oder AAAA-Eintrag* beispiel.nl. TXT "v=spf1 -all" *.example.nl. TXT "v=spf1 -all" _dmarc.example.nl. TXT "v=DMARC1; p=reject;" &nbsp; *B. Einzelne No-Mail-Domain mit A- oder AAAA-Eintrag* example.nl. AAAA 2a00:d78:0:712:94:198:159:35 Beispiel.nl. A 94.198.159.35 example.nl. MX 0 . example.nl. TXT "v=spf1 -all" *.example.nl. TXT "v=spf1 -all" www.example.nl. CNAME example.nl _dmarc.example.nl. TXT "v=DMARC1; p=reject;"

source: detail mail auth dmarc-policy label
de: DMARC-Richtlinie

source: detail mail auth dmarc-policy verdict bad
de: Deine DMARC-Richtlinie ist *nicht* syntaktisch korrekt.

source: detail mail auth dmarc-policy verdict external
de: Die Domain der externen Mailadresse, die auf `rua=` und/oder `ruf=` folgt, hat *keinen* (gültigen) Berechtigungseintrag für den Empfang von DMARC-Berichten für die getestete Domain.

source: detail mail auth dmarc-policy verdict good
de: Deine DMARC-Richtlinie ist streng genug.

source: detail mail auth dmarc-policy verdict policy
de: Deine DMARC-Richtlinie ist *nicht* streng genug.

source: detail mail auth spf exp
de: Wir prüfen, ob deine Domain einen SPF-Eintrag hat. Ein empfangender Mailserver kann die IP-Adressen in deinem SPF-Eintrag verwenden, um den sendenden Mailserver einer empfangenen E-Mail mit deiner Domain als Absender zu authentifizieren. Wenn die Authentifizierung fehlschlägt, kann die zugehörige Richtlinie genutzt werden, um entsprechende Maßnahmen zu ergreifen. Mehr als ein SPF-Eintrag in derselben Domäne ist nicht zulässig und führt zu einem Fehlschlag des Tests. Eine "gute Praxis für Domänen ohne Mail" findest du in der [Erläuterung zum Untertest "DMARC-Richtlinie"](#control-panel-9).

source: detail mail auth spf label
de: SPF Existenz

source: detail mail auth spf tech table
de: SPF-Eintrag

source: detail mail auth spf verdict bad
de: Deine Domain hat *keinen* gültigen SPF-Eintrag.

source: detail mail auth spf verdict good
de: Deine Domain hat einen SPF-Eintrag.

source: detail mail auth spf-policy exp
de: Wir prüfen, ob die Syntax deines SPF-Eintrags korrekt ist und ob er eine ausreichend strenge Richtlinie enthält, z.B. `~all` (softfail) oder `-all` (fail), um Missbrauch durch Phisher und Spammer zu verhindern. Eine liberale Richtlinie wie `+all` (pass) oder `?all` (neutral) ist nicht ausreichend, um den Missbrauch deiner Domain zu verhindern. Wenn "all" fehlt und kein "redirect"-Modifikator in deinem SPF-Eintrag vorhanden ist, ist der Standardwert "all". Wir verfolgen auch `include` und `redirect` für gültige SPF-Einträge. Außerdem überprüfen wir, ob dein SPF-Eintrag die zulässige Anzahl von 10 DNS-Lookups nicht überschreitet und damit unwirksam ist. Jeder der folgenden SPF-Begriffe zählt als ein DNS-Lookup: `redirect`, `include`, `a`, `mx`, `ptr` und `exist`. Die SPF-Begriffe `all`, `ip4`, `ip6` und `exp` zählen dagegen nicht als DNS-Nachschlag. Wenn die `include`- oder `redirect`-Domain aus Makros besteht, folgen wir ihnen nicht, da wir nicht über die notwendigen Informationen aus einer tatsächlichen Mail- oder Mailserververbindung verfügen, um diese Makros zu erweitern. Das bedeutet, dass wir das Ergebnis der Makros nicht auswerten. Außerdem zählen wir die durch Makros verursachten DNS-Lookups nicht, um festzustellen, ob die zulässige Anzahl von DNS-Lookups überschritten wurde. Für sendende Domänen ist die Verwendung von `~all` (softfail) anstelle von `-all` (fail) normalerweise vorzuziehen. Denn wenn die SPF-Authentifizierung mit einem SPF-Fail fehlschlägt, kann ein empfangender Mailserver die Verbindung bereits blockieren, ohne die DKIM-Signatur und die DMARC-Richtlinie zu bewerten. Dies kann zu fälschlicherweise blockierten Mails führen (z. B. wenn Mails vom empfangenden Mailserver automatisch an einen anderen empfangenden Mailserver weitergeleitet werden). Beachte, dass ein ausgelöster SPF-Softfail immer noch sicherstellt, dass eine strenge DMARC-Richtlinie deine Domain schützt, wenn die DKIM-Authentifizierung ebenfalls fehlschlägt. Für No-Mail-Domains siehe die gute Praxis auf [Erklärung des Untertests "DMARC-Richtlinie"](#control-panel-9).

source: detail mail auth spf-policy label
de: SPF-Politik

source: detail mail auth spf-policy tech table
de: Domain|SPF record

source: detail mail auth spf-policy verdict all
de: Deine SPF-Richtlinie ist *nicht* streng genug.

source: detail mail auth spf-policy verdict bad
de: Deine SPF-Richtlinie ist *nicht* syntaktisch korrekt.

source: detail mail auth spf-policy verdict good
de: Deine SPF-Richtlinie ist streng genug.

source: detail mail auth spf-policy verdict include
de: Deine SPF-Richtlinie ist *nicht* streng genug. Der "include"-Mechanismus in deinem SPF-Eintrag weist auf eine nicht ausreichend strenge SPF-Richtlinie oder einen nicht vorhandenen SPF-Eintrag hin.

source: detail mail auth spf-policy verdict max-lookups
de: Deine SPF-Richtlinie ist *nicht* effektiv, da sie mehr als die erlaubten 10 DNS-Lookups erfordert. Jeder der folgenden SPF-Begriffe zählt als ein DNS-Lookup: `redirect`, `include`, `a`, `mx`, `ptr` und `exist`. Die SPF-Begriffe `all`, `ip4`, `ip6` und `exp` zählen nicht als DNS-Lookups.
