Repository: dreistromland/internet-standards.com
Catalog: translations/*/main.po
Languages: de

source: detail web tls cert-signature verdict bad
de: Dein Website-Zertifikat wird mit einem Hash-Algorithmus signiert, der *unzureichend* sicher ist.

source: detail web tls cert-signature verdict good
de: Dein Website-Zertifikat wird mit einem sicheren Hash-Algorithmus signiert.

source: detail web tls cert-trust exp
de: Wir prüfen, ob wir eine gültige Vertrauenskette für dein Website-Zertifikat erstellen können. Für eine gültige Vertrauenskette muss dein Zertifikat von einer [öffentlich vertrauenswürdigen Zertifizierungsstelle](https://www.mozilla.org/en-US/about/governance/policies/security-group/certs/) veröffentlicht werden, und dein Webserver muss alle erforderlichen Zwischenzertifikate vorlegen. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B3-4 (auf Englisch).

source: detail web tls cert-trust label
de: Vertrauenskette des Zertifikats

source: detail web tls cert-trust tech table
de: Webserver IP-Adresse|Unvertrauenswürdige Zertifikatskette

source: detail web tls cert-trust verdict bad
de: Die Vertrauenskette deines Website-Zertifikats ist *nicht* vollständig und/oder *nicht* nicht von einer vertrauenswürdigen Stammzertifizierungsstelle unterzeichnet.

source: detail web tls cert-trust verdict good
de: Die Vertrauenskette deines Website-Zertifikats ist vollständig und von einer vertrauenswürdigen Stammzertifizierungsstelle unterzeichnet.

source: detail web tls cipher-order exp
de: Wir prüfen, ob dein Webserver seine eigene Verschlüsselungspräferenz durchsetzt ("I") und Verschlüsselungen gemäß der vorgeschriebenen Reihenfolge anbietet ("II"). Wenn dein Webserver nur "gute" Chiffren unterstützt, ist dieser Untertest nicht anwendbar, da die Reihenfolge keinen nennenswerten Sicherheitsvorteil bietet. I. *Server erzwungene Chiffrierpräferenz*: Der Webserver erzwingt seine eigene Chiffrierpräferenz, während er mit einem Webbrowser verhandelt, und akzeptiert keine Präferenz des Webbrowsers; II. *Vorgeschriebene Reihenfolge*: Die Chiffren werden vom Webserver in der vorgeschriebenen Reihenfolge angeboten, wobei "Gute" Chiffren gegenüber "Ausreichende" Chiffren gegenüber "Auslaufende" bevorzugt werden. In der obigen Tabelle mit den technischen Details sind **nur die zuerst gefundenen aus der vorgeschriebenen Reihenfolge ausgewählten Algorithmen** aufgeführt. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Leitfaden B2-5.

source: detail web tls cipher-order label
de: Chiffrierauftrag

source: detail web tls cipher-order tech table
de: IP-Adresse des Webservers|Erstes gefundenes betroffenes Chiffrierpaar|Verstoßene Regel # ('II-B')

source: detail web tls cipher-order verdict bad
de: Dein Webserver erzwingt *nicht* seine eigene Verschlüsselungspräferenz ("I").

source: detail web tls cipher-order verdict good
de: Dein Webserver setzt seine eigene Verschlüsselungspräferenz durch ("I") und bietet Verschlüsselungen gemäß der vorgeschriebenen Reihenfolge an ("II").

source: detail web tls cipher-order verdict na
de: Dieser Untertest ist nicht anwendbar, da dein Webserver nur "gute" Chiffren unterstützt.

source: detail web tls cipher-order verdict seclevel-bad
de: Dein Webserver bevorzugt *nicht* "Gute" gegenüber "Ausreichende" gegenüber "Auslaufende" Chiffren ("II").

source: detail web tls cipher-order verdict warning
de: VERALTETER TEXT; URTEIL NICHT VERWENDET Dein Webserver bietet *keine* Verschlüsselungen gemäß der vorgeschriebenen Reihenfolge innerhalb einer bestimmten Sicherheitsstufe ('II-B') an.

source: detail web tls ciphers exp
de: Wir prüfen, ob dein Webserver nur sichere, d. h. "gute" und/oder "ausreichende", Verschlüsselungen (auch bekannt als Algorithmusauswahl) unterstützt. Eine Algorithmusauswahl besteht aus Chiffren für vier kryptografische Funktionen: 1) Schlüsselaustausch, 2) Zertifikatsüberprüfung, 3) Massenverschlüsselung und 4) Hashing. Ein Webserver kann mehr als eine Algorithmusauswahl unterstützen. * Seit TLS 1.3 umfasst der Begriff "Cipher Suite" nur noch die Chiffren für die Massenverschlüsselung und das Hashing. Bei der Verwendung von TLS 1.3 sind die Chiffren für den Schlüsselaustausch und die Zertifikatsüberprüfung verhandelbar und nicht Teil der Benennung der Cipher Suite. Da dies den Begriff "Cipher Suite" mehrdeutig macht, verwendet das NCSC-NL den Begriff "Algorithmusauswahl", um alle vier Cipher-Funktionen zusammenzufassen. * Die NCSC-NL verwendet die [IANA-Namenskonvention] (https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml#tls-parameters-4) für die Algorithmusauswahl. Internet.nl verwendet die [OpenSSL-Namenskonvention](https://www.openssl.org/docs/manmaster/man1/openssl-ciphers.html#CIPHER-SUITE-NAMES). Seit TLS 1.3 folgt OpenSSL der IANA-Benennungskonvention. Eine Übersetzung zwischen beiden findet sich in der OpenSSL-Dokumentation. * Beachte, dass Chiffren, die PSK oder SRP für den Schlüsselaustausch verwenden (die nicht ausreichend sicher sind), in diesem Test aufgrund einer Einschränkung unserer Testmethode nicht erkannt werden. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B2-1 bis B2-4 und Tabelle 2, 4, 6 und 7 (in Englisch). --- Im Folgenden findest du die Auswahl der Algorithmen "Gut", "Ausreichend" und "Auslaufend" in der von der NCSC-NL vorgeschriebenen Reihenfolge, basierend auf Anhang C der "IT Security Guidelines for Transport Layer Security (TLS)". Hinter jeder Algorithmus-Auswahl steht die minimale TLS-Version (z.B. [1.2]), die diese Algorithmus-Auswahl unterstützt und die mindestens "Phase out" ist. Gut: * `ECDHE-ECDSA-AES256-GCM-SHA384` (`TLS_AES_256_GCM_SHA384` in 1.3) [1.2] * `ECDHE-ECDSA-CHACHA20-POLY1305` (`TLS_CHACHA20_POLY1305_SHA256` in 1.3) [1.2] * `ECDHE-ECDSA-AES128-GCM-SHA256` (`TLS_AES_128_GCM_SHA256` in 1.3) [1.2] * `ECDHE-RSA-AES256-GCM-SHA384` (`TLS_AES_256_GCM_SHA384` in 1.3) [1.2] * `ECDHE-RSA-CHACHA20-POLY1305` (`TLS_CHACHA20_POLY1305_SHA256` in 1.3) [1.2] * `ECDHE-RSA-AES128-GCM-SHA256` (`TLS_AES_128_GCM_SHA256` in 1.3) [1.2] Ausreichend: * `ECDHE-ECDSA-AES256-SHA384` [1.2] * `ECDHE-ECDSA-AES256-SHA` [1.0] * `ECDHE-ECDSA-AES128-SHA256` [1.2] * `ECDHE-ECDSA-AES128-SHA` [1.0] * `ECDHE-RSA-AES256-SHA384` [1.2] * `ECDHE-RSA-AES256-SHA` [1.0] * `ECDHE-RSA-AES128-SHA256` [1.2] * `ECDHE-RSA-AES128-SHA` [1.0] * `DHE-RSA-AES256-GCM-SHA384` [1.2] * `DHE-RSA-CHACHA20-POLY1305` [1.2] * `DHE-RSA-AES128-GCM-SHA256` [1.2] * `DHE-RSA-AES256-SHA256` [1.2] * `DHE-RSA-AES256-SHA` [1.0] * `DHE-RSA-AES128-SHA256` [1.2] * `DHE-RSA-AES128-SHA` [1.0] Auslaufen: * `ECDHE-ECDSA-DES-CBC3-SHA` [1.0] * `ECDHE-RSA-DES-CBC3-SHA` [1.0] * "DHE-RSA-DES-CBC3-SHA" [1.0] * `AES256-GCM-SHA384` [1.2] * `AES128-GCM-SHA256` [1.2] * `AES256-SHA256` [1.2] * `AES256-SHA` [1.0] * `AES128-SHA256` [1.2] * `AES128-SHA` [1.0] * `DES-CBC3-SHA` [1.0]

source: detail web tls ciphers label
de: Chiffren (Algorithmus-Auswahlen)

source: detail web tls ciphers tech table
de: Webserver IP-Adresse|Betroffene Chiffren|Status

source: detail web tls ciphers verdict bad
de: Dein Webserver unterstützt eine oder mehrere *genügend* sichere Verschlüsselungen.

source: detail web tls ciphers verdict good
de: Dein Webserver unterstützt nur sichere Verschlüsselungen.

source: detail web tls ciphers verdict phase-out
de: Dein Webserver unterstützt eine oder mehrere Verschlüsselungen, die einen *Phase out* Status haben, weil sie als anfällig gelten und Gefahr laufen, *unzureichend* sicher zu werden.

source: detail web tls compression exp
de: Wir prüfen, ob dein Webserver TLS-Kompression unterstützt. Die Verwendung von Komprimierung kann einem Angreifer Informationen über die geheimen Teile der verschlüsselten Kommunikation liefern. Ein Angreifer, der Teile der gesendeten Daten ermitteln oder kontrollieren kann, kann die ursprünglichen Daten rekonstruieren, indem er eine große Anzahl von Anfragen durchführt. Die TLS-Komprimierung wird so selten verwendet, dass es in der Regel kein Problem ist, sie zu deaktivieren. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B7-1 und Tabelle 11 (auf Englisch). --- **Komprimierungsoption** * Gut: Keine Kompression * Ausreichend: Kompression auf Anwendungsebene (in diesem Fall HTTP-Kompression) * Unzureichend: TLS-Kompression

source: detail web tls compression label
de: TLS-Komprimierung

source: detail web tls compression tech table
de: Webserver IP-Adresse|TLS-Kompression

source: detail web tls compression verdict bad
de: Dein Webserver unterstützt TLS-Kompression, die *nicht* sicher ist.

source: detail web tls compression verdict good
de: Dein Webserver unterstützt keine TLS-Komprimierung.

source: detail web tls dane-exists exp
de: Wir prüfen, ob die Nameserver deiner Website-Domain einen korrekt signierten TLSA-Eintrag für DANE enthalten. Da DNSSEC eine Voraussetzung für DANE ist, schlägt dieser Test fehl, wenn DNSSEC auf der Website-Domain fehlt oder wenn es DNSSEC-Probleme im Zusammenhang mit DANE gibt (z. B. kein Nachweis für "Denial of Existence"). Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Anhang A, unter 'Certificate pinning and DANE' (in Englisch). *Anforderungsstufe: Optional*

source: detail web tls dane-exists label
de: DANE Existenz

source: detail web tls dane-exists tech table
de: Webserver IP-Adresse|DANE TLSA-Eintrag vorhanden

source: detail web tls dane-exists verdict bad
de: Deine Website-Domain enthält *keinen* TLSA-Eintrag für DANE.

source: detail web tls dane-exists verdict bogus
de: Deine Website-Domain liefert *keinen* DNSSEC-Beweis dafür, dass es keine DANE TLSA-Datensätze gibt. Du solltest deinen Nameserver-Betreiber bitten, dieses Problem zu beheben.

source: detail web tls dane-exists verdict good
de: Deine Website-Domain enthält einen TLSA-Eintrag für DANE.

source: detail web tls dane-rollover exp
de: VERALTETER TEXT; TEST NICHT VERWENDET Wir prüfen, ob deine Website-Domain über ein geeignetes DANE-Rollover Schema hat, um DANE-Zertifikat-Rollover zu handhaben. Das Vorhandensein eines DANE-Rollover-Schemas zu haben, ist nicht erforderlich. Es wird sich als nützlich erweisen, wenn du dein DANE-Zertifikat aktualisiert werden muss und du sicherstellen willst, dass die DANE-Validierung während der Übergangsphase weiterhin funktioniert. Der Weg, dies zu erreichen ist, indem du zwei verschiedene TLSA-Datensätze veröffentlichst. Die Konfigurationen der der TLSA-Datensätze sind die folgenden: - Satzart 3 1 1 (aktueller Schlüssel) + Satzart 3 1 1 (zukünftiger Schlüssel), oder - Satzart 3 1 1 (aktueller Schlüssel) + Satzart 2 1 1 (vertrauenswürdige CA).

source: detail web tls dane-rollover label
de: VERALTETER TEXT; TEST NICHT VERWENDET DANE-Rollover-Schema

source: detail web tls dane-rollover tech table
de: VERALTETER TEXT; TEST NICHT VERWENDET Webserver-IP-Adresse|DANE-Rollover-Schema

source: detail web tls dane-rollover verdict bad
de: VERALTETER TEXT; TEST NICHT VERWENDET Deine Website-Domain verfügt *nicht* über ein geeignetes Schema für rollende DANE-Zertifikate.

source: detail web tls dane-rollover verdict good
de: VERALTETER TEXT; TEST NICHT VERWENDET Deine Website-Domain hat ein geeignetes Schema für rollende DANE Zertifikate.

source: detail web tls dane-valid exp
de: Wir prüfen, ob der DANE-Fingerabdruck, der von deiner Domain vorgelegt wird, für dein Web-Zertifikat gültig ist. DANE ermöglicht es dir, Informationen über dein Website-Zertifikat in einem speziellen DNS-Eintrag, dem sogenannten TLSA-Eintrag, zu veröffentlichen. Kunden, wie z. B. Webbrowser, können die Echtheit deines Zertifikats nicht nur über die Zertifizierungsstelle, sondern auch über den TLSA-Eintrag überprüfen. Ein Kunde kann den TLSA-Eintrag auch als Signal nutzen, nur HTTPS (und nicht HTTP) zu verwenden. DNSSEC ist eine Vorbedingung für DANE. Leider unterstützen noch nicht viele Webbrowser die DANE-Validierung. *Anforderungsniveau: Empfohlen (nur wenn der Subtest für 'DANE Existenz' bestanden ist)*

source: detail web tls dane-valid label
de: DANE Gültigkeit

source: detail web tls dane-valid tech table
de: Webserver IP-Adresse|DANE TLSA-Datensatz gültig

source: detail web tls dane-valid verdict bad
de: Der DANE-Fingerabdruck auf deiner Domain ist für dein Webzertifikat *nicht* gültig. Entweder hat jemand die Antwort von deinem Nameserver manipuliert, oder deine Domain hat einen schweren DANE-Konfigurationsfehler. Im letzteren Fall ist deine Website für alle Benutzer, die DANE-Fingerabdrücke überprüfen, unerreichbar. Du solltest dich an deinen Nameserver-Betreiber und/oder deinen Hosting-Provider so schnell wie möglich kontaktieren.

source: detail web tls dane-valid verdict good
de: Der DANE-Fingerabdruck auf deiner Domain ist für dein Webzertifikat gültig.

source: detail web tls fs-params exp
de: Wir prüfen, ob die öffentlichen Parameter, die beim Diffie-Hellman-Schlüsselaustausch von deinem Webserver verwendet werden, sicher sind. **ECDHE**: Die Sicherheit des ephemeren Diffie-Hellman-Schlüsselaustauschs mit elliptischen Kurven (ECDHE) hängt von der verwendeten elliptischen Kurve ab. Wir prüfen, ob die Bitlänge der verwendeten elliptischen Kurven mindestens 224 Bit beträgt. Derzeit können wir den Namen der elliptischen Kurve nicht überprüfen. **DHE**: Die Sicherheit des Diffie-Hellman Ephemeral (DHE)-Schlüsselaustauschs hängt von der Länge der öffentlichen und geheimen Schlüssel ab, die innerhalb der gewählten endlichen Feldgruppe verwendet werden. Wir prüfen, ob dein öffentliches DHE-Schlüsselmaterial eine der vordefinierten finiten Feldgruppen verwendet, die in [RFC 7919](https://www.rfc-editor.org/rfc/rfc7919) angegeben sind. Selbst erzeugte Gruppen sind "unzureichend". Die größeren Schlüsselgrößen, die für die Verwendung von DHE erforderlich sind, gehen zu Lasten der Leistung. Prüfe sorgfältig und verwende ECDHE anstelle von DHE, wenn du kannst. **RSA als Alternative**: Neben ECDHE und DHE kann auch RSA für den Schlüsselaustausch verwendet werden. Es besteht jedoch die Gefahr, dass es nicht mehr ausreichend sicher ist (aktueller Status "phase out"). Die öffentlichen RSA-Parameter werden in der Unterprüfung "Öffentlicher Schlüssel des Zertifikats" geprüft. Beachte, dass RSA für die Zertifikatsprüfung als "gut" gilt. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B5-1 und Tabelle 9 für ECDHE, und Richtlinie B6-1 und Tabelle 10 für DHE (in Englisch). --- **Elliptische Kurve für ECDHE** * Gut: `secp384r1`, `secp256r1`, `x448`, und `x25519` * Auslaufen: `secp224r1` * Unzureichend: Andere Kurven **Finite Feldgruppe für DHE** * Ausreichend: * [ffdhe4096](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe4096.pem) (RFC 7919) sha256 checksum: `64852d6890ff9e62eecd1ee89c72af9af244dfef5b853bcedea3dfd7aade22b3` * [ffdhe3072](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe3072.pem) (RFC 7919) sha256 checksum: `c410cc9c4fd85d2c109f7ebe5930ca5304a52927c0ebcb1a11c5cf6b2386bbab` * Beachte, dass wir auch auf ffdhe8192 und ffdhe6144 testen. Der begrenzte Gewinn an Sicherheit überwiegt jedoch selten den Leistungsverlust. * Phase out: * [ffdhe2048](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe2048.pem) (RFC 7919) sha256 checksum: `9ba6429597aeed2d8617a7705b56e96d044f64b07971659382e426675105654b` * Unzureichend: Andere Gruppen --- Hinweis: Die oben genannten Namen basieren auf den [IANA-Namenskonventionen] (https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml). Manchmal werden alternative Namen für dieselben Kurven verwendet, wie z.B. `prime256v1` (ANSI) und `NIST P-256` für `secp256r1`.

source: detail web tls fs-params label
de: Parameter für den Schlüsselaustausch

source: detail web tls fs-params tech table
de: Webserver IP-Adresse|Betroffene Parameter|Status

source: detail web tls fs-params verdict bad
de: Dein Webserver unterstützt *unzureichend* sichere Parameter für den Diffie-Hellman-Schlüsselaustausch.

source: detail web tls fs-params verdict good
de: Dein Webserver unterstützt sichere Parameter für den Diffie-Hellman-Schlüsselaustausch.

source: detail web tls fs-params verdict na
de: Dieser Untertest ist nicht anwendbar, da dein Webserver den Diffie-Hellman-Schlüsselaustausch *nicht* unterstützt. Beachte, dass RSA eine Alternative für den Schlüsselaustausch ist, aber den Status *phase out* hat.

source: detail web tls fs-params verdict phase-out
de: Dein Webserver unterstützt Parameter für den Diffie-Hellman-Schlüsselaustausch, die einen *Phase-out*-Status haben, weil sie bekanntermaßen anfällig sind und das Risiko besteht, dass sie *unzureichend* sicher werden.

source: detail web tls http-compression exp
de: Wir testen, ob dein Webserver HTTP-Kompression unterstützt. HTTP-Kompression macht die sichere Verbindung mit deinem Webserver anfällig für den BREACH-Angriff. Die HTTP-Komprimierung wird jedoch häufig verwendet, um die verfügbare Bandbreite effizienter zu nutzen. Bedenke die Kompromisse, die mit der HTTP-Komprimierung verbunden sind. Wenn du dich für die HTTP-Komprimierung entscheidest, überprüfe, ob es möglich ist, die damit verbundenen Angriffe auf der Anwendungsebene zu entschärfen. Ein Beispiel für eine solche Maßnahme ist die Begrenzung des Ausmaßes, in dem ein Angreifer die Antwort eines Servers beeinflussen kann. Dieser Subtest prüft, ob der Webserver auf der Ebene des Stammverzeichnisses die HTTP-Kompression unterstützt. Er prüft jedoch keine zusätzlichen Website-Quellen wie Bilder und Skripte. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Leitfaden B7-1 und Tabelle 11. *Anforderungsstufe: Optional* --- **Komprimierungsoption** * Gut: Keine Kompression * Ausreichend: Kompression auf Anwendungsebene (in diesem Fall HTTP-Kompression) * Unzureichend: TLS-Kompression

source: detail web tls http-compression label
de: HTTP-Komprimierung

source: detail web tls http-compression tech table
de: Webserver IP-Adresse|HTTP-Kompression

source: detail web tls http-compression verdict bad
de: Dein Webserver unterstützt HTTP-Komprimierung, was ein Sicherheitsrisiko darstellen könnte.

source: detail web tls http-compression verdict good
de: Dein Webserver unterstützt keine HTTP-Komprimierung.

source: detail web tls https-exists exp
de: Wir prüfen, ob deine Website über HTTPS erreichbar ist. Wenn ja, prüfen wir in den folgenden Untertests auch, ob HTTPS ausreichend sicher gemäß den ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL konfiguriert ist. HTTPS garantiert die Vertraulichkeit und Integrität der ausgetauschten Informationen. Da es von der Situation abhängt, wie (datenschutz-)sensibel und wertvoll die Informationen sind, ist eine sichere HTTPS-Konfiguration für jede Website wichtig. Selbst triviale, öffentliche Informationen können für einen Nutzer äußerst sensibel und wertvoll sein. Hinweis: Aus Leistungsgründen werden die Tests im Abschnitt HTTPS-Test nur für die erste verfügbare IPv6- und IPv4-Adresse durchgeführt.

source: detail web tls https-exists label
de: HTTPS verfügbar

source: detail web tls https-exists tech table
de: Web server IP address|HTTPS exists

source: detail web tls https-exists verdict bad
de: Deine Website bietet *kein* HTTPS an.

source: detail web tls https-exists verdict good
de: Deine Website bietet HTTPS an.

source: detail web tls https-exists verdict other
de: Dein Webserver ist unerreichbar.

source: detail web tls https-forced exp
de: Wir prüfen, ob dein Webserver Besucher automatisch von HTTP zu HTTPS auf derselben Domain umleitet (durch einen 3xx Redirect-Statuscode wie 301 und 302), oder ob er nur HTTPS und nicht HTTP unterstützt. Im Falle einer Weiterleitung sollte eine Domain zuerst sich selbst durch eine Weiterleitung auf ihre HTTPS-Version aktualisieren, bevor sie auf eine andere Domain weiterleiten kann. Dadurch wird auch sichergestellt, dass die HSTS-Richtlinie vom Webbrowser akzeptiert wird. Beispiele für die richtige Umleitungsreihenfolge: * `http://example.nl` ⇒ `https://example.nl` ⇒ `https://www.example.nl` * `http://www.example.nl` ⇒ `https://www.example.nl` Beachte, dass dieser Subtest nur testet, ob die angegebene Domain korrekt von HTTP auf HTTPS umgeleitet wird. Eine eventuelle weitere Umleitung zu einer anderen Domain (einschließlich einer Subdomain der getesteten Domain) wird nicht getestet. Du könntest einen separaten Test starten, um eine solche Domain zu testen, auf die umgeleitet wird. Siehe ['Web Application Guidelines, detailed version'](https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties) von NCSC-NL, Leitfaden U/WA.05 (auf Niederländisch).

source: detail web tls https-forced label
de: HTTPS-Umleitung

source: detail web tls https-forced tech table
de: Webserver IP-Adresse|HTTPS-Umleitung

source: detail web tls https-forced verdict bad
de: Dein Webserver unterstützt zwar sowohl HTTP als auch HTTPS, leitet aber *nicht* automatisch Besucher von HTTP auf HTTPS auf derselben Domain um.

source: detail web tls https-forced verdict good
de: Dein Webserver leitet Besucher automatisch von HTTP zu HTTPS auf derselben Domain um.

source: detail web tls https-forced verdict no-https
de: Dieser Test konnte nicht durchgeführt werden, weil dein Webserver entweder kein HTTPS oder HTTPS mit einer sehr veralteten, unsicheren TLS-Konfiguration anbietet.

source: detail web tls https-forced verdict other
de: Dein Webserver bietet nur Unterstützung für HTTPS und nicht für HTTP.
