Repository: dreistromland/internet-standards.com
Catalog: translations/*/main.po
Languages: de

source: detail mail rpki mx-ns-valid verdict invalid
de: Mindestens eine IP-Adresse der Nameserver deiner empfangenden Mailserver hat einen "ungültigen" Validierungsstatus. Die Routenankündigung der betroffenen IP-Adressen stimmt *nicht* mit der veröffentlichten RPKI Route Origin Authorisation (ROA) überein. Dies deutet auf einen unbeabsichtigten oder böswilligen Fehler in der Routenkonfiguration hin, der von deinem Mail-Hoster (interner Fehler) oder von einem Dritten (externer Fehler) verursacht werden kann. In beiden Fällen kann er zur Nichterreichbarkeit deines Servers oder zum Abfangen des Internetverkehrs zu deinem Server führen. Kontaktiere deinen Mail-Hoster so schnell wie möglich. Im Falle eines internen Fehlers sollte dein Mail-Hoster seinen Netzwerkanbieter, dem die IP-Adressen deines Servers gehören, bitten, den Fehler in der Routenkonfiguration zu beheben.

source: detail mail rpki mx-ns-valid verdict not-routed
de: Dieser Subtest ist *nicht* gelaufen, weil *keine* Routenankündigung für eine der IP-Adressen verfügbar war.

source: detail mail rpki valid exp
de: Wir prüfen, ob der Validierungsstatus für alle IP-Adressen deiner Mailserver (MX) `Valid` ist. Wenn es mehrere sich überschneidende Routenankündigungen für die IP-Adresse gibt, prüfen wir, ob sie alle "gültig" sind. Dein Hoster (oder sein Netzwerkprovider) kündigt über das Border Gateway Protocol (BGP) an, für welche seiner IP-Adressblöcke er eingehenden Internetverkehr annimmt. Er tut dies, indem er (Teile) seiner IP-Adressblöcke (Route Prefix) mit der eindeutigen Nummer seines Providernetzes (Route Origin ASN) verknüpft und dann diese Routing-Informationen weitergibt. Andere Netzbetreiber nutzen diese Routenankündigungen, um zu bestimmen, über welche Route sie den Verkehr für die IP-Adressen senden sollen. Zusätzlich sollte dein Hoster (oder sein Netzwerkanbieter) für jede Routenankündigung eine digital signierte Erklärung mit einer Routenautorisierung (Route Origin Authorisation; abgekürzt: ROA) unter Verwendung der Resource Public Key Infrastructure (RPKI) veröffentlichen. Ein anderer Netzwerkanbieter, der gebeten wird, Internetverkehr an die IP-Adresse deines Servers zu senden, kann die zugehörige Erklärung kryptografisch verifizieren. Der verifizierte Inhalt (Validated ROA Payload; abgekürzt: VRP) enthält, welche Provider-Netzwerke (VRP ASN) für jeden aufgezeichneten IP-Adressblock (VRP-Präfix) zum Empfang von Internetverkehr berechtigt sind. Der Netzbetreiber kann diesen Inhalt dann nutzen, um BGP-Routen zu filtern. So kann er z.B. alle "ungültigen" Routen zurückweisen, um zu verhindern, dass Internetverkehr aus seinem Netz an nicht autorisierte Providernetze gesendet wird. Die Überprüfung von Routenankündigungen gegen Routenautorisierungen (RPKI Origin Validation; abgekürzt: ROV) hat die folgenden drei möglichen Ergebnisse. - `Gültig`: Die Routenankündigung der betreffenden IP-Adresse wird mit mindestens einer veröffentlichten Routengenehmigung abgeglichen. Eine Routenzulassung wird auch für spezifischere Routenankündigungen (d.h. für einen Teil des in der Routenzulassung enthaltenen IP-Adressblocks) abgeglichen, es sei denn, sie sind spezifischer als die in der Routenzulassung (über das Attribut `maxLength`) angegebene Grenze. - Ungültig": Die Routenankündigung der betreffenden IP-Adresse ist durch eine Routengenehmigung abgedeckt, aber sie stimmt *nicht* überein. Es gibt zwei mögliche Ursachen: 1. Der IP-Adressblock (Route Prefix) wird von einem Providernetzwerk (Route Origin ASN) angekündigt, das in der Routengenehmigung *nicht* zugelassen ist (Ergebnis in der Tabelle unten: "ungültig (as)"); 2. der angekündigte IP-Adressblock (Route Prefix) ist *kleiner als in der Routenzulassung erlaubt*, d.h. er überschreitet den Wert `maxLength` (Ergebnis in der Tabelle unten: "ungültig (Länge)"). - `NotFound`: Es wurde keine Anweisung mit einer Routenautorisierung gefunden, die die Routenankündigung der betreffenden IP-Adresse abdeckt. Dadurch wird das Routing des Internetverkehrs zu deinem Server unsicherer. Bitte kontaktiere deinen Hoster diesbezüglich. Er kann seinen Netzwerkprovider, dem die IP-Adressen deines Servers gehören, bitten, Routenautorisierungen zu veröffentlichen. **Was ist zu tun, wenn das Testergebnis den Status Ungültig anzeigt?** Der Status "Ungültig" weist auf einen unbeabsichtigten oder böswilligen Fehler in der Routenkonfiguration hin, der von deinem Hoster oder seinem Netzwerkanbieter (interner Fehler) oder von einem Dritten (externer Fehler) verursacht werden kann. In jedem Fall kann er dazu führen, dass dein Server nicht erreichbar ist oder der Internetverkehr zu deinem Server abgefangen wird. Kontaktiere deinen Hoster so schnell wie möglich. Im Falle eines internen Fehlers sollte dein Hoster seinen Netzwerkanbieter, dem die IP-Adressen deines Servers gehören, bitten, den Fehler in der Routenkonfiguration zu beheben. *Anforderungsstufe: Empfohlen*

source: detail mail rpki valid label
de: Gültigkeit der Routenansage

source: detail mail rpki valid tech table
de: Mail-Server|BGP-Routen-Präfix|BGP-Routen-Ursprungs-ASN|RPKI-Ursprungs-Validierungsstatus

source: detail mail rpki valid verdict bad
de: Mindestens eine IP-Adresse deiner empfangenden Mailserver hat den Validierungsstatus `NotFound`. Es gibt *keine* RPKI Route Origin Authorization (ROA), die für die Routenankündigung jeder der betroffenen IP-Adressen veröffentlicht wurde.

source: detail mail rpki valid verdict good
de: Alle IP-Adressen deiner empfangenden Mailserver haben den Validierungsstatus `Gültig`. Die Routenankündigung dieser IP-Adressen wird mit der veröffentlichten RPKI Route Origin Authorisation (ROA) abgeglichen.

source: detail mail rpki valid verdict invalid
de: Mindestens eine IP-Adresse deiner empfangenden Mailserver hat einen "ungültigen" Validierungsstatus. Die Routenankündigung der betroffenen IP-Adressen stimmt *nicht* mit der veröffentlichten RPKI Route Origin Authorisation (ROA) überein. Dies deutet auf einen unbeabsichtigten oder böswilligen Fehler in der Routenkonfiguration hin, der von deinem Mail-Hoster (interner Fehler) oder von einem Dritten (externer Fehler) verursacht werden kann. In beiden Fällen kann er zur Nichterreichbarkeit deines Servers oder zum Abfangen des Internetverkehrs zu deinem Server führen. Kontaktiere deinen Mail-Hoster so schnell wie möglich. Im Falle eines internen Fehlers sollte dein Mail-Hoster seinen Netzwerkanbieter, dem die IP-Adressen deines Servers gehören, bitten, den Fehler in der Routenkonfiguration zu beheben.

source: detail mail rpki valid verdict not-routed
de: Dieser Subtest ist *nicht* gelaufen, weil *keine* Routenankündigung für eine der IP-Adressen verfügbar war.

source: detail mail tls cert-hostmatch exp
de: Wir prüfen, ob der Domainname jedes deiner empfangenden Mailserver (MX) mit dem Domainnamen auf den vorgelegten Zertifikaten übereinstimmt. Versendende Mailserver ignorieren normalerweise die Domäne im Zertifikat. Ohne DNSSEC ist die Suche nach der Domäne des Mailservers anfällig für Manipulationen. Der Abgleich der Domäne auf dem Zertifikat mit der Domäne des Mailservers bringt also keinen zusätzlichen Authentizitätswert. Nicht wenige empfangende Mailserver verwenden daher selbstsignierte Zertifikate, die oft von einer internen (privaten) Zertifizierungsstelle ausgestellt werden. Für die Authentizität sollte ein Mailserver DNSSEC und DANE verwenden. Ein Zertifikat mit einer Domäne, die mit der Domäne des Mailservers übereinstimmt, ist nur erforderlich, wenn DANE "trust anchor assertion" (DANE-TA, 2) verwendet wird. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B3-1 (in Englisch). *Anforderungsstufe: Optional / Erforderlich (nur wenn DANE-TA verwendet wird)*

source: detail mail tls cert-hostmatch label
de: Domänenname auf dem Zertifikat

source: detail mail tls cert-hostmatch tech table
de: Mailserver (MX)|Unübereinstimmende Domänen im Zertifikat

source: detail mail tls cert-hostmatch verdict bad
de: Der Domänenname von mindestens einem deiner Mailserver stimmt *nicht* mit dem Domänennamen auf dem Mailserver-Zertifikat überein.

source: detail mail tls cert-hostmatch verdict good
de: Die Domänennamen aller deiner Mailserver stimmen mit den Domänennamen auf deinen Mailserver-Zertifikaten überein.

source: detail mail tls cert-pubkey exp
de: Wir prüfen, ob die digitale Signatur (ECDSA oder RSA) jedes deiner Mailserver-Zertifikate sichere Parameter verwendet. Bei der Überprüfung von Zertifikaten werden digitale Signaturen verwendet. Um die Authentizität einer Verbindung zu garantieren, muss ein vertrauenswürdiger Algorithmus für die Zertifikatsprüfung verwendet werden. Der Algorithmus, der zum Signieren eines Zertifikats verwendet wird, wird von seinem Anbieter ausgewählt. Das Zertifikat gibt den Algorithmus für digitale Signaturen an, der von seinem Inhaber beim Schlüsselaustausch verwendet wird. Es ist möglich, mehrere Zertifikate zu konfigurieren, um mehr als einen Algorithmus zu unterstützen. Die Sicherheit von ECDSA digitalen Signaturen hängt von der gewählten Kurve ab. Die Sicherheit von RSA für Verschlüsselung und digitale Signaturen ist an die Schlüssellänge des öffentlichen Schlüssels gebunden. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B5-1 und Tabelle 9 für ECDSA, und Richtlinie B3-3 und Tabelle 8 für RSA (in Englisch). --- **Elliptische Kurven für ECDSA** * Gut: `secp384r1`, `secp256r1`, `x448`, und `x25519` * Auslaufen: `secp224r1` * Unzureichend: Andere Kurven **Länge der RSA-Schlüssel** * Gut: Mindestens 3072 Bit * Ausreichend: 2048 - 3071 bit * Ungenügend: Weniger als 2048 Bit

source: detail mail tls cert-pubkey label
de: Öffentlicher Schlüssel des Zertifikats

source: detail mail tls cert-pubkey tech table
de: Mail-Server (MX)|Betroffene Signaturparameter|Status

source: detail mail tls cert-pubkey verdict bad
de: Die digitale Signatur von mindestens einem deiner Mailserver-Zertifikate verwendet *unzureichend* sichere Parameter.

source: detail mail tls cert-pubkey verdict good
de: Die digitalen Signaturen aller Zertifikate deines Mailservers verwenden sichere Parameter.

source: detail mail tls cert-pubkey verdict phase-out
de: Die digitale Signatur von mindestens einem deiner Mailserver-Zertifikate verwendet Parameter, die einen *Phase-out*-Status haben, weil sie bekanntermaßen anfällig sind und Gefahr laufen, *unzureichend* sicher zu werden.

source: detail mail tls cert-signature exp
de: Wir prüfen, ob der signierte Fingerabdruck jedes deiner Mailserver-Zertifikate mit einem sicheren Hashing-Algorithmus erstellt wurde. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B3-2 und Tabelle 3 (auf Englisch). --- **Hash-Funktionen für die Zertifikatsüberprüfung** * Gut: SHA-512, SHA-384, SHA-256 * Unzureichend: SHA-1, MD5

source: detail mail tls cert-signature label
de: Unterschrift der Bescheinigung

source: detail mail tls cert-signature tech table
de: Mail-Server (MX)|Betroffener Hash-Algorithmus|Status

source: detail mail tls cert-signature verdict bad
de: Mindestens eines deiner Mailserver-Zertifikate ist mit einem Hash-Algorithmus signiert, der *unzureichend* sicher ist.

source: detail mail tls cert-signature verdict good
de: Alle Zertifikate deiner Mailserver werden mit einem sicheren Hash-Algorithmus signiert.

source: detail mail tls cert-trust exp
de: Wir prüfen, ob wir eine gültige Vertrauenskette für deine Mailserver-Zertifikate aufbauen können. Für eine gültige Vertrauenskette muss dein Zertifikat von einer [öffentlich vertrauenswürdigen Zertifizierungsstelle](https://www.mozilla.org/en-US/about/governance/policies/security-group/certs/) veröffentlicht werden, und dein empfangender Mailserver muss alle erforderlichen Zwischenzertifikate vorlegen. Versendende Mailserver ignorieren normalerweise, ob ein Mailserver-Zertifikat von einer öffentlich vertrauenswürdigen Zertifizierungsstelle ausgestellt wurde. Ohne DNSSEC ist die Suche nach der Domäne des Mailservers anfällig für Manipulationen. Daher kann ein Zertifikat, das von einer öffentlich vertrauenswürdigen Zertifizierungsstelle ausgestellt wurde, keinen Authentizitätswert hinzufügen. Nicht wenige empfangende Mailserver verwenden daher selbstsignierte Zertifikate, die oft von einer internen (privaten) Zertifizierungsstelle ausgestellt werden. Für die Authentizität sollte ein Mailserver DNSSEC und DANE verwenden. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B3-4 (auf Englisch). *Anforderungsstufe: Optional*

source: detail mail tls cert-trust label
de: Vertrauenskette des Zertifikats

source: detail mail tls cert-trust tech table
de: Mail-Server (MX)|Untrusted-Zertifikatskette

source: detail mail tls cert-trust verdict bad
de: Die Vertrauenskette von mindestens einem deiner Mailserver-Zertifikate ist *nicht* vollständig vollständig und/oder *nicht* von einer vertrauenswürdigen Stammzertifizierungsstelle unterzeichnet.

source: detail mail tls cert-trust verdict good
de: Die Vertrauenskette aller Zertifikate deines Mailservers ist vollständig und signiert von einer vertrauenswürdigen Stammzertifizierungsstelle.

source: detail mail tls cipher-order exp
de: Wir prüfen, ob deine empfangenden Mailserver (MX) ihre eigene Chiffrepräferenz durchsetzen ("I") und Chiffren gemäß der vorgeschriebenen Reihenfolge anbieten ("II"). Wenn deine Mailserver nur "gute" Chiffren unterstützen, ist dieser Test nicht anwendbar, da die Reihenfolge keinen wesentlichen Sicherheitsvorteil bietet. I. *Server erzwungene Chiffrierpräferenz*: Die empfangenden Mailserver setzen ihre eigene Chiffrierpräferenz durch, während sie mit den sendenden Mailservern verhandeln, und akzeptieren keine Präferenz der sendenden Mailserver; II. *Vorgeschriebene Reihenfolge*: Die Chiffren werden von den empfangenden Mailservern in der vorgeschriebenen Reihenfolge angeboten, wobei "gute" Chiffren gegenüber "ausreichenden" gegenüber "auslaufenden" Chiffren bevorzugt werden. In der obigen Tabelle mit technischen Details sind **nur die zuerst gefundenen Algorithmen aus der vorgeschriebenen Reihenfolge** aufgeführt. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Leitfaden B2-5.

source: detail mail tls cipher-order label
de: Chiffrierauftrag

source: detail mail tls cipher-order tech table
de: Mailserver (MX)|Erstes gefundenes betroffenes Chiffrierpaar|Verstoßene Regel # ('II-B')

source: detail mail tls cipher-order verdict bad
de: Mindestens einer deiner Mailserver erzwingt *nicht* seine eigene Verschlüsselungspräferenz ("I").

source: detail mail tls cipher-order verdict good
de: Alle deine Mailserver setzen ihre eigene Verschlüsselungspräferenz durch ("I") und bieten Verschlüsselungen gemäß der vorgeschriebenen Reihenfolge an ("II").

source: detail mail tls cipher-order verdict na
de: Dieser Untertest ist nicht anwendbar, da dein Mailserver nur "gute" Verschlüsselungen unterstützt.

source: detail mail tls cipher-order verdict seclevel-bad
de: Mindestens einer deiner Mailserver bevorzugt *nicht* "Gute" gegenüber "Ausreichende" gegenüber "Auslaufende" Chiffren ("II").

source: detail mail tls cipher-order verdict warning
de: VERALTETER TEXT; URTEIL NICHT VERWENDET Mindestens einer deiner Mailserver bietet *keine* Verschlüsselungen gemäß der vorgeschriebenen Reihenfolge innerhalb einer bestimmten Sicherheitsstufe ("II-B") an.

source: detail mail tls ciphers exp
de: Wir prüfen, ob deine empfangenden Mailserver (MX) nur sichere, d. h. "gute" und/oder "ausreichende" Verschlüsselungen unterstützen (auch bekannt als Algorithmusauswahl). Um zu verhindern, dass wir an die Ratenbeschränkungen der empfangenden Mailserver stoßen, enthält das Testergebnis nur die **erste gefundene betroffene Algorithmus-Auswahl**. Eine Algorithmusauswahl besteht aus Chiffren für vier kryptografische Funktionen: 1) Schlüsselaustausch, 2) Zertifikatsüberprüfung, 3) Massenverschlüsselung und 4) Hashing. Ein Webserver kann mehr als eine Algorithmusauswahl unterstützen. * Seit TLS 1.3 umfasst der Begriff "Cipher Suite" nur noch die Chiffren für die Massenverschlüsselung und das Hashing. Bei der Verwendung von TLS 1.3 sind die Chiffren für den Schlüsselaustausch und die Zertifikatsüberprüfung verhandelbar und nicht Teil der Benennung der Cipher Suite. Da dies den Begriff "Cipher Suite" mehrdeutig macht, verwendet das NCSC-NL den Begriff "Algorithmusauswahl", um alle vier Cipher-Funktionen zusammenzufassen. * Die NCSC-NL verwendet die [IANA-Namenskonvention] (https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml#tls-parameters-4) für die Algorithmusauswahl. Internet.nl verwendet die [OpenSSL-Namenskonvention](https://www.openssl.org/docs/manmaster/man1/openssl-ciphers.html#CIPHER-SUITE-NAMES). Seit TLS 1.3 folgt OpenSSL der IANA-Benennungskonvention. Eine Übersetzung zwischen beiden findet sich in der OpenSSL-Dokumentation. * Beachte, dass Chiffren, die PSK oder SRP für den Schlüsselaustausch verwenden (die nicht ausreichend sicher sind), in diesem Test aufgrund einer Einschränkung unserer Testmethode nicht erkannt werden. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B2-1 bis B2-4 und Tabelle 2, 4, 6 und 7 (in Englisch). --- Im Folgenden findest du die Auswahl der Algorithmen "Gut", "Ausreichend" und "Auslaufend" in der von der NCSC-NL vorgeschriebenen Reihenfolge, basierend auf Anhang C der "IT Security Guidelines for Transport Layer Security (TLS)". Hinter jeder Algorithmus-Auswahl steht die minimale TLS-Version (z.B. [1.2]), die diese Algorithmus-Auswahl unterstützt und die mindestens "Phase out" ist. Gut: * `ECDHE-ECDSA-AES256-GCM-SHA384` (`TLS_AES_256_GCM_SHA384` in 1.3) [1.2] * `ECDHE-ECDSA-CHACHA20-POLY1305` (`TLS_CHACHA20_POLY1305_SHA256` in 1.3) [1.2] * `ECDHE-ECDSA-AES128-GCM-SHA256` (`TLS_AES_128_GCM_SHA256` in 1.3) [1.2] * `ECDHE-RSA-AES256-GCM-SHA384` (`TLS_AES_256_GCM_SHA384` in 1.3) [1.2] * `ECDHE-RSA-CHACHA20-POLY1305` (`TLS_CHACHA20_POLY1305_SHA256` in 1.3) [1.2] * `ECDHE-RSA-AES128-GCM-SHA256` (`TLS_AES_128_GCM_SHA256` in 1.3) [1.2] Ausreichend: * `ECDHE-ECDSA-AES256-SHA384` [1.2] * `ECDHE-ECDSA-AES256-SHA` [1.0] * `ECDHE-ECDSA-AES128-SHA256` [1.2] * `ECDHE-ECDSA-AES128-SHA` [1.0] * `ECDHE-RSA-AES256-SHA384` [1.2] * `ECDHE-RSA-AES256-SHA` [1.0] * `ECDHE-RSA-AES128-SHA256` [1.2] * `ECDHE-RSA-AES128-SHA` [1.0] * `DHE-RSA-AES256-GCM-SHA384` [1.2] * `DHE-RSA-CHACHA20-POLY1305` [1.2] * `DHE-RSA-AES128-GCM-SHA256` [1.2] * `DHE-RSA-AES256-SHA256` [1.2] * `DHE-RSA-AES256-SHA` [1.0] * `DHE-RSA-AES128-SHA256` [1.2] * `DHE-RSA-AES128-SHA` [1.0] Auslaufen: * `ECDHE-ECDSA-DES-CBC3-SHA` [1.0] * `ECDHE-RSA-DES-CBC3-SHA` [1.0] * "DHE-RSA-DES-CBC3-SHA" [1.0] * `AES256-GCM-SHA384` [1.2] * `AES128-GCM-SHA256` [1.2] * `AES256-SHA256` [1.2] * `AES256-SHA` [1.0] * `AES128-SHA256` [1.2] * `AES128-SHA` [1.0] * `DES-CBC3-SHA` [1.0]

source: detail mail tls ciphers label
de: Chiffren (Algorithmus-Auswahlen)

source: detail mail tls ciphers tech table
de: Mailserver (MX)|Erster gefundener betroffener Cipher|Status

source: detail mail tls ciphers verdict bad
de: Mindestens einer deiner Mailserver unterstützt eine oder mehrere *unzureichend* sichere Verschlüsselungen.

source: detail mail tls ciphers verdict good
de: Alle deine Mailserver unterstützen nur sichere Verschlüsselungen.

source: detail mail tls ciphers verdict phase-out
de: Mindestens einer deiner Mailserver unterstützt eine oder mehrere Verschlüsselungen, die einen *Phase out* Status haben, weil sie als anfällig gelten und Gefahr laufen, *unzureichend* sicher zu werden.

source: detail mail tls compression exp
de: Wir prüfen, ob deine empfangenden Mailserver (MX) TLS-Kompression unterstützen. Die Verwendung von Komprimierung kann einem Angreifer Informationen über die geheimen Teile der verschlüsselten Kommunikation liefern. Ein Angreifer, der Teile der gesendeten Daten ermitteln oder kontrollieren kann, kann die ursprünglichen Daten rekonstruieren, indem er eine große Anzahl von Anfragen durchführt. Die TLS-Komprimierung wird so selten verwendet, dass es in der Regel kein Problem ist, sie zu deaktivieren. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B7-1 und Tabelle 11 (auf Englisch). --- **Komprimierungsoption** * Gut: Keine Kompression * Ausreichend: Komprimierung auf Anwendungsebene * Unzureichend: TLS-Kompression

source: detail mail tls compression label
de: TLS-Komprimierung

source: detail mail tls compression tech table
de: Mail-Server (MX)| TLS-Kompression

source: detail mail tls compression verdict bad
de: Mindestens einer deiner Mailserver unterstützt TLS-Komprimierung, was *nicht* sicher ist.

source: detail mail tls compression verdict good
de: Nicht alle deine Mailserver unterstützen TLS-Kompression.

source: detail mail tls dane-exists exp
de: Wir prüfen, ob die Nameserver jedes deiner empfangenden Mailserver (MX) einen TLSA-Eintrag für DANE bereitstellen. Da DNSSEC eine Voraussetzung für DANE ist, schlägt dieser Test fehl, wenn DNSSEC auf der/den Mailserver-Domäne(n) nicht vorhanden ist. Beachte, dass der Test TLSA-Einträge des Typs PKIX-TA(0) oder PKIX-EE(1) ignoriert, da diese nicht für empfangende Mailserver verwendet werden sollten. Außerdem führt der Test zu einem Fehlschlag, wenn es keinen DNSSEC-Nachweis für "Denial of Existence" für TLSA-Datensätze gibt. Wenn ein signierter TLSA-Datensatz existiert, aber gleichzeitig eine unsichere "NXDOMAIN" für dieselbe Domain existiert (aufgrund einer fehlerhaften Signierersoftware), wird der Test ebenfalls fehlschlagen. Die beiden letztgenannten Fehlerszenarien können dazu führen, dass E-Mails, die von DANE-validierenden Absendern an dich gerichtet werden, nicht zugestellt werden. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Anhang A, unter 'Certificate pinning and DANE' (in Englisch).

source: detail mail tls dane-exists label
de: DANE Existenz

source: detail mail tls dane-exists tech table
de: Mailserver (MX)|DANE TLSA-Eintrag vorhanden

source: detail mail tls dane-exists verdict bad
de: Mindestens eine deiner Mailserver-Domänen bietet *keinen* TLSA-Eintrag für DANE.

source: detail mail tls dane-exists verdict bogus
de: Mindestens eine deiner Mailserver-Domänen liefert *keinen* DNSSEC-Beweis dafür, dass keine DANE TLSA-Einträge existieren. Dies kann dazu führen, dass E-Mails, die von DANE-validierenden Absendern an dich geschickt werden, nicht zugestellt werden können. Du solltest deinen Nameserver-Betreiber bitten, dieses Problem zu beheben.

source: detail mail tls dane-exists verdict good
de: Alle Domänen deines Mailservers stellen einen TLSA-Eintrag für DANE bereit.
