Repository: dreistromland/internet-standards.com
Catalog: translations/*/main.po
Languages: de

source: disclosure content
de: # Report vulnerability *Aktualisiert am 28. März 2022* Die Internet Standards Platform hält die Sicherheit der Website Internet.nl für sehr wichtig. Trotz der Sorgfalt, mit der wir die Sicherheit gewährleisten, kann es dennoch passieren, dass eine Sicherheitslücke gefunden wird. Hast du eine Sicherheitslücke auf der Internet.nl-Website gefunden? Vielleicht bist du beim normalen Betrieb dieser Website zufällig auf eine gestoßen, oder vielleicht du hast aktiv versucht, eine Sicherheitslücke zu finden. In jedem Fall solltest du lass es uns wissen, damit wir so schnell wie möglich Maßnahmen ergreifen können. Dies ist übrigens **keine** Aufforderung, unsere Website ausgiebig zu scannen und zu testen. Seite auf Schwachstellen zu prüfen. Das machen wir schon selbst. Wir würden gerne mit dir zusammenarbeiten, um die Sicherheit unserer Website weiter zu verbessern. Wir werden deine Meldungen immer ernst nehmen, wenn sie mit unserer Richtlinie zur koordinierten Offenlegung von Schwachstellen übereinstimmen und werden alle vermuteten Schwachstellen untersuchen. In unserer folgenden Richtlinie zur **Koordinierten Offenlegung von Sicherheitslücken** erklären wir, was wir von dir verlangen und was wir versprechen, wenn du uns eine Sicherheitslücke meldest. ## Wir bitten dich um Folgendes: - deine Erkenntnisse so schnell wie möglich per [E-Mail] (mailto:question@internet.nl) oder über ein [GitHub security advisory] (https://github.com/internetstandards/Internet.nl/security/advisories/new) an uns zu senden; - Wenn du eine E-Mail schickst, verschlüssele sie vorzugsweise mit unserem PGP-Schlüssel; - gib ausreichend Informationen an, um das Problem zu reproduzieren, damit wir es so schnell wie möglich beheben können. Damit wir das Problem so schnell wie möglich beheben können, reicht es in der Regel aus, die IP-Adresse oder die URL zusammen mit einer Beschreibung der Schwachstelle, aber für komplexere Schwachstellen benötigen wir benötigen wir möglicherweise mehr Informationen; - keine Tests durchführen, die Angriffe über physische Sicherheit, Social Engineering oder Anwendungen Dritter angreifen; - keine Brute-Force- oder Denial-of-Service-Angriffe durchführen; - die Schwachstelle nicht ausnutzen, um z. B. Daten zu ändern oder zu löschen oder Malware zu installieren; - das Problem nicht mit anderen teilen, bis wir es behoben haben; - keine Daten von unseren Systemen zu kopieren, es sei denn, es ist absolut notwendig um das Leck zu demonstrieren; - hinterlasse deine Kontaktdaten (E-Mail-Adresse und Telefonnummer), damit wir uns mit dir in Verbindung setzen damit wir uns mit dir in Verbindung setzen können, um das Problem zu beheben. ## Wir versprechen: - innerhalb von drei Werktagen auf deine Meldung zu antworten, mit einer mit einer Bewertung deines Berichts und einem voraussichtlichen Termin für eine Lösung; - deine Meldung vertraulich zu behandeln: Wir werden deine persönlichen Daten nicht Informationen ohne deine Zustimmung weitergeben, außer an die Polizei und die Justiz, wenn ein Polizeibericht erstellt wird oder wenn diese Informationen gesetzlich vorgeschrieben sind; - um dich über unsere Fortschritte bei der Lösung des Problems auf dem Laufenden zu halten; - deinen Namen als Entdecker der Schwachstelle in den Nachrichten zu nennen Berichten zu nennen, wenn du das wünschst; - dass die zufällige Entdeckung einer Sicherheitslücke nicht zu rechtlichen dass die zufällige Entdeckung einer Schwachstelle nicht zu rechtlichen Schritten gegen dich führt, solange du dich an die Regeln hältst und im Sinne des Geist der Coordinated Vulnerability Disclosure handelst; - als Zeichen unserer Dankbarkeit schenken wir dir ein T-Shirt für jede Meldung von Wir wissen, dass dies keine große Belohnung ist, aber wir wollen Wir wissen, dass das keine große Belohnung ist, aber wir wollen nicht dazu anregen, aktiv nach Schwachstellen zu suchen. ## Ausschlüsse: Da unsere Zeit knapp bemessen ist, bitten wir dich: **keine** trivialen Funde zu melden, für die es keine bekannten Schwachstellen gibt und/oder die kein echtes Risiko darstellen; **nicht** blind Befunde von automatischen Schwachstellen-Scannern zu melden. Kopiere die Ergebnisse nicht in eine E-Mail, sondern nimm dir zunächst etwas Zeit, um die Natur unserer Website zu verstehen, bevor du etwas meldest; * dir bewusst zu machen, dass unsere Tools Open Source sind und zur Wiederverwendung zur Verfügung stehen. Wir **können** nicht für Implementierungen durch andere verantwortlich gemacht werden. Im Folgenden findest du einige Beispiele für Ergebnisse, die du **nicht** melden solltest. Wenn du es doch tust, sei dir bitte bewusst, dass wir diese Meldungen **nicht** belohnen und möglicherweise **nicht** auf deine E-Mail antworten. - Schwachstellen, die andere Domains als internet.nl betreffen; - Offenlegung von Header-Informationen; - SSRF-Schwachstelle (dies ist keine Schwachstelle, sondern eine beabsichtigte Funktionalität, die für das ordnungsgemäße Funktionieren von Internet.nl notwendig ist); - Öffentlich zugängliche Dateien oder Ordner mit nicht sensiblen Informationen (wie robots.txt oder Bilder); - Fehlende Standards, die nicht von Internet.nl gefördert werden (wie MTA-STS); - Vermeintliche Abweichungen, die dem von Internet.nl selbst verwendeten Teststandard entsprechen (wie bei einem bestimmten Security-Header).

source: domain pagetitle
de: Website-Test:

source: domain title
de: Website-Test: {{prettyaddr}}

source: domain tweetmessage
de: The%20website%20{{report.domain}}%20scores%20{{score}}%25%20in%20the%20website%20test%20of%20%40Internet_nl%3A

source: faqs appsecpriv content
de: ## HTTP-Sicherheits-Header ### X-Frame-Options - ["7.6 Der X-Frame-Options-Header" in HTML Living Standard](https://html.spec.whatwg.org/multipage/document-lifecycle.html#x-frame-options) - [RFC 7034: HTTP Header Feld X-Frame-Options](https://www.rfc-editor.org/rfc/rfc7034) - [X-Frame-Options, MDN Webdocs](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options) ### X-Content-Type-Options - [Blog 'IE8 Sicherheit Teil VI: Beta 2 Update'](https://blogs.msdn.microsoft.com/ie/2008/09/02/ie8-security-part-vi-beta-2-update/) - [X-Content-Type-Options, MDN webdocs](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options) ### X-XSS-Protection (veraltet) - [X-XSS-Protection-Test von Internet.nl entfernt](/article/x-xss-protection-removed-and-improvement-for-no-mx-domains/) ### Content-Security-Policy (CSP) - [Content Security Policy Level 3, W3C Working Draft](https://www.w3.org/TR/CSP3/) (In Übereinstimmung mit CSP3 betrachten wir `frame-src` *nicht* als veraltet.) - [Content Security Policy Level 2, W3C Recommendation](https://www.w3.org/TR/CSP2/) - [Content-Security-Policy, MDN Webdocs](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Content-Security-Policy) - [Mozilla's Laboratory (Content Security Policy / CSP Toolkit)](https://addons.mozilla.org/nl/firefox/addon/laboratory-by-mozilla/) ### Referrer-Policy - [Referrer Policy, W3C Candidate Recommendation, 26. Januar 2017](https://www.w3.org/TR/referrer-policy/) - [Referrer-Policy, Editor's Draft](https://w3c.github.io/webappsec-referrer-policy/) - [Referrer-Policy, MDN Webdocs](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Referrer-Policy) ## Andere Sicherheitsoptionen ### security.txt - [RFC 9116: A File Format to Aid in Security Vulnerability Disclosure](https://www.rfc-editor.org/rfc/rfc9116) - [Common Security Advisory Framework Version 2.0, "7.1.8 Requirement 8: security.txt"](https://docs.oasis-open.org/csaf/csaf/v2.0/os/csaf-v2.0-os.html#718-requirement-8-securitytxt) - [IANA-Register für security.txt-Felder](https://www.iana.org/assignments/security-txt-fields/security-txt-fields.xhtml) - [Securitytxt.org](https://securitytxt.org/) - ["Wat is security.txt?"](https://www.digitaltrustcenter.nl/securitytxt) (auf Niederländisch) von Digital Trust Center - ["Handreiking security.txt"](https://www.ncsc.nl/documenten/publicaties/2023/maart/2/handreiking-security.txt) (auf Niederländisch) von NCSC-NL

source: faqs appsecpriv title
de: Sicherheitsoptionen

source: faqs badges post-badge content
de: ### Anmerkungen 1. Wenn du die Abzeichen auf deiner Website verwenden möchtest, muss die Domain dieser Website mit der 100%-Punkte-Domain übereinstimmen. Es ist *nicht* erlaubt, die Abzeichen auf einer Website zu verwenden, die einen anderen Domainnamen hat. 2. Wenn du die Badges auf deiner Website verwendest, empfehlen wir dir, die Badges auf deinem eigenen Webserver zu speichern und zu verwenden. Auf diese Weise wird kein Kontakt mit unserem Webserver hergestellt, wenn deine Website besucht wird. Wir bitten dich, jedes verwendete Badge mit einem Hyperlink zu [https://internet.nl/](https://internet.nl/) zu versehen. ## Badge für Hoster Die Regeln für die Verwendung des *Internet.nl-konformen Abzeichens* für Hoster findest du in der [Hall of Fame für Hoster](/halloffame/hosters/).

source: faqs badges pre-badge content
de: ## Abzeichen für Domainbesitzer Wenn deine Website oder E-Mail auf Internet.nl 100% erreicht, wird deine Domain in die entsprechende [Hall of Fame](/halloffame/) aufgenommen. In diesem Fall darfst du die entsprechenden 100%-Badges in deiner Kommunikation verwenden, solange du deine 100%-Bewertung beibehältst.

source: faqs badges title
de: Verwendung der 100%-Plaketten

source: faqs content
de: ## Tests * [Über den Website-Test](/test-site/) * [Über den E-Mail-Test](/test-mail/) * [Über den Verbindungstest](/test-connection/) ## Standards * [Moderne Adresse (IPv6)](/faqs/ipv6/) * [Domänensignatur (DNSSEC)](/faqs/dnssec/) * [Sichere Website-Verbindung (HTTPS)](/faqs/https/) * [Sicherheitsoptionen (HTTP-Sicherheitsheader und security.txt)](/faqs/appsecpriv/) * [Schutz vor E-Mail-Phishing (DMARC, DKIM und SPF)](/faqs/mailauth/) * [Sicherer E-Mail-Transport (STARTTLS und DANE)](/faqs/starttls/) * [Autorisierung für die Weiterleitung (RPKI)](/faqs/rpki/) ## Testbericht, Abzeichen und Ruhmeshalle * [Erläuterung des Testberichts](/faqs/report/) * [Verwendung der 100%-Plaketten](/faqs/badges/) * [Kriterien für die 'Ruhmeshalle für Hoster'](/faqs/halloffame/)

source: faqs dnssec content
de: ## Warum Im Folgenden findest du einige Links zu Beschreibungen einiger bekannter Vorfälle, die DNSSEC wahrscheinlich hätte verhindern können. * ["Cache-Poisoning-Angriff erwischt brasilianische Großbank"](https://www.theregister.co.uk/2009/04/22/bandesco_cache_poisoning_attack/) * ["Eircom deckt 'Cache Poisoning'-Angriff durch Hacker führte zu Ausfällen"](https://www.siliconrepublic.com/enterprise/eircom-reveals-cache-poisoning-attack-by-hacker-led-to-outages) * ["DNS-Cache-Vergiftung führt zu Malware-Angriffen auf Brasilianer"](https://www.theregister.co.uk/2011/11/07/brazilian_dns_cache_poisoing_attacks/) * ["Wahrscheinliches Cache Poisoning von Mail Handling Domains"](https://www.cert.org/blogs/certcc/post.cfm?EntryID=206) * ["Neither Snow Nor Rain Nor MITM... Eine empirische Analyse der E-Mail-Zustellsicherheit"](https://dl.acm.org/citation.cfm?id=2815695) Nachfolgend ein Zitat aus der letztgenannten Forschungspublikation: > Die Sicherheit von E-Mails ist wie die vieler anderer Protokolle eng mit der Sicherheit der DNS-Auflösung verknüpft. Anstatt auf das SMTP-Protokoll abzuzielen, kann ein aktiver Netzwerkangreifer die DNS-Einträge eines Ziel-Mailservers fälschen, um SMTP-Verbindungen zu einem Server unter der Kontrolle des Angreifers umzuleiten. [...] Wir haben Beweise dafür gefunden, dass 178.439 von 8.860.639 (2,01%) öffentlich zugänglichen DNS-Servern ungültige IPs oder MX-Einträge für eine oder mehrere dieser Domains angegeben haben. ## Benutzungsstatistiken * [.nl Statistik über DNSSEC](https://stats.sidnlabs.nl/en/) von SIDN Labs * [DNSSEC Validation Measurement](https://stats.labs.apnic.net/dnssec) von APNIC * [DNSSEC Deployment Report](https://dnssec-deployment.icann.org/dctld/) ## Hintergrundinformationen * [FAQ zu DNSSEC](https://www.sidn.nl/en/modern-internet-standards/dnssec) von SIDN * [ISOC's Deploy360 on DNSSEC](https://www.internetsociety.org/deploy360/dnssec/) * [DNSSEC.net](https://www.dnssec.net/) * [Wikipedia über DNSSEC](https://en.wikipedia.org/wiki/Domain_Name_System_Security_Extensions) * [Knowledge-Sharing and Instantiating Norms for DNS and Naming Security (KINDNS)](https://kindns.org/) ## Spezifikationen * [RFC 4033: DNS Security Introduction and Requirements](https://www.rfc-editor.org/rfc/rfc4033) * [RFC 4034: Resource Records for the DNS Security Extensions](https://www.rfc-editor.org/rfc/rfc4034) * [RFC 4035: Protocol Modifications for the DNS Security Extensions](https://www.rfc-editor.org/rfc/rfc4035) * [RFC 8624: Algorithm Implementation Requirements and Usage Guidance for DNSSEC](https://www.rfc-editor.org/rfc/rfc8624) * [RFC 9276: Guidance for NSEC3 Parameter Settings](https://www.rfc-editor.org/rfc/rfc9276)

source: faqs dnssec title
de: Domain-Signatur (DNSSEC)

source: faqs halloffame content
de: ## Kriterien für die Aufnahme Ein Hoster, der in die [Hall of Fame für Hoster](/halloffame/hosters/) aufgenommen werden möchte, muss die folgenden Kriterien erfüllen. 1. **Die Domain des Hosters 2x 100%**: Der eigene Domainname des Hosters, auf dem die Unternehmenswebsite aktiv ist, erreicht sowohl im Website- als auch im E-Mail-Test auf Internet.nl 100%; 2. **Angebot von Hosting-Diensten**: Der Hoster bietet auf seiner Unternehmenswebsite ausdrücklich Hosting-Dienste für Websites und E-Mails an, ohne Einschränkung der Kundengruppe (z. B. Vereine und Verbände); 3. **Kundendomains 2x 100%**: Der Hoster bietet seinen Kunden die Möglichkeit, sowohl im Website-Test als auch im E-Mail-Test auf Internet.nl 100% zu erreichen; 4. **Handelsregister**: Der Firmenname des Hosters ist als Handelsname im Handelsregister der niederländischen Handelskammer oder in einem ähnlichen ausländischen Handelsregister aufgeführt; 5. **Nur auf Antrag**: Die Aufnahme in diese Ruhmeshalle ist freiwillig und kann vom Gastgeber per E-Mail an question@internet.nl beantragt werden. ## Andere Regeln * **Badge**: Nur Hoster, die in dieser Ruhmeshalle für Hoster aufgeführt sind, dürfen das [Internet.nl-konforme Abzeichen](/static/embed-badge-hosters-v3.svg) in ihrer eigenen Kommunikation verwenden. Wenn du die Abzeichen auf deiner Website verwenden möchtest, muss die Domain dieser Website mit dem Eintrag in der Ruhmeshalle übereinstimmen. * **Bestellung**: Die Namen der Hoster in der Ruhmeshalle werden in zufälliger Reihenfolge angezeigt. ## Automatisierte Compliance-Checks Über das [Internet.nl-Dashboard](https://dashboard.internet.nl) wird regelmäßig überprüft, ob die in der Hall of Fame für Hoster aufgeführten Hoster noch eine doppelte 100%ige Punktzahl (Mail und Web) für die eigene Domain haben. Dies ist eine automatisierte Prüfung und wird zweimal pro Monat durchgeführt. Die [Prüfberichte für die gelisteten Hoster](https://dashboard.internet.nl/#/published/103/) sind öffentlich zugänglich. ## Delisting Nicht konforme Hoster werden auf der Grundlage der folgenden Kriterien und Regeln manuell von der Liste gestrichen: * Wenn die Testergebnisse für Web oder Mail 3 aufeinanderfolgende Scans (ca. 6 Wochen) unter 100% liegen, unabhängig davon, welche Untertests nicht bestanden wurden. * Wenn wir neue (Unter-)Tests in unsere Gesamttestnote (den Prozentsatz) einfließen lassen, geben wir den Hostern in unserer Hall of Fame eine Frist von 2 Monaten (ab dem Datum der Einstufung), um die Anforderungen vollständig zu erfüllen (doppelte 100%). * Die Auslistung erfolgt für einen Zeitraum von mindestens 3 Monaten, danach muss sich der Hoster manuell neu bewerben, um wieder gelistet zu werden. * Die Kontaktperson des Gastgebers erhält eine Benachrichtigung über die Streichung von der Liste. * Vor der Streichung erfolgt keine Benachrichtigung; es liegt in der Verantwortung des Hosters, sich zu vergewissern (und zu überprüfen), ob die eigene Domain immer noch eine doppelte 100%-Bewertung (für Mail und Web) hat. Wenn es einen anderen Grund gibt, warum ein Hoster nicht in unsere Hall of Fame für Hoster aufgenommen werden sollte, sende bitte eine E-Mail mit einer angemessenen Argumentation an question@internet.nl.

source: faqs halloffame title
de: Kriterien für die "Hall of Fame für Gastgeber

source: faqs https content
de: ## Warum * [Braucht meine Website HTTPS?](https://doesmysiteneedhttps.com/) * ["Warum HTTPS für alles?"](https://https.cio.gov/everything/) von CIO.gov * ["Denkst du immer noch, du brauchst kein HTTPS?"](https://scotthelme.co.uk/still-think-you-dont-need-https/)von Scott Helme ## Benutzungsstatistiken * [.nl Statistiken zu HTTPS](https://stats.sidnlabs.nl/nl/) von SIDN Labs * ["Prozentualer Anteil der Webseiten, die von Firefox über HTTPS geladen werden"](https://letsencrypt.org/de/stats/#percent-pageloads) * ["HTTPS-Nutzung" von Google](https://www.google.com/transparencyreport/https/metrics/?hl=en) ## Hintergrundinformationen * ["IT Security Guidelines for Transport Layer Security (TLS), v2.1"](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL * ["ICT security guidelines for web applications"](https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties) von NCSC-NL (auf Niederländisch) * [Mozilla SSL Configuration Generator](https://mozilla.github.io/server-side-tls/ssl-config-generator/) * [Bettercrypto.org](https://bettercrypto.org) * [So funktioniert HTTPS](https://howhttps.works/) ## Spezifikationen * [RFC 9110: HTTP Semantics](https://www.rfc-editor.org/rfc/rfc9110) * [RFC 8446: The Transport Layer Security (TLS) Protocol Version 1.3](https://www.rfc-editor.org/rfc/rfc8446) * [RFC 5246: The Transport Layer Security (TLS) Protocol, Version 1.2](https://www.rfc-editor.org/rfc/rfc5246) * [RFC 6797: HTTP Strict Transport Security (HSTS)](https://www.rfc-editor.org/rfc/rfc6797) * [RFC 6698: The DNS-Based Authentication of Named Entities (DANE) Transport Layer Security (TLS) Protocol: TLSA](https://www.rfc-editor.org/rfc/rfc6698)

source: faqs https title
de: Sichere Website-Verbindung (HTTPS)

source: faqs ipv6 content
de: ## Warum * ["Drei Gründe, warum IPv6 die Mühe wert ist"](https://blog.apnic.net/2018/12/13/three-reasons-why-ipv6-is-worth-the-effort/) von Nick Buraglio * ["Making a Strong Case for IPv6"](https://www.baselinemag.com/networking/making-a-strong-case-for-ipv6.html) von John Curran (ARIN) * ["IPv6: Es ist Zeit, an Bord zu gehen"](https://code.facebook.com/posts/1192894270727351/ipv6-it-s-time-to-get-on-board/) von Paul Saab (Facebook) * ["Gründe für IPv6"](https://ipv6now.com.au/primers/IPv6Reasons.php) von IPv6NOW ## Benutzungsstatistiken * [.nl statistics on IPv6](https://stats.sidnlabs.nl/en/) von SIDN Labs * [APNIC IPv6-Messungen](https://stats.labs.apnic.net/ipv6/) * [World IPv6 Launch](https://www.worldipv6launch.org/measurements/) * [Akamai IPv6 Einführung](https://www.akamai.com/us/en/about/our-thinking/state-of-the-internet-report/state-of-the-internet-ipv6-adoption-visualization.jsp) * [Google IPv6-Statistiken](https://www.google.com/intl/en/ipv6/statistics.html) * [Cisco IPv6-Statistiken](https://6lab.cisco.com/stats/) * [IPv6 RIPEness Informationen](https://ipv6ripeness.ripe.net/) ## Hintergrundinformationen * [FAQ zu IPv6](https://www.sidn.nl/en/modern-internet-standards/ipv6) von SIDN * [ISOC's Deploy360 zu IPv6](https://www.internetsociety.org/deploy360/ipv6/) * [IPv6 Info Centre bei RIPE](https://www.ripe.net/publications/ipv6-info-centre/) * [Wikipedia über IPv6](https://en.wikipedia.org/wiki/IPv6) * ["Policy Issues for Receiving Email in a World with IPv6 Hosts" von M³AAWG](https://www.m3aawg.org/sites/default/files/document/M3AAWG_Inbound_IPv6_Policy_Issues-2014-09.pdf) ## Spezifikationen * [RFC 8200: Internet Protocol, Version 6 (IPv6) Specification](https://www.rfc-editor.org/rfc/rfc8200)

source: faqs ipv6 title
de: Moderne Adresse (IPv6)

source: faqs mailauth content
de: ## Warum * ["Why you should be doing DMARC"](https://governmenttechnology.blog.gov.uk/2016/10/04/why-you-should-be-doing-dmarc/) von GOV.uk * ["Warum ist DMARC wichtig?"](https://dmarc.org/wiki/FAQ#Why_is_DMARC_important.3F) von DMARC.org ## Benutzungsstatistiken * [.nl statistics on DMARC](https://stats.sidnlabs.nl/nl/mail.html) von SIDN Labs * [DMARC Adoptionsstatistiken weltweit](https://dmarc.org/stats/farsight/dmarc/) von DMARC.org ## Hintergrundinformationen * [How-to zu DMARC, DKIM und SPF](https://toolbox.internet.nl) von Dutch Internet Standards Platform * [FAQ zu E-Mail-Sicherheitsstandards](https://www.sidn.nl/en/modern-internet-standards/e-mail-security-standards) von SIDN * [DMARC.org](https://dmarc.org/), [OpenSPF.org (Archiv)](http://web.archive.org/web/20190125100326/http://www.openspf.org/), und [DKIM Core](https://dkimcore.org/) * [DKIM Key Rotation Best Common Practices](https://www.m3aawg.org/DKIMKeyRotation) von M3AAWG * [Protecting Parked Domains Best Common Practices](https://www.m3aawg.org/M3AAWG-Protecting-Parked-Domains-BCP-update-2022-06) von M3AAWG * [Email Authentication Recommended Best Practices](https://www.m3aawg.org/sites/default/files/m3aawg-email-authentication-recommended-best-practices-09-2020.pdf) von M3AAWG ## Spezifikationen * [RFC 7489: Domain-based Message Authentication, Reporting, and Conformance (DMARC)](https://www.rfc-editor.org/rfc/rfc7489) * [RFC 6376: DomainKeys Identified Mail (DKIM) Signatures](https://www.rfc-editor.org/rfc/rfc6376) * [RFC 7208: Sender Policy Framework (SPF) for Authorizing Use of Domains in Email, Version 1](https://www.rfc-editor.org/rfc/rfc7208)

source: faqs mailauth title
de: Schutz vor E-Mail-Phishing (DMARC, DKIM und SPF)
