Repository: dreistromland/internet-standards.com
Catalog: translations/*/main.po
Languages: de

source: detail mail auth spf-policy verdict redirect
de: Deine SPF-Richtlinie ist *nicht* streng genug. Der Modifikator "redirect" in deinem SPF-Eintrag weist auf eine nicht ausreichend strenge SPF-Richtlinie oder einen nicht vorhandenen SPF-Eintrag hin.

source: detail mail dnssec exists exp
de: Wir prüfen, ob deine Domain, genauer gesagt ihr SOA-Eintrag, DNSSEC-signiert ist. Mit einer DNSSEC-Signatur können Absender, die Domain-Signaturen validieren, die Echtheit der DNS-Antwort überprüfen, die deine Mailserver-Domänen (MX) enthält. Das verhindert, dass ein Angreifer die DNS-Antwort manipuliert, um an dich gesendete Mails auf die Mailserver-Domäne des Angreifers umzuleiten. Wenn eine Domain über `CNAME` auf eine andere Domain umleitet, prüfen wir auch, ob die CNAME-Domain signiert ist (was dem DNSSEC-Standard entspricht). Wenn die CNAME-Domain nicht signiert ist, fällt das Ergebnis dieses Subtests negativ aus. Hinweis: Die Gültigkeit der Signatur ist nicht Teil dieses Subtests, sondern Teil des nächsten Subtests.

source: detail mail dnssec exists label
de: DNSSEC Existenz

source: detail mail dnssec exists tech table
de: E-Mail Adresse Domain|Registrar

source: detail mail dnssec exists verdict bad
de: Die Domain deiner E-Mail-Adresse ist unsicher, weil sie *nicht* DNSSEC-signiert ist.

source: detail mail dnssec exists verdict good
de: Die Domain deiner E-Mail-Adresse ist DNSSEC-signiert.

source: detail mail dnssec exists verdict resolver-error
de: Leider ist ein Fehler im Resolver von Internet.nl aufgetreten. Bitte [kontaktiere](/about/) uns.

source: detail mail dnssec exists verdict servfail
de: Die Nameserver deiner E-Mail-Adressdomäne sind *kaputt*. Sie haben einen Fehler (`SERVFAIL`) auf unsere Anfragen nach einer DNSSEC-Signatur zurück. Bitte kontaktiere deinen Nameserver-Betreiber (oft dein Hosting-Provider und/oder Registrar), damit dies bald zu beheben.

source: detail mail dnssec mx-exists exp
de: Wir prüfen, ob die Domains deiner Mailserver (MX), genauer gesagt ihre SOA-Einträge, DNSSEC-signiert sind. Mit einer DNSSEC-Signatur können Absender, die Domainsignaturen validieren, die Echtheit der DNS-Antwort mit den IP-Adressen und DANE-Einträgen deines Mailservers/ deiner Mailserver überprüfen. Dies verhindert, dass ein Angreifer die DNS-Antwort manipuliert, um an dich gesendete Mails an eine vom Angreifer kontrollierte IP-Adresse umzuleiten oder die gesicherte Mailserververbindung abzuhören. Wenn eine Domain über `CNAME` auf eine andere Domain umleitet, prüfen wir auch, ob die CNAME-Domain signiert ist (was dem DNSSEC-Standard entspricht). Wenn die CNAME-Domain nicht signiert ist, fällt das Ergebnis dieses Subtests negativ aus. Beachte, dass der E-Mail-Test nicht auf A/AAAA-Einträge für Mailserver zurückgreift, wenn kein MX-Eintrag vorhanden ist. Die Gültigkeit der Signatur ist nicht Teil dieses Subtests, sondern Teil des nächsten Subtests.

source: detail mail dnssec mx-exists label
de: DNSSEC Existenz

source: detail mail dnssec mx-exists tech table
de: Domäne des Mailservers (MX)|DNSSEC vorhanden

source: detail mail dnssec mx-exists verdict bad
de: Mindestens eine deiner Mailserver-Domänen ist unsicher, weil sie *nicht* DNSSEC signiert ist.

source: detail mail dnssec mx-exists verdict good
de: Alle Domains deines Mailservers sind DNSSEC-signiert.

source: detail mail dnssec mx-exists verdict invalid-null-mx
de: Deine Domain zeigt einen "Null MX"-Eintrag an, der angibt, dass sie keine E-Mails akzeptiert. Aber entweder hat deine Domain keine A/AAAA-Einträge, so dass der "Null MX"-Eintrag unnötig ist. Oder auf deiner Domain ist ein empfangender Mailserver durch einen anderen MX-Eintrag festgelegt, wodurch der "Null MX"-Eintrag in Konflikt gerät.

source: detail mail dnssec mx-exists verdict no-mailservers
de: Auf deiner Domain sind keine empfangenden Mailserver (MX) eingestellt, die keine A/AAAA-Einträge haben. Das ist in Ordnung, wenn du keine E-Mails empfangen möchtest.

source: detail mail dnssec mx-exists verdict no-null-mx
de: Auf deiner Domain, die A/AAAA-Einträge hat, sind keine empfangenden Mailserver (MX) eingestellt. Wir empfehlen dir, explizit anzugeben, dass deine Domain keine E-Mails annimmt, indem du einen "Null MX"-Eintrag konfigurierst. Verwende keinen "Null MX"-Eintrag und richte einen MX ein, wenn du von diesem Domainnamen aus E-Mails versenden möchtest, da empfangende Server E-Mails mit einer ungültigen Absenderadresse zurückweisen können.

source: detail mail dnssec mx-exists verdict null-mx
de: Dein Domainname, der A/AAAA-Einträge hat, zeigt mit einem "Null MX"-Eintrag deutlich an, dass er keine E-Mails akzeptiert. Das ist in Ordnung, wenn du keine E-Mails empfangen willst. Verwende keinen "Null MX"-Eintrag und richte einen MX ein, wenn du von diesem Domänennamen aus E-Mails versenden möchtest, da empfangende Server E-Mails mit einer ungültigen Absenderadresse zurückweisen können.

source: detail mail dnssec mx-exists verdict null-mx-with-other-mx
de: Deine Domain gibt einen "Null MX"-Eintrag an, der angibt, dass sie keine E-Mails akzeptiert. Auf deiner Domain ist jedoch ein empfangender Mailserver durch einen anderen MX-Eintrag festgelegt, so dass der "Null MX" in Konflikt gerät.

source: detail mail dnssec mx-exists verdict null-mx-without-a-aaaa
de: Deine Domain wirbt mit einem "Null MX"-Eintrag, der anzeigt, dass sie keine E-Mails akzeptiert. Deine Domain hat jedoch keine A/AAAA-Einträge, so dass der "Null MX"-Eintrag unnötig ist.

source: detail mail dnssec mx-exists verdict resolver-error
de: Leider ist ein Fehler im Resolver von Internet.nl aufgetreten. Bitte [kontaktiere](/about/) uns.

source: detail mail dnssec mx-exists verdict servfail
de: Die Nameserver von mindestens einer deiner Mailserver-Domänen sind *kaputt*. Sie haben auf unsere Abfragen nach einer DNSSEC-Signatur einen Fehler (`SERVFAIL`) zurückgegeben. Bitte wende dich an deinen Nameserver-Betreiber (oft dein Mail-Provider), damit er das Problem dies bald zu beheben.

source: detail mail dnssec mx-valid exp
de: Wir prüfen, ob die Domänen deiner empfangenden Mailserver (MX), genauer gesagt ihre SOA-Einträge, mit einer gültigen Signatur versehen sind. einer gültigen Signatur versehen sind, die sie "sicher" macht. Wenn ein Domänenname über `CNAME` auf einen anderen signierten Domänennamen umleitet, prüfen wir auch, ob die Signatur des CNAME-Domänennamens gültig ist (was dem DNSSEC-Standard entspricht). Wenn die Signatur des CNAME-Domänennamens nicht gültig ist, fällt das Ergebnis dieses Subtests negativ aus. Beachte, dass wir nur den Nameserver testen, der zuerst antwortet. Wenn die Nameserver eines Domänennamens uneinheitlich konfiguriert sind, kann dies zu unterschiedlichen Testergebnissen führen. In diesem Fall kann das Ergebnis dieses Untertests zum Beispiel einmal "sicher" und das nächste Mal "falsch" lauten.

source: detail mail dnssec mx-valid label
de: DNSSEC Gültigkeit

source: detail mail dnssec mx-valid tech table
de: Domäne des Mailservers (MX)|Status

source: detail mail dnssec mx-valid verdict bad
de: Mindestens eine deiner signierten Mailserver-Domänen ist "gefälscht", weil ihre DNSSEC Signatur nicht gültig ist. Entweder hat jemand die Antworten von ihren Nameservern manipuliert Nameserver manipuliert, oder deine Mailserver-Domäne hat schwerwiegende DNSSEC-Konfigurations Fehler. In letzterem Fall ist der empfangende Mailserver für jeden sendenden Mailserver, der DNSSEC-Signaturen validiert, unerreichbar. Du solltest dich an den Nameserver-Betreiber (oft dein Mail-Provider) so bald wie möglich kontaktieren.

source: detail mail dnssec mx-valid verdict good
de: Alle deine signierten Mailserver-Domains sind sicher, weil ihre DNSSEC-Signaturen gültig sind.

source: detail mail dnssec mx-valid verdict unsupported-ds-algo
de: Mindestens eine deiner Mailserver-Domänen ist mit einem Algorithmus signiert, den unser Validierungsresolver derzeit nicht unterstützt. Daher sind wir nicht in der Lage, die Gültigkeit der DNSSEC-Signatur zu überprüfen.

source: detail mail dnssec valid exp
de: Wir prüfen, ob deine Domain, genauer gesagt ihr SOA-Eintrag, mit einer gültigen Signatur versehen ist, die sie "sicher" macht. Wenn ein Domainname über `CNAME` auf einen anderen signierten Domainnamen weiterleitet, prüfen wir auch, ob die Signatur des CNAME-Domainnamens gültig ist (was dem DNSSEC-Standard entspricht). Wenn die Signatur des CNAME-Domänennamens nicht gültig ist, fällt das Ergebnis dieses Subtests negativ aus. Beachte, dass wir nur den Nameserver testen, der zuerst antwortet. Wenn die Nameserver eines Domänennamens uneinheitlich konfiguriert sind, kann dies zu unterschiedlichen Testergebnissen führen. In diesem Fall kann das Ergebnis dieses Untertests zum Beispiel einmal "sicher" und das nächste Mal "falsch" lauten.

source: detail mail dnssec valid label
de: DNSSEC Gültigkeit

source: detail mail dnssec valid tech table
de: E-Mail Adresse Domain|Status

source: detail mail dnssec valid verdict bad
de: Die Domain deiner E-Mail-Adresse ist "gefälscht", weil die DNSSEC-Signatur *nicht* gültig ist. Entweder hat jemand die Antwort deines Nameservers manipuliert, oder deine Domain hat einen *schwerwiegenden DNSSEC-Konfigurationsfehler*. Im letzteren Fall ist deine Domain für jeden Benutzer, der DNSSEC-Signaturen validiert, unerreichbar. Du solltest dich an deinen Nameserver-Betreiber (oft dein Registrar oder Hosting-Provider) so schnell wie möglich.

source: detail mail dnssec valid verdict good
de: Die Domain deiner E-Mail-Adresse ist sicher, weil ihre DNSSEC-Signatur gültig ist.

source: detail mail dnssec valid verdict unsupported-ds-algo
de: Die Domain deiner E-Mail-Adresse ist mit einem Algorithmus signiert, den unser Validierungsresolver derzeit nicht unterstützt. Daher können wir die Gültigkeit der DNSSEC-Signatur nicht überprüfen.

source: detail mail ipv6 mx-AAAA exp
de: Wir prüfen, ob es mindestens einen AAAA-Eintrag mit IPv6-Adresse für jeden empfangenden Mailserver (MX) gibt. Falls kein Mailserver definiert ist, geben wir eine Benachrichtigung und führen andere Untertests des Mailtests aus, die noch relevant sind. 'IPv4-mapped IPv6-Adressen' ([RFC 4291](https://www.rfc-editor.org/rfc/rfc4291), beginnend mit ::ffff:) fallen in diesem Untertest durch, da sie keine IPv6-Konnektivität bieten. Beachte, dass der E-Mail-Test nicht auf A/AAAA-Einträge für Mailserver zurückgreift, wenn kein MX-Eintrag vorhanden ist.

source: detail mail ipv6 mx-AAAA label
de: IPv6-Adressen für den/die Mailserver

source: detail mail ipv6 mx-AAAA tech table
de: Mail-Server (MX)|IPv6-Adresse|IPv4-Adresse

source: detail mail ipv6 mx-AAAA verdict bad
de: Mindestens ein Postempfangsserver in deiner Domäne hat *keine* IPv6-Adresse Adresse.

source: detail mail ipv6 mx-AAAA verdict good
de: Alle empfangenden Mailserver in deiner Domain haben eine IPv6-Adresse.

source: detail mail ipv6 mx-AAAA verdict invalid-null-mx
de: Deine Domain zeigt einen "Null MX"-Eintrag an, der angibt, dass sie keine E-Mails akzeptiert. Aber entweder hat deine Domain keine A/AAAA-Einträge, so dass der "Null MX"-Eintrag unnötig ist. Oder auf deiner Domain ist ein empfangender Mailserver durch einen anderen MX-Eintrag festgelegt, wodurch der "Null MX"-Eintrag in Konflikt gerät.

source: detail mail ipv6 mx-AAAA verdict no-null-mx
de: Auf deiner Domain, die A/AAAA-Einträge hat, sind keine empfangenden Mailserver (MX) eingestellt. Wir empfehlen dir, explizit anzugeben, dass deine Domain keine E-Mails annimmt, indem du einen "Null MX"-Eintrag konfigurierst. Verwende keinen "Null MX"-Eintrag und richte einen MX ein, wenn du von diesem Domainnamen aus E-Mails versenden möchtest, da empfangende Server E-Mails mit einer ungültigen Absenderadresse zurückweisen können.

source: detail mail ipv6 mx-AAAA verdict null-mx
de: Dein Domainname, der A/AAAA-Einträge hat, zeigt mit einem "Null MX"-Eintrag deutlich an, dass er keine E-Mails akzeptiert. Das ist in Ordnung, wenn du keine E-Mails empfangen willst. Verwende keinen "Null MX"-Eintrag und richte einen MX ein, wenn du von diesem Domänennamen aus E-Mails versenden möchtest, da empfangende Server E-Mails mit einer ungültigen Absenderadresse zurückweisen können.

source: detail mail ipv6 mx-AAAA verdict null-mx-with-other-mx
de: Deine Domain gibt einen "Null MX"-Eintrag an, der angibt, dass sie keine E-Mails akzeptiert. Auf deiner Domain ist jedoch ein empfangender Mailserver durch einen anderen MX-Eintrag festgelegt, wodurch der "Null MX"-Eintrag in Konflikt gerät.

source: detail mail ipv6 mx-AAAA verdict null-mx-without-a-aaaa
de: Deine Domain wirbt mit einem "Null MX"-Eintrag, der anzeigt, dass sie keine E-Mails akzeptiert. Deine Domain hat jedoch keine A/AAAA-Einträge, so dass der "Null MX"-Eintrag unnötig ist.

source: detail mail ipv6 mx-AAAA verdict other
de: Auf deiner Domain sind keine empfangenden Mailserver (MX) eingestellt, die keine A/AAAA-Einträge haben. Das ist in Ordnung, wenn du keine E-Mails empfangen möchtest.

source: detail mail ipv6 mx-reach exp
de: Wir prüfen, ob wir uns mit deinen Mailservern (MX) über IPv6 auf Port 25 verbinden können. Wir testen alle IPv6-Adressen, die wir von den Nameservern deiner Mailserver-Domain(s) erhalten. Wenn nicht alle IPv6-Adressen erreichbar sind, gibt es eine Teilbewertung. Adressen erreichbar sind. Wenn eine IPv6-Adresse (syntaktisch) ungültig ist, betrachten wir sie als unerreichbar.

source: detail mail ipv6 mx-reach label
de: IPv6-Erreichbarkeit des/der Mailserver(s)

source: detail mail ipv6 mx-reach tech table
de: Mail-Server (MX)|Unerreichbare IPv6-Adresse

source: detail mail ipv6 mx-reach verdict bad
de: Mindestens einer deiner empfangenden Mailserver mit einer IPv6-Adresse ist *nicht* über IPv6 erreichbar.

source: detail mail ipv6 mx-reach verdict good
de: Alle deine empfangenden Mailserver mit einer IPv6-Adresse sind über IPv6.

source: detail mail rpki exists exp
de: Wir prüfen, ob eine RPKI Route Origin Authorization (ROA) für alle IP-Adressen deines/r Mailserver(s) (MX) veröffentlicht wurde. Dein Hoster (oder sein Netzwerkanbieter) gibt über das Border Gateway Protocol (BGP) bekannt, für welche seiner IP-Adressblöcke er eingehenden Internetverkehr annimmt. Andere Netzwerkanbieter nutzen diese Routenankündigungen, um zu bestimmen, über welche Route sie den Verkehr für die IP-Adressen deines Servers senden sollen. Eine Routenankündigung kann jedoch gefälscht werden. Tatsächlich kann ein anderer Netzbetreiber den IP-Adressblock deiner IP-Adresse mit seinem Netz verbinden und so möglicherweise Internetverkehr empfangen, der eigentlich für deinen Netzbetreiber bestimmt ist. Die Ursache kann versehentlich oder böswillig sein. In jedem Fall kann dies dazu führen, dass dein Server unerreichbar wird oder dass der Internetverkehr zu deinem Server abgefangen wird. Die Resource Public Key Infrastructure (RPKI) verbessert den Schutz davor erheblich. Mit RPKI kann der rechtmäßige Inhaber eines Blocks von IP-Adressen eine digital signierte Erklärung mit Routenberechtigung (Route Origin Authorisation, kurz ROA) veröffentlichen. Ein anderer Netzbetreiber, der Internetverkehr an eine bestimmte IP-Adresse senden möchte, kann die entsprechende Erklärung nutzen, um "ungültige" Routen herauszufiltern. Auf diese Weise verhindert der Netzwerkanbieter, dass Internetverkehr aus seinem Netzwerk an nicht autorisierte Providernetzwerke gesendet wird. *Anforderungsstufe: Empfohlen*

source: detail mail rpki exists label
de: Route Herkunft Autorisierung Existenz

source: detail mail rpki exists tech table
de: Mailserver|IP-Adresse|RPKI Route Herkunft Autorisierung

source: detail mail rpki exists verdict bad
de: Für mindestens eine der IP-Adressen des/der empfangenden Mailserver(s) wird *keine* RPKI Route Origin Authorisation (ROA) veröffentlicht.

source: detail mail rpki exists verdict good
de: Für alle IP-Adressen deiner empfangenden Mailserver wird eine RPKI Route Origin Authorisation (ROA) veröffentlicht.

source: detail mail rpki exists verdict no-addresses
de: Deine Domain enthält *keine* empfangenden Mailserver. Daher konnte dieser Subtest nicht durchgeführt werden.

source: detail mail rpki mx-ns-exists exp
de: Wir prüfen, ob eine RPKI Route Origin Authorization (ROA) für alle IP-Adressen der Nameserver deines/r Mailserver(s) (MX) veröffentlicht wurde. Dein Hoster (oder sein Netzwerkanbieter) gibt über das Border Gateway Protocol (BGP) bekannt, für welche seiner IP-Adressblöcke er eingehenden Internetverkehr annimmt. Andere Netzwerkanbieter nutzen diese Routenankündigungen, um zu bestimmen, über welche Route sie den Verkehr für die IP-Adressen deines Servers senden sollen. Eine Routenankündigung kann jedoch gefälscht werden. Tatsächlich kann ein anderer Netzbetreiber den IP-Adressblock deiner IP-Adresse mit seinem Netz verbinden und so möglicherweise Internetverkehr empfangen, der eigentlich für deinen Netzbetreiber bestimmt ist. Die Ursache kann versehentlich oder böswillig sein. In jedem Fall kann dies dazu führen, dass dein Server unerreichbar wird oder dass der Internetverkehr zu deinem Server abgefangen wird. Die Resource Public Key Infrastructure (RPKI) verbessert den Schutz davor erheblich. Mit RPKI kann der rechtmäßige Inhaber eines Blocks von IP-Adressen eine digital signierte Erklärung mit Routenberechtigung (Route Origin Authorisation, kurz ROA) veröffentlichen. Ein anderer Netzbetreiber, der Internetverkehr an eine bestimmte IP-Adresse senden möchte, kann die entsprechende Erklärung nutzen, um "ungültige" Routen herauszufiltern. Auf diese Weise verhindert der Netzwerkanbieter, dass Internetverkehr aus seinem Netzwerk an nicht autorisierte Providernetzwerke gesendet wird. *Anforderungsstufe: Empfohlen*

source: detail mail rpki mx-ns-exists label
de: Route Herkunft Autorisierung Existenz

source: detail mail rpki mx-ns-exists tech table
de: Nameserver von MX|IP-Adresse|RPKI Route Origin Authorization

source: detail mail rpki mx-ns-exists verdict bad
de: Für mindestens eine der IP-Adressen der Nameserver deines/r Mailserver(s) wird *keine* RPKI Route Origin Authorisation (ROA) veröffentlicht.

source: detail mail rpki mx-ns-exists verdict good
de: Für alle IP-Adressen der Nameserver deines/r Mailserver(s) wird eine RPKI Route Origin Authorisation (ROA) veröffentlicht.

source: detail mail rpki mx-ns-exists verdict no-addresses
de: Deine Domain enthält *keine* Mailserver. Daher konnte dieser Subtest nicht durchgeführt werden.

source: detail mail rpki mx-ns-valid exp
de: Wir prüfen, ob der Validierungsstatus für alle IP-Adressen der Nameserver deiner Mailserver (MX) `Gültig` ist. Wenn es mehrere sich überschneidende Routenankündigungen für die IP-Adresse gibt, prüfen wir, ob sie alle "gültig" sind. Dein Hoster (oder sein Netzwerkprovider) gibt über das Border Gateway Protocol (BGP) bekannt, für welche seiner IP-Adressblöcke er eingehenden Internetverkehr annimmt. Er tut dies, indem er (Teile) seiner IP-Adressblöcke (Route Prefix) mit der eindeutigen Nummer seines Providernetzes (Route Origin ASN) verknüpft und dann diese Routing-Informationen weitergibt. Andere Netzbetreiber nutzen diese Routenankündigungen, um zu bestimmen, über welche Route sie den Verkehr für die IP-Adressen senden sollen. Zusätzlich sollte dein Hoster (oder sein Netzwerkanbieter) für jede Routenankündigung eine digital signierte Erklärung mit einer Routenautorisierung (Route Origin Authorisation; abgekürzt: ROA) unter Verwendung der Resource Public Key Infrastructure (RPKI) veröffentlichen. Ein anderer Netzwerkanbieter, der gebeten wird, Internetverkehr an die IP-Adresse deines Servers zu senden, kann die zugehörige Erklärung kryptografisch verifizieren. Der verifizierte Inhalt (Validated ROA Payload; abgekürzt: VRP) enthält, welche Provider-Netzwerke (VRP ASN) für jeden aufgezeichneten IP-Adressblock (VRP-Präfix) zum Empfang von Internetverkehr berechtigt sind. Der Netzbetreiber kann diesen Inhalt dann nutzen, um BGP-Routen zu filtern. So kann er z.B. alle "ungültigen" Routen zurückweisen, um zu verhindern, dass Internetverkehr aus seinem Netz an nicht autorisierte Providernetze gesendet wird. Die Überprüfung von Routenankündigungen gegen Routenautorisierungen (RPKI Origin Validation; abgekürzt: ROV) hat die folgenden drei möglichen Ergebnisse. - `Gültig`: Die Routenankündigung der betreffenden IP-Adresse wird mit mindestens einer veröffentlichten Routengenehmigung abgeglichen. Eine Routenzulassung wird auch für spezifischere Routenankündigungen (d.h. für einen Teil des in der Routenzulassung enthaltenen IP-Adressblocks) abgeglichen, es sei denn, sie sind spezifischer als die in der Routenzulassung (über das Attribut `maxLength`) angegebene Grenze. - Ungültig": Die Routenankündigung der betreffenden IP-Adresse ist durch eine Routengenehmigung abgedeckt, aber sie stimmt *nicht* überein. Es gibt zwei mögliche Ursachen: 1. Der IP-Adressblock (Route Prefix) wird von einem Providernetzwerk (Route Origin ASN) angekündigt, das in der Routengenehmigung *nicht* zugelassen ist (Ergebnis in der Tabelle unten: "ungültig (as)"); 2. der angekündigte IP-Adressblock (Route Prefix) ist *kleiner als in der Routenzulassung erlaubt*, d.h. er überschreitet den Wert `maxLength` (Ergebnis in der Tabelle unten: "ungültig (Länge)"). - `NotFound`: Es wurde keine Anweisung mit einer Routenautorisierung gefunden, die die Routenankündigung der betreffenden IP-Adresse abdeckt. Dadurch wird das Routing des Internetverkehrs zu deinem Server unsicherer. Bitte kontaktiere deinen Hoster diesbezüglich. Er kann seinen Netzwerkprovider, dem die IP-Adressen deines Servers gehören, bitten, Routenautorisierungen zu veröffentlichen. **Was ist zu tun, wenn das Testergebnis den Status Ungültig anzeigt?** Der Status "Ungültig" weist auf einen unbeabsichtigten oder böswilligen Fehler in der Routenkonfiguration hin, der von deinem Hoster oder seinem Netzwerkanbieter (interner Fehler) oder von einem Dritten (externer Fehler) verursacht werden kann. In jedem Fall kann er dazu führen, dass dein Server nicht erreichbar ist oder der Internetverkehr zu deinem Server abgefangen wird. Kontaktiere deinen Hoster so schnell wie möglich. Im Falle eines internen Fehlers sollte dein Hoster seinen Netzwerkanbieter, dem die IP-Adressen deines Servers gehören, bitten, den Fehler in der Routenkonfiguration zu beheben. *Anforderungsstufe: Empfohlen*

source: detail mail rpki mx-ns-valid label
de: Gültigkeit der Routenansage

source: detail mail rpki mx-ns-valid tech table
de: Nameserver der MX|BGP Route Präfix|BGP Route Herkunft ASN|RPKI Herkunft Validierungsstatus

source: detail mail rpki mx-ns-valid verdict bad
de: Mindestens eine IP-Adresse der Nameserver deiner empfangenden Mailserver hat den Validierungsstatus `NotFound`. Es gibt *keine* RPKI Route Origin Authorization (ROA), die für die Routenankündigung jeder der betroffenen IP-Adressen veröffentlicht wurde.

source: detail mail rpki mx-ns-valid verdict good
de: Alle IP-Adressen der Nameserver deiner empfangenden Mailserver haben den Validierungsstatus `Gültig`. Die Routenankündigung dieser IP-Adressen wird mit der veröffentlichten RPKI Route Origin Authorisation (ROA) abgeglichen.
