Repository: dreistromland/internet-standards.com
Catalog: translations/*/main.po
Languages: de

source: probes tests-duration
de: Die Dauer des Tests liegt zwischen 5 und {{cache_ttl}} Sekunden.

source: results dated-presentation
de: Datierte Ergebnisdarstellung. Bitte führe den Test noch einmal durch.

source: results domain appsecpriv http-headers label
de: HTTP-Sicherheits-Header

source: results domain appsecpriv other-options label
de: Andere Sicherheitsoptionen

source: results domain ipv6 web-server label
de: Webserver

source: results domain rpki web-server label
de: Webserver

source: results domain tls http-headers label
de: HTTP-Header

source: results domain tls https label
de: HTTP

source: results domain tls tls label
de: TLS

source: results domain-mail ipv6 name-servers label
de: Nameserver der Domäne

source: results domain-mail rpki name-servers label
de: Nameserver der Domäne

source: results domain-mail tls certificate label
de: Zertifikat

source: results domain-mail tls dane label
de: DATEN

source: results empty-argument-alt-text
de: Keine

source: results explanation label
de: Erklärung zum Test:

source: results further-testing connection content
de: - ### IPv6: - [IPv6 test](https://ipv6-test.com/) - ### DNSSEC-Validierung: - [Test des DNSSEC-Auflösungsalgorithmus](https://rootcanary.org/test.html) - ### HTTPS: - [SSL Client Test](https://www.ssllabs.com/ssltest/viewMyClient.html) - ### RPKI-Validierung - [RPKI Webtest](https://rpkitest.nlnetlabs.net/) - [Ist BGP schon sicher?](https://isbgpsafeyet.com/)

source: results further-testing connection label
de: Weitere Verbindungstests

source: results further-testing mail content
de: - ### IPv6: - [IP6.nl](https://ip6.nl/) - [Sichtbarkeit von IP-Adressen](https://stat.ripe.net/widget/visibility) - ### DNSSEC: - [DNSViz](http://dnsviz.net/) - [Zonemaster](https://zonemaster.net) - ### DMARC, DKIM und SPF : - [MECSA - EU Kommission](https://mecsa.jrc.ec.europa.eu/) (auch STARTTLS+DANE) - [DMARC lernen](https://www.learndmarc.com/) - [Mail-tester.com](https://www.mail-tester.com/) - ### STARTTLS und DANE: - [DANE SMTP Validator](https://dane.sys4.de/) - [DANE Umfrageergebnisse](https://stats.dnssec-tools.org/) - [HaveDane.net](https://havedane.net/) - ### RPKI: - [Routinator](https://routinator.nlnetlabs.nl/) - [IRR-Explorer](https://irrexplorer.nlnog.net/)

source: results further-testing mail label
de: Weitere E-Mail-Tests

source: results further-testing web content
de: - ### IPv6: - [IP6.nl](https://ip6.nl/) - [Screenshots.page](https://screenshots.page/) - [Sichtbarkeit von IP-Adressen](https://stat.ripe.net/widget/visibility) - ### DNSSEC: - [DNSViz](https://dnsviz.net/) - [Zonemaster](https://zonemaster.net/) - ### HTTPS: - [Observatory von Mozilla](https://observatory.mozilla.org/) - [SSL Labs](https://www.ssllabs.com/ssltest/) - ### Sicherheitsoptionen: - [CSP Evaluator](https://csp-evaluator.withgoogle.com/) - [Analyze your CSP](https://report-uri.com/home/analyse/) - ### RPKI: - [Routinator](https://routinator.nlnetlabs.nl/) - [IRR-Explorer](https://irrexplorer.nlnog.net/)

source: results further-testing web label
de: Weitere Website-Tests

source: results mail auth dkim label
de: DKIM

source: results mail auth dmarc label
de: DMARC

source: results mail auth spf label
de: SPF

source: results mail dnssec domain label
de: E-Mail Adresse Domäne

source: results mail dnssec mail-servers label
de: Mail server domain(s)

source: results mail ipv6 mail-servers label
de: Mail Server(s)

source: results mail rpki mail-servers label
de: Mail Server(s)

source: results mail rpki mx-name-servers label
de: Nameserver des/der Mailserver(s)

source: results mail tls starttls label
de: TLS

source: results no-icon-detail close
de: schließen

source: results no-icon-detail open
de: öffnen

source: results no-icon-status error
de: Fehler

source: results no-icon-status failed
de: Gescheitert

source: results no-icon-status info
de: Informationen

source: results no-icon-status not-tested
de: Nicht prüfbar

source: results no-icon-status passed
de: Bestanden

source: results no-icon-status warning
de: Empfehlung

source: results panel-button hide
de: Details ausblenden

source: results panel-button show
de: Details anzeigen

source: results perfect-score
de: Herzlichen Glückwunsch, deine Domain wird bald in die **Hall of Fame** aufgenommen!

source: results permalink
de: Permalink Testergebnis {{permadate|date:'(Y-m-d H:i T)'}}

source: results rerun-test
de: Wiederhole den Test

source: results retest-time
de: Sekunden bis zur Wiederholungsoption:

source: results score-description
de: Die Domain {{prettyaddr}} hat eine Testpunktzahl von {{score}}%.

source: results tech-details label
de: Technische Details:

source: results test direct
de: Direkt testen:

source: results test email label
de: Teste eine andere E-Mail

source: results test website label
de: Eine andere Website testen

source: results test-info
de: Erläuterung des Prüfberichts

source: results verdict label
de: Fazit:

source: test connipv6 failed description
de: Schade! Dein Internetanbieter hat dir *keine* moderne Internet Adresse ([IPv6](/faqs/ipv6/)) oder hat nicht alles richtig konfiguriert. Deshalb bist du *nicht* in der Lage nicht in der Lage, andere Computer mit modernen Adressen zu erreichen. Bitte frage deinen Internetprovider nach einer vollständigen IPv6-Konnektivität.

source: test connipv6 failed summary
de: Moderne Adressen *nicht* erreichbar (IPv6)

source: test connipv6 info description
de: Schade! Dein Internetanbieter hat dir *keine* moderne Internet Adresse ([IPv6](/faqs/ipv6/)) oder hat nicht alles richtig konfiguriert. Deshalb bist du *nicht* in der Lage nicht in der Lage, andere Computer mit modernen Adressen zu erreichen. Bitte frage deinen Internetprovider nach einer vollständigen IPv6-Konnektivität.

source: test connipv6 info summary
de: Moderne Adressen *nicht* erreichbar (IPv6)

source: test connipv6 label
de: Erreichbare moderne Adressen (IPv6)

source: test connipv6 passed description
de: Gut gemacht! Dein Internetanbieter hat dir eine moderne Internet Adresse ([IPv6](/faqs/ipv6/)). Deshalb kannst du andere Computer mit modernen Adressen erreichen.

source: test connipv6 passed summary
de: Erreichbare moderne Adressen (IPv6)

source: test connipv6 title
de: Moderne Adressen erreichbar?

source: test connipv6 warning description
de: Schade! Dein Internetanbieter hat dir *keine* moderne Internet Adresse ([IPv6](/faqs/ipv6/)) oder hat nicht alles richtig konfiguriert. Deshalb bist du *nicht* in der Lage nicht in der Lage, andere Computer mit modernen Adressen zu erreichen. Bitte frage deinen Internetprovider nach einer vollständigen IPv6-Konnektivität.

source: test connipv6 warning summary
de: Moderne Adressen *nicht* erreichbar (IPv6)

source: test connresolver failed description
de: Schade! Domainsignaturen ([DNSSEC](/faqs/dnssec/)) werden *nicht* für dich validiert. Deshalb bist du *nicht* gegen die manipulierte Übersetzung von signierten Domains in betrügerische IP-Adressen. Bitte frage deinen Internet-Provider nach der DNSSEC-Validierung und/oder aktiviere sie auf deinen eigenen Systemen.

source: test connresolver failed summary
de: Domain-Signaturen *nicht* validiert (DNSSEC)

source: test connresolver info description
de: Schade! Domainsignaturen ([DNSSEC](/faqs/dnssec/)) werden *nicht* für dich validiert. Deshalb bist du *nicht* gegen die manipulierte Übersetzung von signierten Domains in betrügerische IP-Adressen. Bitte frage deinen Internet-Provider nach der DNSSEC-Validierung und/oder aktiviere sie auf deinen eigenen Systemen.

source: test connresolver info summary
de: Domain-Signaturen *nicht* validiert (DNSSEC)

source: test connresolver label
de: Domain signature validation (DNSSEC)

source: test connresolver passed description
de: Gut gemacht! Die Domainsignaturen ([DNSSEC](/faqs/dnssec/)) sind für dich validiert. Daher bist du vor falschen Übersetzungen von signierten Domainnamen in betrügerische IP-Adressen geschützt. Adressen.

source: test connresolver passed summary
de: Domain-Signaturen validiert (DNSSEC)

source: test connresolver title
de: Domain-Signaturen validiert?

source: test connresolver warning description
de: Schade! Domainsignaturen ([DNSSEC](/faqs/dnssec/)) werden *nicht* für dich validiert. Deshalb bist du *nicht* gegen die manipulierte Übersetzung von signierten Domains in betrügerische IP-Adressen. Bitte frage deinen Internet-Provider nach der DNSSEC-Validierung und/oder aktiviere sie auf deinen eigenen Systemen.

source: test connresolver warning summary
de: Domain-Signaturen *nicht* validiert (DNSSEC)

source: test error summary
de: *Fehler* bei der Testausführung!

source: test mailauth failed description
de: Schade! Deine Domain enthält *nicht* alle Authentizitätskennzeichen gegen E-Mail Fälschung ([DMARC, DKIM und SPF](/faqs/mailauth/)). Deshalb sind die Empfänger *nicht* in der Lage, Phishing und Spam-E-Mails, die deine Domain in der Absenderadresse missbrauchen, von deinen authentischen E-Mails zu unterscheiden. Du solltest deinen E-Mail-Anbieter bitten, DMARC, DKIM und SPF zu aktivieren.

source: test mailauth failed summary
de: *Nicht* alle Authentizitätskennzeichen gegen E-Mail-Phishing (DMARC, DKIM und SPF)

source: test mailauth info description
de: Schade! Deine Domain enthält *nicht* alle Authentizitätskennzeichen gegen E-Mail Fälschung ([DMARC, DKIM und SPF](/faqs/mailauth/)). Deshalb sind die Empfänger *nicht* in der Lage, Phishing und Spam-E-Mails, die deine Domain in der Absenderadresse missbrauchen, von deinen authentischen E-Mails zu unterscheiden. Du solltest deinen E-Mail-Anbieter bitten, DMARC, DKIM und SPF zu aktivieren.

source: test mailauth info summary
de: *Nicht* alle Authentizitätskennzeichen gegen E-Mail-Phishing (DMARC, DKIM und SPF)

source: test mailauth label
de: Authentizitätskennzeichen gegen Phishing (DMARC, DKIM und SPF)

source: test mailauth passed description
de: Gut gemacht! Deine Domain enthält alle Echtheitsmerkmale gegen E-Mail Fälschung ([DMARC, DKIM und SPF](/faqs/mailauth/)). Deshalb können die Empfänger Phishing- und Spam-E-Mails und Spam-E-Mails, die deine Domain in ihrer Absenderadresse missbrauchen, von deinen authentischen Mails.

source: test mailauth passed summary
de: Authentizitätskennzeichen gegen E-Mail-Phishing (DMARC, DKIM und SPF)

source: test mailauth title
de: Echtheitsmerkmale gegen E-Mail-Phishing?

source: test mailauth warning description
de: Schade! Deine Domain enthält *nicht* alle Authentizitätskennzeichen gegen E-Mail Fälschung ([DMARC, DKIM und SPF](/faqs/mailauth/)). Deshalb sind die Empfänger *nicht* in der Lage, Phishing und Spam-E-Mails, die deine Domain in der Absenderadresse missbrauchen, von deinen authentischen E-Mails zu unterscheiden. Du solltest deinen E-Mail-Anbieter bitten, DMARC, DKIM und SPF zu aktivieren.

source: test mailauth warning summary
de: *Nicht* alle Authentizitätskennzeichen gegen E-Mail-Phishing (DMARC, DKIM und SPF)

source: test maildnssec failed description
de: Schade! Einige oder alle deiner E-Mail-Adressen und Mailserver-Domänen sind nicht nicht mit einer gültigen Signatur signiert ([DNSSEC](/faqs/dnssec/)). Daher können Absender mit aktivierter Domain Signaturüberprüfung nicht in der Lage, die IP-Adresse deines empfangenden Mailserver(s) abzufragen. Ein Angreifer könnte die IP-Adresse heimlich manipulieren Adresse manipulieren und an dich adressierte E-Mails auf seinen eigenen Mailserver umleiten. Du solltest deinen Nameserver-Betreiber und/oder deinen Mail-Provider bitten, die DNSSEC.

source: test maildnssec failed summary
de: *Nicht* alle Domainnamen signiert (DNSSEC)

source: test maildnssec info description
de: Schade! Einige oder alle deiner E-Mail-Adressen und Mailserver-Domänen sind nicht nicht mit einer gültigen Signatur signiert ([DNSSEC](/faqs/dnssec/)). Daher können Absender mit aktivierter Domain Signaturvalidierung nicht in der Lage, die IP-Adresse deines empfangenden Mailserver(s) abzufragen. Ein Angreifer könnte die IP-Adresse heimlich manipulieren Adresse manipulieren und an dich adressierte E-Mails auf seinen eigenen Mailserver umleiten. Du solltest deinen Nameserver-Betreiber und/oder deinen Mail-Provider bitten, die DNSSEC.

source: test maildnssec info summary
de: *Nicht* alle Domainnamen signiert (DNSSEC)

source: test maildnssec label
de: Signierte Domänennamen (DNSSEC)

source: test maildnssec passed description
de: Gut gemacht! Die Domain deiner E-Mail-Adresse und die Domain(s) deines Mailservers sind mit einer gültigen Signatur ([DNSSEC](/faqs/dnssec/)) signiert. Daher können Absender mit aktivierter Domain Signaturvalidierung in der Lage, die IP-Adresse deines Mailservers zuverlässig abzufragen. empfangenden Mailserver(s) abfragen.

source: test maildnssec passed summary
de: Alle Domänennamen signiert (DNSSEC)

source: test maildnssec title
de: Domainnamen unterzeichnet?

source: test maildnssec warning description
de: Schade! Einige oder alle deiner E-Mail-Adressen und Mailserver-Domänen sind nicht nicht mit einer gültigen Signatur signiert ([DNSSEC](/faqs/dnssec/)). Daher können Absender mit aktivierter Domain Signaturvalidierung nicht in der Lage, die IP-Adresse deines empfangenden Mailserver(s) abzufragen. Ein Angreifer könnte die IP-Adresse heimlich manipulieren Adresse manipulieren und an dich adressierte E-Mails auf seinen eigenen Mailserver umleiten. Du solltest deinen Nameserver-Betreiber und/oder deinen Mail-Provider bitten, die DNSSEC.

source: test maildnssec warning summary
de: *Nicht* alle Domainnamen signiert (DNSSEC)

source: test mailipv6 failed description
de: Schade! Dein Mailserver kann nicht von Absendern erreicht werden, die moderne Adressen ([IPv6](/faqs/ipv6/)), oder eine Verbesserung möglich ist. Deshalb ist dein Mailserver nicht noch nicht Teil des modernen Internets. Du solltest deinen E-Mail-Anbieter bitten, die IPv6 zu aktivieren.

source: test mailipv6 failed summary
de: *Nicht* über eine moderne Internetadresse erreichbar, oder Verbesserung möglich (IPv6)

source: test mailipv6 info description
de: Schade! Dein Mailserver kann nicht von Absendern erreicht werden, die moderne Adressen ([IPv6](/faqs/ipv6/)), oder eine Verbesserung möglich ist. Deshalb ist dein Mailserver nicht noch nicht Teil des modernen Internets. Du solltest deinen E-Mail-Anbieter bitten, die IPv6 zu aktivieren.

source: test mailipv6 info summary
de: *Nicht* über eine moderne Internetadresse erreichbar, oder Verbesserung möglich (IPv6)

source: test mailipv6 label
de: Moderne Adresse (IPv6)

source: test mailipv6 passed description
de: Gut gemacht! Dein Mailserver kann von Absendern erreicht werden, die moderne Adressen ([IPv6](/faqs/ipv6/)) erreicht werden und ist damit voll und ganz Teil des modernen Internets.

source: test mailipv6 passed summary
de: Erreichbar über eine moderne Internetadresse (IPv6)

source: test mailipv6 title
de: Erreichbar über eine moderne Internetadresse?

source: test mailipv6 warning description
de: Schade! Dein Mailserver kann nicht von Absendern erreicht werden, die moderne Adressen verwenden ([IPv6](/faqs/ipv6/)), oder eine Verbesserung möglich ist. Deshalb ist dein Mailserver nicht noch nicht Teil des modernen Internets. Du solltest deinen E-Mail-Anbieter bitten, die IPv6 zu aktivieren.

source: test mailipv6 warning summary
de: *Nicht* über eine moderne Internetadresse erreichbar, oder Verbesserung möglich (IPv6)

source: test mailrpki failed description
de: Pech gehabt! Mindestens eine der IP-Adressen deines empfangenden Mailservers und der zugehörigen Nameserver hat eine Routenankündigung, die *nicht* mit der veröffentlichten Routengenehmigung ([RPKI](/faqs/rpki/)) übereinstimmt. Dies weist auf einen unbeabsichtigten oder böswilligen Fehler in der Routenkonfiguration hin, der von deinem Mail-Hoster oder deinem Nameserver-Hoster (interner Fehler) oder von einem Dritten (externer Fehler) verursacht werden kann. In jedem Fall kann er zur Nichterreichbarkeit deines Servers oder zum Abfangen des Internetverkehrs zu deinem Server führen. Setze dich so schnell wie möglich mit deinem Mail-Hoster oder Nameserver-Hoster in Verbindung. Im Falle eines internen Fehlers sollten sie ihren Netzwerkanbieter, dem die IP-Adressen deines Servers gehören, bitten, den Fehler in der Routenkonfiguration zu beheben.

source: test mailrpki failed summary
de: *Unautorisierte* Routenansage (RPKI)

source: test mailrpki info description
de: Informativ: Deine Domain enthält *keine* Nameserver und somit auch keine empfangenden Mailserver. Es gibt keine routbaren IP-Adressen, die getestet werden könnten ([RPKI](/faqs/rpki/)).

source: test mailrpki info summary
de: *Keine* routingfähigen IP-Adressen gefunden (RPKI)

source: test mailrpki label
de: Route Authorization (RPKI)

source: test mailrpki passed description
de: Gut gemacht! Alle IP-Adressen deiner empfangenden Mailserver und die zugehörigen Nameserver haben eine Routenankündigung, die mit der veröffentlichten Routengenehmigung ([RPKI](/faqs/rpki/)) übereinstimmt. Dadurch ist der E-Mail-Transport zwischen sendenden Mailservern mit aktivierter Routenvalidierung und deinen empfangenden Mailservern besser vor verschiedenen unbeabsichtigten oder böswilligen Routenkonfigurationsfehlern geschützt, die zur Unerreichbarkeit deiner Server oder zum Abfangen des Internetverkehrs zu deinen Servern führen können.

source: test mailrpki passed summary
de: Autorisierte Routenansage (RPKI)

source: test mailrpki title
de: Route Autorisierung?

source: test mailrpki warning description
de: Warnung! Mindestens eine der IP-Adressen deiner empfangenden Mailserver und der zugehörigen Nameserver hat eine Routenankündigung, für die *keine* Routengenehmigung veröffentlicht ist ([RPKI](/faqs/rpki/)). Infolgedessen ist der E-Mail-Transport zwischen sendenden Mailservern mit aktivierter Routenvalidierung und deinen empfangenden Mailservern *nicht* (vollständig) gegen verschiedene unbeabsichtigte oder böswillige Routenkonfigurationsfehler geschützt, die zur Nichterreichbarkeit deiner Server oder zum Abfangen des Internetverkehrs zu deinen Servern führen können. Erkundige dich bei deinem Mail-Hoster oder Nameserver-Hoster nach diesem Problem. Sie können ihren Netzwerkanbieter, dem die IP-Adressen deiner Server gehören, bitten, Routing-Autorisierungen zu veröffentlichen.

source: test mailrpki warning summary
de: Streckengenehmigung *nicht* veröffentlicht (RPKI)

source: test mailtls failed description
de: Schade! Versendende Mailserver, die sicheren E-Mail-Transport ([STARTTLS und DANE](/faqs/starttls/)) unterstützen, können *keine* oder eine *unzureichend* sichere Verbindung mit deinen empfangenden Mailservern herstellen. Passive und/oder aktive Angreifer können daher E-Mails auf dem Weg zu dir lesen. Du solltest deinen Mailanbieter bitten, STARTTLS und DANE zu aktivieren und sicher zu konfigurieren.

source: test mailtls failed summary
de: Mailserver-Verbindung *nicht* oder unzureichend gesichert (STARTTLS und DANE)

source: test mailtls info description
de: Schade! Versendende Mailserver, die sicheren E-Mail-Transport ([STARTTLS und DANE](/faqs/starttls/)) unterstützen, können *keine* oder eine *unzureichend* sichere Verbindung mit deinen empfangenden Mailservern herstellen. Passive und/oder aktive Angreifer können daher E-Mails auf dem Weg zu dir lesen. Du solltest deinen Mailanbieter bitten, STARTTLS und DANE zu aktivieren und sicher zu konfigurieren.

source: test mailtls info summary
de: Mailserver-Verbindung *nicht* oder unzureichend gesichert (STARTTLS und DANE)

source: test mailtls invalid-null-mx description
de: Warnung: Deine Domain zeigt einen "Null MX"-Eintrag an, der angibt, dass sie keine E-Mails akzeptiert. Aber entweder hat deine Domain keine A/AAAA-Einträge, so dass der "Null MX"-Eintrag unnötig ist. Oder auf deiner Domain ist ein empfangender Mailserver durch einen anderen MX-Eintrag festgelegt, wodurch der "Null MX"-Eintrag in Konflikt gerät.

source: test mailtls invalid-null-mx summary
de: Inkonsistent konfigurierte nicht-empfangende Mail-Domäne (STARTTLS und DANE)

source: test mailtls label
de: Sichere Mailserververbindung (STARTTLS und DANE)

source: test mailtls no-mx description
de: Informativ: Auf deiner Domain sind keine empfangenden Mailserver (MX) eingestellt, die keine A/AAAA-Einträge haben. Das ist in Ordnung, wenn du keine E-Mails empfangen möchtest. Beachte, dass du in diesem Fall *keinen* "Null MX"-Eintrag brauchst. Durch deine Konfiguration sind die Untertests in den Kategorien STARTTLS und DANE nicht anwendbar. Das gilt auch für die mailserverspezifischen Untertests in den Kategorien für IPv6 und DNSSEC.

source: test mailtls no-mx summary
de: Ordnungsgemäß konfigurierte nicht-empfangende Mail-Domäne (STARTTLS und DANE)

source: test mailtls no-null-mx description
de: Informativ: Auf deiner Domain, die A/AAAA-Einträge hat, sind keine empfangenden Mailserver (MX) eingestellt. Wir empfehlen dir, explizit anzugeben, dass deine Domain keine E-Mails annimmt, indem du einen "Null MX"-Eintrag konfigurierst. Mit deiner aktuellen Konfiguration sind die Untertests in den Kategorien STARTTLS und DANE nicht anwendbar. Das gilt auch für die mailserverspezifischen Untertests in den Kategorien für IPv6 und DNSSEC.

source: test mailtls no-null-mx summary
de: Nicht explizit konfigurierte nicht-empfangende Mail-Domäne (STARTTLS und DANE)

source: test mailtls null-mx description
de: Information: Deine Domain, die A/AAAA-Einträge hat, zeigt deutlich, dass sie keine E-Mails akzeptiert, indem sie einen "Null MX"-Eintrag veröffentlicht. Das ist in Ordnung, wenn du keine E-Mails empfangen möchtest. Durch deine Konfiguration sind die Untertests in den Kategorien STARTTLS und DANE nicht anwendbar. Das gilt auch für die mailserverspezifischen Untertests in den Kategorien für IPv6 und DNSSEC.

source: test mailtls null-mx summary
de: Ordnungsgemäß konfigurierte nicht-empfangende Mail-Domäne (STARTTLS und DANE)

source: test mailtls null-mx-with-other-mx description
de: Warnung: Deine Domain gibt einen "Null MX"-Eintrag an, der angibt, dass sie keine E-Mails akzeptiert. Auf deiner Domain ist jedoch ein empfangender Mailserver durch einen anderen MX-Eintrag festgelegt, so dass der "Null MX" in Konflikt steht.

source: test mailtls null-mx-with-other-mx summary
de: Nicht konsistent konfigurierte nicht-empfangende Mail-Domäne (STARTTLS und DANE)

source: test mailtls null-mx-without-a-aaaa description
de: Warnung: Deine Domain wirbt mit einem "Null MX"-Eintrag, der anzeigt, dass sie keine E-Mails akzeptiert. Deine Domain hat jedoch keine A/AAAA-Einträge, so dass der "Null MX"-Eintrag unnötig ist.

source: test mailtls null-mx-without-a-aaaa summary
de: Ordnungsgemäß konfigurierte nicht-empfangende Mail-Domäne, allerdings mit unnötigem Eintrag (STARTTLS und DANE)

source: test mailtls passed description
de: Gut gemacht! Versendende Mailserver, die sicheren E-Mail-Transport ([STARTTLS und DANE](/faqs/starttls/)) unterstützen, können eine sichere Verbindung mit deinem/ deinen empfangenden Mailserver(n) herstellen. STARTTLS verhindert, dass passive Angreifer E-Mails auf dem Weg zu dir lesen können. DANE schützt vor aktiven Angreifern, die die STARTTLS-Verschlüsselung aushebeln, indem sie den Mailverkehr manipulieren.

source: test mailtls passed summary
de: Mailserver-Verbindung ausreichend gesichert (STARTTLS und DANE)

source: test mailtls title
de: Sichere Mailserver-Verbindung?

source: test mailtls unreachable description
de: Testfehler: Mindestens einer deiner empfangenden Mailserver war für uns nicht erreichbar, so dass wir nicht (vollständig) auf STARTTLS und DANE testen konnten. Das kann an Problemen mit der Netzwerkverbindung liegen oder daran, dass der/die Mailserver keine Verbindungen akzeptiert/annehmen.

source: test mailtls unreachable summary
de: Unerreichbarer Postempfangsserver (STARTTLS und DANE)
