Repository: dreistromland/internet-standards.com
Catalog: translations/*/main.po
Languages: de

source: detail web appsecpriv http-x-content-type exp
de: Wir prüfen, ob dein Webserver einen HTTP-Header für "X-Content-Type-Options" bereitstellt. Mit diesem HTTP-Header teilst du den Webbrowsern mit, dass sie kein "MIME-Type-Sniffing" durchführen und sich immer an den von deinem Webserver deklarierten `Content-Type` halten sollen. Der einzig gültige Wert für diesen HTTP-Header ist `nosniff`. Wenn er aktiviert ist, blockiert ein Browser Anfragen für `style` und `script`, wenn sie keinen entsprechenden `Content-Type` haben (d.h. `text/css` oder einen 'JavaScript MIME-Type' wie `application/javascript`). MIME-Type-Sniffing" ist eine Technik, bei der der Browser den Inhalt einer Datei durchsucht, um das Format einer Datei unabhängig vom deklarierten `Content-Type` des Webservers zu erkennen. Diese Technik ist anfällig für den so genannten "MIME-Verwechslungsangriff", bei dem der Angreifer den Inhalt einer Datei so manipuliert, dass sie vom Browser als ein anderer "Content-Type" behandelt wird, z. B. als eine ausführbare Datei. *Anforderungsstufe: Empfohlen*

source: detail web appsecpriv http-x-content-type label
de: X-Content-Type-Options

source: detail web appsecpriv http-x-content-type tech table
de: Webserver-IP-Adresse|X-Content-Type-Options-Wert

source: detail web appsecpriv http-x-content-type verdict bad
de: Dein Webserver bietet *keine* X-Content-Type-Options an.

source: detail web appsecpriv http-x-content-type verdict good
de: Dein Webserver bietet X-Content-Type-Options.

source: detail web appsecpriv http-x-frame exp
de: Wir prüfen, ob dein Webserver einen HTTP-Header für `X-Frame-Options` bereitstellt, der eine ausreichend sichere Richtlinie hat. Mit diesem HTTP-Header teilst du Webbrowsern mit, ob du das Framing deiner Website zulassen willst oder nicht. Die Verhinderung von Framing schützt die Besucher vor Angriffen wie Clickjacking. Wir halten die folgenden Werte für ausreichend sicher: * `DENY` (Framing nicht erlaubt); oder * `SAMEORIGIN` (nur Framing durch deine eigene Website erlaubt). Obwohl der Wert `ALLOW-FROM` (nur bestimmten Websites das Framing deiner Website erlauben) Teil der `X-Frame-Options`-Spezifikation ([RFC 7034](https://www.rfc-editor.org/rfc/rfc7034)) ist, wird er von den meisten modernen Webbrowsern *nicht* unterstützt. Daher halten wir diesen Wert *nicht* für ausreichend sicher. Beachte, dass `Content-Security-Policy` ([CSP](#control-panel-29)) einen ähnlichen Schutz durch `frame-ancestors` und außerdem viel mehr für Besucher mit modernen Webbrowsern bietet. Allerdings könnte `X-Frame-Options` auch Besucher mit älteren Webbrowsern schützen, die CSP nicht unterstützen. Außerdem könnte `X-Frame-Options` einen wertvollen Schutz für alle Besucher bieten, wenn CSP nicht (richtig) für die betreffende Website konfiguriert ist. Siehe auch ['Web application guidelines from NCSC-NL'](https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties), Richtlinie U/PW.03 (auf Niederländisch). *Anforderungsstufe: Optional*

source: detail web appsecpriv http-x-frame label
de: X-Frame-Optionen

source: detail web appsecpriv http-x-frame tech table
de: Webserver IP-Adresse|X-Frame-Options-Wert

source: detail web appsecpriv http-x-frame verdict bad
de: Dein Webserver bietet *keine* sicher konfigurierten X-Frame-Options.

source: detail web appsecpriv http-x-frame verdict good
de: Dein Webserver bietet sicher konfigurierte X-Frame-Options.

source: detail web appsecpriv http-x-xss exp
de: VERALTETER TEXT; TEST NICHT VERWENDET Wir prüfen, ob dein Webserver einen HTTP-Header für `X-XSS-Protection` bereitstellt, der einen ausreichend sicheren Wert hat (d.h. `1` oder `1; mode=block`). Dieser HTTP-Header kann verwendet werden, um den Schutzfilter von Browsern gegen reflektierende Cross-Site-Scripting (XSS)-Angriffe zu aktivieren. Gültige Werte für den `X-XSS-Protection`-Header sind: * `0` deaktiviert den XSS-Filter. Dieser Wert sollte NICHT verwendet werden. * "1" aktiviert den XSS-Filter. Wenn ein Cross-Site-Scripting-Angriff erkannt wird, bereinigt der Browser das Skript und entfernt die unsicheren Teile. Dieser Wert ist normalerweise der Standardwert in Browsern, wenn eine Website keinen "X-XSS-Protection"-Header anbietet. * `1; mode=block` aktiviert den XSS-Filter. Wenn ein Cross-Site-Scripting-Angriff erkannt wird, blockiert der Browser die Antwort und verhindert das Rendern der Seite. Dies ist der empfohlene Wert. Die `Content-Security-Policy` (CSP) bietet einen ähnlichen Schutz und noch viel mehr für Besucher mit modernen Webbrowsern. Dennoch kann `X-XSS-Protection` auch Besucher mit älteren Webbrowsern schützen, die CSP nicht unterstützen. Außerdem könnte `X-XSS-Protection` einen wertvollen Schutz für alle Besucher bieten, wenn CSP nicht (richtig) für die betreffende Website konfiguriert ist. *Anforderungsstufe: Empfohlen*

source: detail web appsecpriv http-x-xss label
de: VERALTETER TEXT; TEST NICHT VERWENDET X-XSS-Schutz

source: detail web appsecpriv http-x-xss tech table
de: VERALTETER TEXT; TEST NICHT VERWENDET Webserver IP-Adresse|X-XSS-Protection-Wert

source: detail web appsecpriv http-x-xss verdict bad
de: VERALTETER TEXT; TEST NICHT VERWENDET Dein Webserver bietet *keine* sicher konfigurierte X-XSS-Protection.

source: detail web appsecpriv http-x-xss verdict good
de: VERALTETER TEXT; TEST NICHT VERWENDET Dein Webserver bietet eine sicher konfigurierte X-XSS-Protection.

source: detail web dnssec exists exp
de: Wir prüfen, ob deine Domain, genauer gesagt ihr SOA-Eintrag, DNSSEC-signiert ist. Wenn eine Domain über `CNAME` auf eine andere Domain umleitet, prüfen wir auch, ob die CNAME-Domain signiert ist (was dem DNSSEC-Standard entspricht). Wenn die CNAME-Domain nicht signiert ist, fällt das Ergebnis dieses Subtests negativ aus. Hinweis: Die Gültigkeit der Signatur ist nicht Teil dieses Subtests, sondern Teil des nächsten Subtests.

source: detail web dnssec exists label
de: DNSSEC Existenz

source: detail web dnssec exists tech table
de: Domain|Registrar

source: detail web dnssec exists verdict bad
de: Deine Domain ist unsicher, weil sie *nicht* DNSSEC-signiert ist.

source: detail web dnssec exists verdict good
de: Deine Domain ist DNSSEC-signiert.

source: detail web dnssec exists verdict resolver-error
de: Leider ist ein Fehler im Resolver von Internet.nl aufgetreten. Bitte [kontaktiere](/about/) uns.

source: detail web dnssec exists verdict servfail
de: Die Nameserver deiner Domain sind *kaputt*. Sie haben einen Fehler (`SERVFAIL`) auf unsere Abfrage nach einer DNSSEC-Signatur zurück. Bitte kontaktiere deinen Nameserver-Betreiber (oft dein Hosting-Provider und/oder Registrar), damit um dies bald zu beheben.

source: detail web dnssec valid exp
de: Wir prüfen, ob deine Domain, genauer gesagt ihr SOA-Eintrag, mit einer gültigen Signatur versehen ist, die sie "sicher" macht. Wenn ein Domainname über `CNAME` auf einen anderen signierten Domainnamen weiterleitet, prüfen wir auch, ob die Signatur des CNAME-Domainnamens gültig ist (was dem DNSSEC-Standard entspricht). Wenn die Signatur des CNAME-Domänennamens nicht gültig ist, fällt das Ergebnis dieses Subtests negativ aus. Beachte, dass wir nur den Nameserver testen, der zuerst antwortet. Wenn die Nameserver eines Domänennamens uneinheitlich konfiguriert sind, kann dies zu unterschiedlichen Testergebnissen führen. In diesem Fall kann das Ergebnis dieses Untertests zum Beispiel einmal "sicher" und das nächste Mal "falsch" lauten.

source: detail web dnssec valid label
de: DNSSEC Gültigkeit

source: detail web dnssec valid tech table
de: Bereich|Status

source: detail web dnssec valid verdict bad
de: Deine Domain ist "gefälscht", weil die DNSSEC-Signatur *nicht* gültig ist. Entweder hat jemand die Antwort deines Nameservers manipuliert, oder deine Domain hat einen *schwerwiegenden DNSSEC-Konfigurationsfehler*. Im letzteren Fall ist deine Domain für jeden Benutzer, der DNSSEC-Signaturen validiert, unerreichbar. Du solltest dich an deinen Nameserver-Betreiber (oft dein Registrar oder Hosting-Provider) so schnell wie möglich.

source: detail web dnssec valid verdict good
de: Deine Domain ist sicher, weil ihre DNSSEC-Signatur gültig ist.

source: detail web dnssec valid verdict unsupported-ds-algo
de: Deine Domain ist mit einem Algorithmus signiert, den unser Validierungsresolver derzeit nicht unterstützt. Daher können wir die Gültigkeit der DNSSEC-Signatur nicht überprüfen.

source: detail web ipv6 web-AAAA exp
de: Wir prüfen, ob es mindestens einen AAAA-Eintrag mit IPv6-Adresse für deinen Webserver gibt. Server gibt. 'IPv4-mapped IPv6-Adressen' ([RFC 4291](https://www.rfc-editor.org/rfc/rfc4291), beginnend mit ::ffff:) fallen bei diesem Subtest durch, da sie *keine* IPv6-Konnektivität bieten.

source: detail web ipv6 web-AAAA label
de: IPv6-Adressen für Webserver

source: detail web ipv6 web-AAAA tech table
de: Webserver|IPv6-Adresse|IPv4-Adresse

source: detail web ipv6 web-AAAA verdict bad
de: *Keiner* deiner Webserver hat eine IPv6-Adresse.

source: detail web ipv6 web-AAAA verdict good
de: Mindestens einer deiner Webserver hat eine IPv6-Adresse.

source: detail web ipv6 web-ipv46 exp
de: Wir vergleichen die Antworten und Inhalte, die du von deinem Webserver über IPv6 erhältst, mit denen, die du über IPv4 erhältst. Wir prüfen: 1. ob HTTP (Port 80) und/oder HTTPS (Port 443) über IPv4 auch über IPv6 verfügbar sind; 2. ob HTTP-Header (wie z.B. ein Redirect-Header) über IPv4 auch über IPv6 empfangen werden; 3. ob HTML-Inhalte, die über IPv4 übertragen werden, auch über IPv6 empfangen werden. Nachdem wir eventuelle Nonces entfernt haben, vergleichen wir die empfangenen Inhalte. Der Unterschied zwischen den Inhalten darf nicht größer als 10% sein, um diesen Subtest zu bestehen. Der Schwellenwert stellt sicher, dass kleine Unterschiede (z. B. durch wechselnde Anzeigen) nicht dazu führen, dass auch dieser Subtest nicht bestanden wird. Ein beobachteter Unterschied kann beabsichtigt oder auf einen Messfehler zurückzuführen sein. Deshalb wird in diesem Fall eine Warnung ausgegeben und der Unterschied nicht in die Bewertung einbezogen. Wenn es mehrere IPv6- und IPv4-Adressen gibt, wählen wir eine IPv6- und eine IPv4-Adresse aus, um den Subtest durchzuführen. Wenn nur eine IPv6-Adresse und keine IPv4-Adresse vorhanden ist, ist der Subtest nicht anwendbar, da kein Vergleich durchgeführt werden kann.

source: detail web ipv6 web-ipv46 label
de: Dieselbe Website auf IPv6 und IPv4

source: detail web ipv6 web-ipv46 verdict bad
de: Verfügbare Ports oder angebotene Header deiner Website über IPv4 sind *nicht* die gleichen über IPv6.

source: detail web ipv6 web-ipv46 verdict good
de: Deine Website auf IPv6 scheint die gleiche zu sein wie deine Website auf IPv4.

source: detail web ipv6 web-ipv46 verdict notice
de: Der HTML-Inhalt deiner Website über IPv4 ist *nicht* derselbe über IPv6.

source: detail web ipv6 web-ipv46 verdict notice-status-code
de: Deine Website auf IPv6 scheint die gleiche zu sein wie deine Website auf IPv4, aber der HTTP-Antwortcode liegt im Bereich 4xx oder 5xx. Das kann auf ein Konfigurationsproblem hindeuten.

source: detail web ipv6 web-reach exp
de: Wir prüfen, ob wir uns über IPv6 auf allen verfügbaren Ports (80 und/oder 443) mit deinem(n) Webserver(n) verbinden können. Ports (80 und/oder 443) verbinden können. Wir testen alle IPv6-Adressen, die wir von deinen Nameservern erhalten. Wenn nicht alle IPv6-Adressen erreichbar sind, gibt es eine Teilbewertung. erreichbar sind. Wenn eine IPv6-Adresse (syntaktisch) ungültig ist, betrachten wir sie unerreichbar.

source: detail web ipv6 web-reach label
de: IPv6-Erreichbarkeit des Webservers

source: detail web ipv6 web-reach tech table
de: Webserver|Unerreichbare IPv6-Adresse

source: detail web ipv6 web-reach verdict bad
de: Mindestens einer deiner Webserver mit einer IPv6-Adresse ist *nicht* erreichbar über IPv6.

source: detail web ipv6 web-reach verdict good
de: Alle deine Webserver mit einer IPv6-Adresse sind über IPv6 erreichbar.

source: detail web rpki exists exp
de: Wir prüfen, ob für alle IP-Adressen deines Webservers eine RPKI Route Origin Authorization (ROA) veröffentlicht wurde. Dein Hoster (oder sein Netzwerkanbieter) gibt über das Border Gateway Protocol (BGP) bekannt, für welche seiner IP-Adressblöcke er eingehenden Internetverkehr annimmt. Andere Netzwerkanbieter nutzen diese Routenankündigungen, um zu bestimmen, über welche Route sie den Verkehr für die IP-Adressen deines Servers senden sollen. Eine Routenankündigung kann jedoch gefälscht werden. Tatsächlich kann ein anderer Netzbetreiber den IP-Adressblock deiner IP-Adresse mit seinem Netz verbinden und so möglicherweise Internetverkehr empfangen, der eigentlich für deinen Netzbetreiber bestimmt ist. Die Ursache kann versehentlich oder böswillig sein. In jedem Fall kann dies dazu führen, dass dein Server unerreichbar wird oder dass der Internetverkehr zu deinem Server abgefangen wird. Die Resource Public Key Infrastructure (RPKI) verbessert den Schutz davor erheblich. Mit RPKI kann der rechtmäßige Inhaber eines Blocks von IP-Adressen eine digital signierte Erklärung mit Routenberechtigung (Route Origin Authorisation, kurz ROA) veröffentlichen. Ein anderer Netzbetreiber, der Internetverkehr an eine bestimmte IP-Adresse senden möchte, kann die entsprechende Erklärung nutzen, um "ungültige" Routen herauszufiltern. Auf diese Weise verhindert der Netzwerkanbieter, dass Internetverkehr aus seinem Netzwerk an nicht autorisierte Providernetzwerke gesendet wird. *Anforderungsstufe: Empfohlen*

source: detail web rpki exists label
de: Route Herkunft Autorisierung Existenz

source: detail web rpki exists tech table
de: Webserver|IP-Adresse|RPKI Route Herkunft Autorisierung

source: detail web rpki exists verdict bad
de: Für mindestens eine der IP-Adressen deines Webservers wird *keine* RPKI Route Origin Authorisation (ROA) veröffentlicht.

source: detail web rpki exists verdict good
de: Für alle IP-Adressen deines Webservers wird eine RPKI Route Origin Authorisation (ROA) veröffentlicht.

source: detail web rpki exists verdict no-addresses
de: Deine Domain enthält *keine* Webserver-IP-Adressen. Daher konnte dieser Subtest nicht durchgeführt werden.

source: detail web rpki valid exp
de: Wir prüfen, ob der Validierungsstatus für alle IP-Adressen deines Webservers `Gültig` ist. Wenn es mehrere sich überschneidende Routenankündigungen für die IP-Adresse gibt, prüfen wir, ob sie alle `Gültig` sind. Dein Hoster (oder sein Netzwerkprovider) kündigt über das Border Gateway Protocol (BGP) an, für welche seiner IP-Adressblöcke er eingehenden Internetverkehr annimmt. Er tut dies, indem er (Teile) seiner IP-Adressblöcke (Route Prefix) mit der eindeutigen Nummer seines Providernetzes (Route Origin ASN) verknüpft und dann diese Routing-Informationen weitergibt. Andere Netzbetreiber nutzen diese Routenankündigungen, um zu bestimmen, über welche Route sie den Verkehr für die IP-Adressen senden sollen. Zusätzlich sollte dein Hoster (oder sein Netzwerkanbieter) für jede Routenankündigung eine digital signierte Erklärung mit einer Routenautorisierung (Route Origin Authorisation; abgekürzt: ROA) unter Verwendung der Resource Public Key Infrastructure (RPKI) veröffentlichen. Ein anderer Netzwerkanbieter, der gebeten wird, Internetverkehr an die IP-Adresse deines Servers zu senden, kann die zugehörige Erklärung kryptografisch verifizieren. Der verifizierte Inhalt (Validated ROA Payload; abgekürzt: VRP) enthält, welche Provider-Netzwerke (VRP ASN) für jeden aufgezeichneten IP-Adressblock (VRP-Präfix) zum Empfang von Internetverkehr berechtigt sind. Der Netzbetreiber kann diesen Inhalt dann nutzen, um BGP-Routen zu filtern. So kann er z.B. alle "ungültigen" Routen zurückweisen, um zu verhindern, dass Internetverkehr aus seinem Netz an nicht autorisierte Providernetze gesendet wird. Die Überprüfung von Routenankündigungen gegen Routenautorisierungen (RPKI Origin Validation; abgekürzt: ROV) hat die folgenden drei möglichen Ergebnisse. - `Gültig`: Die Routenankündigung der betreffenden IP-Adresse wird mit mindestens einer veröffentlichten Routengenehmigung abgeglichen. Eine Routenzulassung wird auch für spezifischere Routenankündigungen (d.h. für einen Teil des in der Routenzulassung enthaltenen IP-Adressblocks) abgeglichen, es sei denn, sie sind spezifischer als die in der Routenzulassung (über das Attribut `maxLength`) angegebene Grenze. - Ungültig": Die Routenankündigung der betreffenden IP-Adresse ist durch eine Routengenehmigung abgedeckt, aber sie stimmt *nicht* überein. Es gibt zwei mögliche Ursachen: 1. Der IP-Adressblock (Route Prefix) wird von einem Providernetzwerk (Route Origin ASN) angekündigt, das in der Routengenehmigung *nicht* zugelassen ist (Ergebnis in der Tabelle unten: "ungültig (as)"); 2. der angekündigte IP-Adressblock (Route Prefix) ist *kleiner als in der Routenzulassung erlaubt*, d.h. er überschreitet den Wert `maxLength` (Ergebnis in der Tabelle unten: "ungültig (Länge)"). - `NotFound`: Es wurde keine Anweisung mit einer Routenautorisierung gefunden, die die Routenankündigung der betreffenden IP-Adresse abdeckt. Dadurch wird das Routing des Internetverkehrs zu deinem Server unsicherer. Bitte kontaktiere deinen Hoster diesbezüglich. Er kann seinen Netzwerkprovider, dem die IP-Adressen deines Servers gehören, bitten, Routenautorisierungen zu veröffentlichen. **Was ist zu tun, wenn das Testergebnis den Status Ungültig anzeigt?** Der Status "Ungültig" weist auf einen unbeabsichtigten oder böswilligen Fehler in der Routenkonfiguration hin, der von deinem Hoster oder seinem Netzwerkanbieter (interner Fehler) oder von einem Dritten (externer Fehler) verursacht werden kann. In jedem Fall kann er dazu führen, dass dein Server nicht erreichbar ist oder der Internetverkehr zu deinem Server abgefangen wird. Kontaktiere deinen Hoster so schnell wie möglich. Im Falle eines internen Fehlers sollte dein Hoster seinen Netzwerkanbieter, dem die IP-Adressen deines Servers gehören, bitten, den Fehler in der Routenkonfiguration zu beheben. *Anforderungsstufe: Empfohlen*

source: detail web rpki valid label
de: Gültigkeit der Routenansage

source: detail web rpki valid tech table
de: Webserver|BGP-Routenpräfix|BGP-Routenursprungs-ASN|RPKI-Ursprungsvalidierungsstatus

source: detail web rpki valid verdict bad
de: Mindestens eine IP-Adresse deines Webservers hat den Validierungsstatus `NotFound`. Es gibt *keine* RPKI Route Origin Authorization (ROA), die für die Routenankündigung jeder der betroffenen IP-Adressen veröffentlicht wurde.

source: detail web rpki valid verdict good
de: Alle IP-Adressen deines Webservers haben den Validierungsstatus `Valid`. Die Routenankündigung dieser IP-Adressen wird mit der veröffentlichten RPKI Route Origin Authorisation (ROA) abgeglichen.

source: detail web rpki valid verdict invalid
de: Mindestens eine IP-Adresse deines Webservers hat einen "ungültigen" Validierungsstatus. Die Routenankündigung der betroffenen IP-Adressen stimmt *nicht* mit der veröffentlichten RPKI Route Origin Authorisation (ROA) überein. Dies deutet auf einen unbeabsichtigten oder böswilligen Fehler in der Routenkonfiguration hin, der von deinem Webhoster (interner Fehler) oder von einem Dritten (externer Fehler) verursacht werden kann. In beiden Fällen kann er zur Nichterreichbarkeit deines Servers oder zum Abfangen des Internetverkehrs zu deinem Server führen. Kontaktiere deinen Webhoster so schnell wie möglich. Im Falle eines internen Fehlers sollte dein Webhoster seinen Netzwerkanbieter, dem die IP-Adressen deines Servers gehören, bitten, den Fehler in der Routenkonfiguration zu beheben.

source: detail web rpki valid verdict not-routed
de: Dieser Subtest ist *nicht* gelaufen, weil *keine* Routenankündigung für eine der IP-Adressen verfügbar war.

source: detail web tls cert-hostmatch exp
de: Wir prüfen, ob der Domainname deiner Website mit dem Domainnamen auf dem Zertifikat übereinstimmt. Es kann sinnvoll sein, mehr als eine Domain (z. B. die Domain mit und ohne www) als Subject Alternative Name auf dem Zertifikat anzugeben. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B3-1 (auf Englisch).

source: detail web tls cert-hostmatch label
de: Domänenname auf dem Zertifikat

source: detail web tls cert-hostmatch tech table
de: Webserver IP-Adresse|Unübereinstimmende Domänen im Zertifikat

source: detail web tls cert-hostmatch verdict bad
de: Der Domainname deiner Website stimmt *nicht* mit dem Domainnamen auf deinem Website-Zertifikat.

source: detail web tls cert-hostmatch verdict good
de: Der Domainname deiner Website stimmt mit dem Domainnamen auf deinem Website Zertifikat.

source: detail web tls cert-pubkey exp
de: Wir prüfen, ob die digitale Signatur (ECDSA oder RSA) deines Website-Zertifikats sichere Parameter verwendet. Bei der Überprüfung von Zertifikaten werden digitale Signaturen verwendet. Um die Authentizität einer Verbindung zu garantieren, muss ein vertrauenswürdiger Algorithmus für die Zertifikatsprüfung verwendet werden. Der Algorithmus, der zum Signieren eines Zertifikats verwendet wird, wird von seinem Anbieter ausgewählt. Das Zertifikat gibt den Algorithmus für digitale Signaturen an, der von seinem Inhaber beim Schlüsselaustausch verwendet wird. Es ist möglich, mehrere Zertifikate zu konfigurieren, um mehr als einen Algorithmus zu unterstützen. Die Sicherheit von ECDSA digitalen Signaturen hängt von der gewählten Kurve ab. Die Sicherheit von RSA für Verschlüsselung und digitale Signaturen ist an die Schlüssellänge des öffentlichen Schlüssels gebunden. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B5-1 und Tabelle 9 für ECDSA, und Richtlinie B3-3 und Tabelle 8 für RSA (in Englisch). --- **Elliptische Kurven für ECDSA** * Gut: `secp384r1`, `secp256r1`, `x448`, und `x25519` * Auslaufen: `secp224r1` * Unzureichend: Andere Kurven **Länge der RSA-Schlüssel** * Gut: Mindestens 3072 Bit * Ausreichend: 2048 - 3071 bit * Ungenügend: Weniger als 2048 Bit

source: detail web tls cert-pubkey label
de: Öffentlicher Schlüssel des Zertifikats

source: detail web tls cert-pubkey tech table
de: Webserver IP-Adresse|Betroffene Signaturparameter|Status

source: detail web tls cert-pubkey verdict bad
de: Die digitale Signatur deines Website-Zertifikats verwendet *unzureichend* sichere Parameter.

source: detail web tls cert-pubkey verdict good
de: Die digitale Signatur deines Website-Zertifikats verwendet sichere Parameter.

source: detail web tls cert-pubkey verdict phase-out
de: Die digitale Signatur deines Website-Zertifikats verwendet Parameter, die einen *Phase-out*-Status haben, weil sie als anfällig gelten und Gefahr laufen, *unzureichend* sicher zu werden.

source: detail web tls cert-signature exp
de: Wir prüfen, ob der signierte Fingerabdruck des Website-Zertifikats mit einem sicheren Hashing-Algorithmus erstellt wurde. Siehe ['IT Security Guidelines for Transport Layer Security (TLS) v2.1'](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) von NCSC-NL, Richtlinie B3-2 und Tabelle 3 (auf Englisch). --- **Hash-Funktionen für die Zertifikatsüberprüfung** * Gut: SHA-512, SHA-384, SHA-256 * Unzureichend: SHA-1, MD5

source: detail web tls cert-signature label
de: Unterschrift der Bescheinigung

source: detail web tls cert-signature tech table
de: Webserver IP-Adresse|Betroffener Hash-Algorithmus|Status
